{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46865129"
                        ],
                        "name": "Jianbo Shi",
                        "slug": "Jianbo-Shi",
                        "structuredName": {
                            "firstName": "Jianbo",
                            "lastName": "Shi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jianbo Shi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153652147"
                        ],
                        "name": "J. Malik",
                        "slug": "J.-Malik",
                        "structuredName": {
                            "firstName": "Jitendra",
                            "lastName": "Malik",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Malik"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14848918,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b94c7ff9532ab26c3aedbee3988ec4c7a237c173",
            "isKey": false,
            "numCitedBy": 12812,
            "numCiting": 55,
            "paperAbstract": {
                "fragments": [],
                "text": "We propose a novel approach for solving the perceptual grouping problem in vision. Rather than focusing on local features and their consistencies in the image data, our approach aims at extracting the global impression of an image. We treat image segmentation as a graph partitioning problem and propose a novel global criterion, the normalized cut, for segmenting the graph. The normalized cut criterion measures both the total dissimilarity between the different groups as well as the total similarity within the groups. We show that an efficient computational technique based on a generalized eigenvalue problem can be used to optimize this criterion. We have applied this approach to segmenting static images and found results very encouraging."
            },
            "slug": "Normalized-cuts-and-image-segmentation-Shi-Malik",
            "title": {
                "fragments": [],
                "text": "Normalized cuts and image segmentation"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This work treats image segmentation as a graph partitioning problem and proposes a novel global criterion, the normalized cut, for segmenting the graph, which measures both the total dissimilarity between the different groups as well as the total similarity within the groups."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IEEE Computer Society Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50172592"
                        ],
                        "name": "Serge J. Belongie",
                        "slug": "Serge-J.-Belongie",
                        "structuredName": {
                            "firstName": "Serge",
                            "lastName": "Belongie",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Serge J. Belongie"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143751119"
                        ],
                        "name": "Jitendra Malik",
                        "slug": "Jitendra-Malik",
                        "structuredName": {
                            "firstName": "Jitendra",
                            "lastName": "Malik",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jitendra Malik"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1611614,
            "fieldsOfStudy": [
                "Computer Science",
                "Mathematics"
            ],
            "id": "0217380908642d79a05d8db92a775081c94f684a",
            "isKey": false,
            "numCitedBy": 40,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": "We develop an approach to image segmentation for natural scenes containing image texture. One general methodology which shows promise for solving this problem is to characterize textured regions via their responses to a set of filters. However, this approach brings with it many open questions, including how to combine texture and intensity information into a common descriptor and how to deal with the fact that filter responses inside textured regions are generally spatially inhomogeneous. Our goal in this paper is to introduce two new ideas which address these open questions and to demonstrate the application of these ideas to the segmentation of natural images. The first idea consists of a novel means of describing points in natural images and an associated distance function for comparing these descriptors. This distance function is aided in textured regions by the use of the second idea, a new process introduced here which we have termed area completion. Experimental segmentation results which incorporate our proposed approach into the Normalized Cut framework of Shi and Malik are provided for a variety of natural images."
            },
            "slug": "Finding-Boundaries-in-Natural-Images:-A-New-Method-Belongie-Malik",
            "title": {
                "fragments": [],
                "text": "Finding Boundaries in Natural Images: A New Method Using Point Descriptors and Area Completion"
            },
            "tldr": {
                "abstractSimilarityScore": 59,
                "text": "An approach to image segmentation for natural scenes containing image texture is developed which consists of a novel means of describing points in natural images and an associated distance function for comparing these descriptors."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1792404"
                        ],
                        "name": "J. Elder",
                        "slug": "J.-Elder",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Elder",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Elder"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1698824"
                        ],
                        "name": "S. Zucker",
                        "slug": "S.-Zucker",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Zucker",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Zucker"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "This may take the form of explicitly enforcing closure of contours as in [ 4 , 11]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 2944269,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "018a317f615c51e060ab3dc330e282eed917c8d5",
            "isKey": false,
            "numCitedBy": 211,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": "Existing methods for grouping edges on the basis of local smoothness measures fail to compute complete contours in natural images: it appears that a stronger global constraint is required. Motivated by growing evidence that the human visual system exploits contour closure for the purposes of perceptual grouping [6, 7, 14, 15, 25], we present an algorithm for computing highly closed bounding contours from images. Unlike previous algorithms [11, 18, 26], no restrictions are placed on the type of structure bounded or its shape. Contours are represented locally by tangent vectors, augmented by image intensity estimates. A Bayesian model is developed for the likelihood that two tangent vectors form contiguous components of the same contour. Based on this model, a sparsely-connected graph is constructed, and the problem of computing closed contours is posed as the computation of shortest-path cycles in this graph. We show that simple tangent cycles can be efficiently computed in natural images containing many local ambiguities, and that these cycles generally correspond to bounding contours in the image. These closure computations can potentially complement region-grouping methods by extending the class of structures segmented to include heterogeneous structures."
            },
            "slug": "Computing-Contour-Closure-Elder-Zucker",
            "title": {
                "fragments": [],
                "text": "Computing Contour Closure"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "It is shown that simple tangent cycles can be efficiently computed in natural images containing many local ambiguities, and that these cycles generally correspond to bounding contours in the image."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46865129"
                        ],
                        "name": "Jianbo Shi",
                        "slug": "Jianbo-Shi",
                        "structuredName": {
                            "firstName": "Jianbo",
                            "lastName": "Shi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jianbo Shi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143751119"
                        ],
                        "name": "Jitendra Malik",
                        "slug": "Jitendra-Malik",
                        "structuredName": {
                            "firstName": "Jitendra",
                            "lastName": "Malik",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jitendra Malik"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11286145,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "cda4d5b174cb14462094b213d4c37d51c72a7971",
            "isKey": false,
            "numCitedBy": 30,
            "numCiting": 32,
            "paperAbstract": {
                "fragments": [],
                "text": "We propose a new feature distance which is derived from an optimal relational graph matching criterion. Instead of defining an arbitrary similarity measure for grouping, we will use the criterion of reducing instability in the relational graph to induce a similarity measure. This similarity measure not only improves the stability of the matching, but more importantly, also captures the relative importance of relational similarity in the feature space for the purpose of grouping. We will call this similarity measure the self-induced relational distance. We demonstrate the distance measure on a brightness-texture feature space and apply it to the segmentation of complex natural images."
            },
            "slug": "Self-Inducing-Relational-Distance-and-Its-to-Image-Shi-Malik",
            "title": {
                "fragments": [],
                "text": "Self Inducing Relational Distance and Its Application to Image Segmentation"
            },
            "tldr": {
                "abstractSimilarityScore": 59,
                "text": "A new feature distance is proposed which is derived from an optimal relational graph matching criterion and is called the self-induced relational distance, which captures the relative importance of relational similarity in the feature space for the purpose of grouping."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34734622"
                        ],
                        "name": "D. Jacobs",
                        "slug": "D.-Jacobs",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Jacobs",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Jacobs"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 12172268,
            "fieldsOfStudy": [
                "Computer Science",
                "Mathematics"
            ],
            "id": "f546e10689e4f4557b12ae34a777bab50f78b0cb",
            "isKey": false,
            "numCitedBy": 221,
            "numCiting": 55,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes an algorithm that robustly locates salient convex collections of line segments in an image. The algorithm is guaranteed to find all convex sets of line segments in which the length of the gaps between segments is smaller than some fixed proportion of the total length of the lines. This enables the algorithm to find convex groups whose contours are partially occluded or missing due to noise. We give an expected case analysis of the algorithm performance. This demonstrates that salient convexity is unlikely to occur at random, and hence is a strong clue that grouped line segments reflect underlying structure in the scene. We also show that our algorithm run time is O(n/sup 2/log(n)+nm), when we wish to find the m most salient groups in an image with n line segments. We support this analysis with experiments on real data, and demonstrate the grouping system as part of a complete recognition system."
            },
            "slug": "Robust-and-Efficient-Detection-of-Salient-Convex-Jacobs",
            "title": {
                "fragments": [],
                "text": "Robust and Efficient Detection of Salient Convex Groups"
            },
            "tldr": {
                "abstractSimilarityScore": 88,
                "text": "An algorithm that robustly locates salient convex collections of line segments in an image that is guaranteed to find all convex sets ofline segments in which the length of the gaps between segments is smaller than some fixed proportion of the totallength of the lines."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1952010"
                        ],
                        "name": "E. Sharon",
                        "slug": "E.-Sharon",
                        "structuredName": {
                            "firstName": "Eitan",
                            "lastName": "Sharon",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Sharon"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144880062"
                        ],
                        "name": "A. Brandt",
                        "slug": "A.-Brandt",
                        "structuredName": {
                            "firstName": "Achi",
                            "lastName": "Brandt",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Brandt"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1760994"
                        ],
                        "name": "R. Basri",
                        "slug": "R.-Basri",
                        "structuredName": {
                            "firstName": "Ronen",
                            "lastName": "Basri",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Basri"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2106226,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f333a0262e35977236636706d06a85fdf74ec7b0",
            "isKey": false,
            "numCitedBy": 61,
            "numCiting": 68,
            "paperAbstract": {
                "fragments": [],
                "text": "The detection of smooth curves in images and their completion over gaps are two important problems in perceptual grouping. In this paper we examine the notion of completion energy and introduce a fast method to compute the most likely completions in images. Specifically we develop two novel analytic approximations to the curve of least energy. In addition, we introduce a fast numerical method to compute the curve of least energy, and show that our approximations are obtained at early stages of this numerical computation. We then use our newly developed energies to find the most likely completions in images through a generalized summation of induction fields. Since in practice edge elements are obtained by applying filters of certain widths and lengths to the image, we adjust our computation to take these parameters into account. Finally, we show that, due to the smoothness of the kernel of summation, the process of summing induction fields can be run in time that is linear in the number of different edge elements in the image, or in O(N log N) where N is the number of pixels in the image, using multigrid methods."
            },
            "slug": "Completion-energies-and-scale-Sharon-Brandt",
            "title": {
                "fragments": [],
                "text": "Completion Energies and Scale"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The notion of completion energy is examined and a fast method to compute the most likely completions in images is introduced and two novel analytic approximations to the curve of least energy are developed."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2996138"
                        ],
                        "name": "F. Heitger",
                        "slug": "F.-Heitger",
                        "structuredName": {
                            "firstName": "Friedrich",
                            "lastName": "Heitger",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Heitger"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3217370"
                        ],
                        "name": "R. von der Heydt",
                        "slug": "R.-von-der-Heydt",
                        "structuredName": {
                            "firstName": "Rüdiger",
                            "lastName": "von der Heydt",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. von der Heydt"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "150253855"
                        ],
                        "name": "O. Kubler",
                        "slug": "O.-Kubler",
                        "structuredName": {
                            "firstName": "Olaf",
                            "lastName": "Kubler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Kubler"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 124560123,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "379486ee92892ffeac5f8704bde97d69f365ca52",
            "isKey": false,
            "numCitedBy": 30,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a computational model of contour processing that was suggested by neurophysiological recordings from the monkey visual cortex. The model employs convolutions and nonlinear operations, but no feedback loops. Contours are defined by the local maxima of the responses of a contour operator that sums a representation of contrast borders and a \"grouping signal\". The grouping consists in convolving a representation of \"key points\", such as T-junctions, corners, and line ends, with a set of orientation selective kernels, and a nonlinear pairing operation. The grouping scheme is selective according to whether the configuration of key points is consistent with the interpretation of occlusion. The resulting contour representation includes an indicator of figure ground direction. We show: that the model reproduces illusory contours in accurate agreement with perception; and generates representations of occluding contours on images of natural scenes that are more complete and less cluttered by spurious connections of foreground and background than those obtained by conventional edge detection operators."
            },
            "slug": "A-computational-model-of-neural-contour-processing:-Heitger-Heydt",
            "title": {
                "fragments": [],
                "text": "A computational model of neural contour processing: figure-ground segregation and illusory contours"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of PerAc '94. From Perception to Action"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2087960"
                        ],
                        "name": "M. Morrone",
                        "slug": "M.-Morrone",
                        "structuredName": {
                            "firstName": "Maria",
                            "lastName": "Morrone",
                            "middleNames": [
                                "Concetta"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Morrone"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689848"
                        ],
                        "name": "R. Owens",
                        "slug": "R.-Owens",
                        "structuredName": {
                            "firstName": "Robyn",
                            "lastName": "Owens",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Owens"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 10529158,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "d29ff76d83d7055e6a8be39ea42ea7e04b21e6b2",
            "isKey": false,
            "numCitedBy": 688,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Feature-detection-from-local-energy-Morrone-Owens",
            "title": {
                "fragments": [],
                "text": "Feature detection from local energy"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit. Lett."
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40533085"
                        ],
                        "name": "G. Guy",
                        "slug": "G.-Guy",
                        "structuredName": {
                            "firstName": "Gideon",
                            "lastName": "Guy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Guy"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3463966"
                        ],
                        "name": "G. Medioni",
                        "slug": "G.-Medioni",
                        "structuredName": {
                            "firstName": "Gérard",
                            "lastName": "Medioni",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Medioni"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 41281582,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "549cc4a49269edbcf086cf7dad8ff286980e5e46",
            "isKey": false,
            "numCitedBy": 327,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "An attempt is made to solve the problem of imperfect data produced by state-of-the-art edge detectors through the implementation of laws of perceptual grouping, derived from psychology. A saliency-enhancing operator is introduced. It is capable of highlighting features (edges, junctions, etc.) which are considered important psychologically. It also infers features which are not detected by low-level detectors. It is shown how to extract salient curves and junctions and generate a description ranking these features by the likelihood of them occurring accidentally. The problem of illusory contours apparent in end-point formations is discussed. All operations are parameter-free, noniterative and are linear with the number of edges in the input image.<<ETX>>"
            },
            "slug": "Inferring-global-perceptual-contours-from-local-Guy-Medioni",
            "title": {
                "fragments": [],
                "text": "Inferring global perceptual contours from local features"
            },
            "tldr": {
                "abstractSimilarityScore": 98,
                "text": "An attempt is made to solve the problem of imperfect data produced by state-of-the-art edge detectors through the implementation of laws of perceptual grouping, derived from psychology, and a saliency-enhancing operator is introduced."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IEEE Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38336119"
                        ],
                        "name": "P. Parent",
                        "slug": "P.-Parent",
                        "structuredName": {
                            "firstName": "Pierre",
                            "lastName": "Parent",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Parent"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1698824"
                        ],
                        "name": "S. Zucker",
                        "slug": "S.-Zucker",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Zucker",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Zucker"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6779369,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8c21b3372894b25ed595a73ff058ec5876976ca6",
            "isKey": false,
            "numCitedBy": 567,
            "numCiting": 44,
            "paperAbstract": {
                "fragments": [],
                "text": "An approach is described for curve inference that is based on curvature information. The inference procedure is divided into two stages: a trace inference stage, which is the subject of the present work, and a curve synthesis stage. It is shown that recovery of the trace of a curve requires estimating local models for the curve at the same time, and that tangent and curvature information are sufficient. These make it possible to specify powerful constraints between estimated tangents to a curve, in terms of a neighborhood relationship called cocircularity, and between curvature estimates, in terms of a curvature consistency relation. Because all curve information is quantized, special care must be taken to obtain accurate estimates of trace points, tangents, and curvatures. This issue is addressed specifically to the introduction of a smoothness constraint and a maximum curvature constraint. The procedure is applied to two types of images: artificial images designed to evaluate curvature and noise sensitivity, and natural images. >"
            },
            "slug": "Trace-Inference,-Curvature-Consistency,-and-Curve-Parent-Zucker",
            "title": {
                "fragments": [],
                "text": "Trace Inference, Curvature Consistency, and Curve Detection"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "It is shown that recovery of the trace of a curve requires estimating local models for the curve at the same time, and that tangent and curvature information are sufficient, which make it possible to specify powerful constraints between estimated tangents to a curve."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3140335"
                        ],
                        "name": "A. Shashua",
                        "slug": "A.-Shashua",
                        "structuredName": {
                            "firstName": "Amnon",
                            "lastName": "Shashua",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Shashua"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743045"
                        ],
                        "name": "S. Ullman",
                        "slug": "S.-Ullman",
                        "structuredName": {
                            "firstName": "Shimon",
                            "lastName": "Ullman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ullman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 38536052,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "8437bb1a15eb2c2a09abbcae3cf6ae0210d26eae",
            "isKey": false,
            "numCitedBy": 661,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Certain salient structures in images attract our immediate attention without requiring a systematic scan. We present a method for computing saliency by a simple iterative scheme, using a uniform network of locally connected processing elements. The network uses an optimization approach to produce a ``saliency map,'''' a representation of the image emphasizing salient locations. The main properties of the network are: (i) the computations are simple and local, (ii) globally salient structures emerge with a small number of iterations, and (iii) as a by-product of the computations, contours are smoothed and gaps are filled in."
            },
            "slug": "Structural-Saliency:-The-Detection-Of-Globally-A-Shashua-Ullman",
            "title": {
                "fragments": [],
                "text": "Structural Saliency: The Detection Of Globally Salient Structures using A Locally Connected Network"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "A method for computing saliency by a simple iterative scheme, using a uniform network of locally connected processing elements, to produce a ``saliency map,'''' a representation of the image emphasizing salient locations."
            },
            "venue": {
                "fragments": [],
                "text": "[1988 Proceedings] Second International Conference on Computer Vision"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1690890"
                        ],
                        "name": "U. Montanari",
                        "slug": "U.-Montanari",
                        "structuredName": {
                            "firstName": "Ugo",
                            "lastName": "Montanari",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "U. Montanari"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 14034879,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "223c2759db1f1e29b584fe6c7bafb949b67711ca",
            "isKey": false,
            "numCitedBy": 321,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : A technique for recognizing systems of lines is presented, in which the heuristic of the problem is not embedded in the recognition algorithm but is expressed in a figure of merit. A multistage decision process is then able to recognize in the input picture the optimal system of lines according to the given figure of merit. Due to the global approach, greater flexibility and adequacy in the particular problem is achieved. The relation between the structure of the figure of merit and the complexity of the optimization process is then discussed. (Modified author abstract)"
            },
            "slug": "On-the-optimal-detection-of-curves-in-noisy-Montanari",
            "title": {
                "fragments": [],
                "text": "On the optimal detection of curves in noisy pictures"
            },
            "tldr": {
                "abstractSimilarityScore": 79,
                "text": "A technique for recognizing systems of lines is presented, in which the heuristic of the problem is not embedded in the recognition algorithm but is expressed in a figure of merit, which allows for greater flexibility and adequacy in the particular problem."
            },
            "venue": {
                "fragments": [],
                "text": "CACM"
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49649079"
                        ],
                        "name": "D. Field",
                        "slug": "D.-Field",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Field",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Field"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145957449"
                        ],
                        "name": "A. Hayes",
                        "slug": "A.-Hayes",
                        "structuredName": {
                            "firstName": "Anthony",
                            "lastName": "Hayes",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Hayes"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32477129"
                        ],
                        "name": "R. Hess",
                        "slug": "R.-Hess",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Hess",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Hess"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 205016575,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "4bc789a006fa0b8a1e4f2cf51c021328fc8886cc",
            "isKey": false,
            "numCitedBy": 1623,
            "numCiting": 68,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Contour-integration-by-the-human-visual-system:-for-Field-Hayes",
            "title": {
                "fragments": [],
                "text": "Contour integration by the human visual system: Evidence for a local “association field”"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "14489533"
                        ],
                        "name": "D. Geiger",
                        "slug": "D.-Geiger",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Geiger",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Geiger"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143877443"
                        ],
                        "name": "K. Kumaran",
                        "slug": "K.-Kumaran",
                        "structuredName": {
                            "firstName": "Krishnan",
                            "lastName": "Kumaran",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Kumaran"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 27805874,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "630792c6ff87e6b306acfac924cc1c127442ed6f",
            "isKey": false,
            "numCitedBy": 10,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "A common factor in all illusory contour figures is the perception of a surface occluding part of a background. These surfaces are not constrained to be at constant depth and they can cross other surfaces. We address the problem of how the image organizations that yield illusory contours arise. Our approach is to iteratively find the most salient surface by (i) detecting occlusions; (ii) assigning salient-surface-states, a set of hypothesis of the local salient surface configuration; (iii, applying a Bayesian model to diffuse these salient-surface-states; and (iv) efficiently selecting the best image organization (set of hypothesis) based on the resulting diffused surface."
            },
            "slug": "Visual-Organization-of-Illusory-Surfaces-Geiger-Kumaran",
            "title": {
                "fragments": [],
                "text": "Visual Organization of Illusory Surfaces"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "The approach is to iteratively find the most salient surface by detecting occlusions, assigning salient-surface-states, a set of hypothesis of the local salient surface configuration, and efficiently selecting the best image organization based on the resulting diffused surface."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144042261"
                        ],
                        "name": "Mark Nitzberg",
                        "slug": "Mark-Nitzberg",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Nitzberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Mark Nitzberg"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2082087031"
                        ],
                        "name": "David Mumford",
                        "slug": "David-Mumford",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Mumford",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "David Mumford"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2071277858"
                        ],
                        "name": "Takahiro Shiota",
                        "slug": "Takahiro-Shiota",
                        "structuredName": {
                            "firstName": "Takahiro",
                            "lastName": "Shiota",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Takahiro Shiota"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 19955526,
            "fieldsOfStudy": [
                "Geology",
                "Medicine"
            ],
            "id": "ce9c4a8c292b59894a359ad485371b95a6d02d67",
            "isKey": false,
            "numCitedBy": 361,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Overview.- Filtering for occlusion detection.- Finding contours and junctions.- Continuations.- Finding the 2.1D sketch.- Conclusion."
            },
            "slug": "Filtering,-Segmentation-and-Depth-Nitzberg-Mumford",
            "title": {
                "fragments": [],
                "text": "Filtering, Segmentation and Depth"
            },
            "tldr": {
                "abstractSimilarityScore": 70,
                "text": "The 2.1D sketch was found by filtering for occlusion detection and finding contours and junctions and finding the 2.2D sketch by following the dotted line pattern."
            },
            "venue": {
                "fragments": [],
                "text": "Lecture Notes in Computer Science"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2868430"
                        ],
                        "name": "P. Kellman",
                        "slug": "P.-Kellman",
                        "structuredName": {
                            "firstName": "Philip",
                            "lastName": "Kellman",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Kellman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1773234"
                        ],
                        "name": "T. Shipley",
                        "slug": "T.-Shipley",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Shipley",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Shipley"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 39742088,
            "fieldsOfStudy": [
                "Philosophy"
            ],
            "id": "3527d38ae640b25250001995127cb147aefd16ee",
            "isKey": false,
            "numCitedBy": 702,
            "numCiting": 79,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-theory-of-visual-interpolation-in-object-Kellman-Shipley",
            "title": {
                "fragments": [],
                "text": "A theory of visual interpolation in object perception"
            },
            "venue": {
                "fragments": [],
                "text": "Cognitive Psychology"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2955375"
                        ],
                        "name": "L. Williams",
                        "slug": "L.-Williams",
                        "structuredName": {
                            "firstName": "Lance",
                            "lastName": "Williams",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Williams"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34734622"
                        ],
                        "name": "D. Jacobs",
                        "slug": "D.-Jacobs",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Jacobs",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Jacobs"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2216697,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "192f196407550531c6c4c3914e430709e834f24d",
            "isKey": false,
            "numCitedBy": 53,
            "numCiting": 44,
            "paperAbstract": {
                "fragments": [],
                "text": "We describe a local parallel method for computing the stochastic completion field introduced in the previous article (Williams and Jacobs, 1997). The stochastic completion field represents the likelihood that a completion joining two contour fragments passes through any given position and orientation in the image plane. It is based on the assumption that the prior probability distribution of completion shape can be modeled as a random walk in a lattice of discrete positions and orientations. The local parallel method can be interpreted as a stable finite difference scheme for solving the underlying Fokker-Planck equation identified by Mumford (1994). The resulting algorithm is significantly faster than the previously employed method, which relied on convolution with large-kernel filters computed by Monte Carlo simulation. The complexity of the new method is O (n3m), while that of the previous algorithm was O(n4m2 (for an n n image with m discrete orientations). Perhaps most significant, the use of a local method allows us to model the probability distribution of completion shape using stochastic processes that are neither homogeneous nor isotropic. For example, it is possible to modulate particle decay rate by a directional function of local image brightnesses (i.e., anisotropic decay). The effect is that illusory contours can be made to respect the local image brightness structure. Finally, we note that the new method is more plausible as a neural model since (1) unlike the previous method, it can be computed in a sparse, locally connected network, and (2) the network dynamics are consistent with psychophysical measurements of the time course of illusory contour formation."
            },
            "slug": "Local-Parallel-Computation-of-Stochastic-Completion-Williams-Jacobs",
            "title": {
                "fragments": [],
                "text": "Local Parallel Computation of Stochastic Completion Fields"
            },
            "tldr": {
                "abstractSimilarityScore": 53,
                "text": "A local parallel method for computing the stochastic completion field that is more plausible as a neural model since it can be computed in a sparse, locally connected network, and the network dynamics are consistent with psychophysical measurements of the time course of illusory contour formation."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "117481816"
                        ],
                        "name": "D. Mumford",
                        "slug": "D.-Mumford",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Mumford",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Mumford"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 117913161,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "e4998968c1b2ca9e672f2d36157c72aee2b77469",
            "isKey": false,
            "numCitedBy": 482,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "I want to discuss the problem from differential geometry of describing those plane curves C which minimize the integral \n \n$$\\int\\limits_C {(\\alpha k^2 + \\beta )ds.}$$ \n \nHere α and β are constants, kis the curvature of C, ds the arc length and, to make the fewest boundary conditions, we mean minimizing for infinitesimal variations of C on a compact set not containing the endpoints of C. Alternately, one may minimize \n \n$$\\int\\limits_C {k^2 ds}$$ \n \nover variations of C which preserve the total length."
            },
            "slug": "Elastica-and-Computer-Vision-Mumford",
            "title": {
                "fragments": [],
                "text": "Elastica and Computer Vision"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2459416"
                        ],
                        "name": "B. Dubuc",
                        "slug": "B.-Dubuc",
                        "structuredName": {
                            "firstName": "Benoit",
                            "lastName": "Dubuc",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Dubuc"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1698824"
                        ],
                        "name": "S. Zucker",
                        "slug": "S.-Zucker",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Zucker",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Zucker"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 13800067,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "73e50a04d420ee4c66391d4a7ae09cfbe5037028",
            "isKey": false,
            "numCitedBy": 21,
            "numCiting": 30,
            "paperAbstract": {
                "fragments": [],
                "text": "In differential geometry curves are characterized as mappings from an interval to the plane. In topology curves are characterized as a Hausdorff space with certain countability properties. Neither of these definitions captures the role that curves play in vision, however, in which curves can denote simple objects (such as a straight line), or complicated objects (such as a jumble of string). The difference between these situations is in part a measure of their complexity, and in part a measure of their dimensionality. Note that the map defining such curves is unknown, as is the proper way to represent them. We propose a formal complexity theory of curves appropriate for computational vision in general, and for problems like separating straight lines from jumbles in particular. The theory is applied to the problem of perceptual grouping.<<ETX>>"
            },
            "slug": "Indexing-visual-representations-through-the-map-Dubuc-Zucker",
            "title": {
                "fragments": [],
                "text": "Indexing visual representations through the complexity map"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "A formal complexity theory of curves is proposed appropriate for computational vision in general and for problems like separating straight lines from jumbles in particular, and the theory is applied to the problem of perceptual grouping."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IEEE International Conference on Computer Vision"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "117481816"
                        ],
                        "name": "D. Mumford",
                        "slug": "D.-Mumford",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Mumford",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Mumford"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "80271822"
                        ],
                        "name": "J. Shah",
                        "slug": "J.-Shah",
                        "structuredName": {
                            "firstName": "Jayant",
                            "lastName": "Shah",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Shah"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 222243846,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "a1067e837c7cbbefb30f8324c1eacb1afde39fc6",
            "isKey": false,
            "numCitedBy": 5156,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : This reprint will introduce and study the most basic properties of three new variational problems which are suggested by applications to computer vision. In computer vision, a fundamental problem is to appropriately decompose the domain R of a function g (x,y) of two variables. This problem starts by describing the physical situation which produces images: assume that a three-dimensional world is observed by an eye or camera from some point P and that g1(rho) represents the intensity of the light in this world approaching the point sub 1 from a direction rho. If one has a lens at P focusing this light on a retina or a film-in both cases a plane domain R in which we may introduce coordinates x, y then let g(x,y) be the strength of the light signal striking R at a point with coordinates (x,y); g(x,y) is essentially the same as sub 1 (rho) -possibly after a simple transformation given by the geometry of the imaging syste. The function g(x,y) defined on the plane domain R will be called an image. What sort of function is g? The light reflected off the surfaces Si of various solid objects O sub i visible from P will strike the domain R in various open subsets R sub i. When one object O1 is partially in front of another object O2 as seen from P, but some of object O2 appears as the background to the sides of O1, then the open sets R1 and R2 will have a common boundary (the 'edge' of object O1 in the image defined on R) and one usually expects the image g(x,y) to be discontinuous along this boundary. (JHD)"
            },
            "slug": "Optimal-approximations-by-piecewise-smooth-and-Mumford-Shah",
            "title": {
                "fragments": [],
                "text": "Optimal approximations by piecewise smooth functions and associated variational problems"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3194361"
                        ],
                        "name": "S. Geman",
                        "slug": "S.-Geman",
                        "structuredName": {
                            "firstName": "Stuart",
                            "lastName": "Geman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Geman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1707642"
                        ],
                        "name": "D. Geman",
                        "slug": "D.-Geman",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "Geman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Geman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 5837272,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "459b30a9a960080f3b313e41886b1aa0e51e882c",
            "isKey": false,
            "numCitedBy": 18704,
            "numCiting": 60,
            "paperAbstract": {
                "fragments": [],
                "text": "We make an analogy between images and statistical mechanics systems. Pixel gray levels and the presence and orientation of edges are viewed as states of atoms or molecules in a lattice-like physical system. The assignment of an energy function in the physical system determines its Gibbs distribution. Because of the Gibbs distribution, Markov random field (MRF) equivalence, this assignment also determines an MRF image model. The energy function is a more convenient and natural mechanism for embodying picture attributes than are the local characteristics of the MRF. For a range of degradation mechanisms, including blurring, nonlinear deformations, and multiplicative or additive noise, the posterior distribution is an MRF with a structure akin to the image model. By the analogy, the posterior distribution defines another (imaginary) physical system. Gradual temperature reduction in the physical system isolates low energy states (``annealing''), or what is the same thing, the most probable states under the Gibbs distribution. The analogous operation under the posterior distribution yields the maximum a posteriori (MAP) estimate of the image given the degraded observations. The result is a highly parallel ``relaxation'' algorithm for MAP estimation. We establish convergence properties of the algorithm and we experiment with some simple pictures, for which good restorations are obtained at low signal-to-noise ratios."
            },
            "slug": "Stochastic-Relaxation,-Gibbs-Distributions,-and-the-Geman-Geman",
            "title": {
                "fragments": [],
                "text": "Stochastic Relaxation, Gibbs Distributions, and the Bayesian Restoration of Images"
            },
            "tldr": {
                "abstractSimilarityScore": 52,
                "text": "The analogy between images and statistical mechanics systems is made and the analogous operation under the posterior distribution yields the maximum a posteriori (MAP) estimate of the image given the degraded observations, creating a highly parallel ``relaxation'' algorithm for MAP estimation."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1728376"
                        ],
                        "name": "K. Nakayama",
                        "slug": "K.-Nakayama",
                        "structuredName": {
                            "firstName": "Ken",
                            "lastName": "Nakayama",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Nakayama"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47706614"
                        ],
                        "name": "S. Shimojo",
                        "slug": "S.-Shimojo",
                        "structuredName": {
                            "firstName": "Shinsuke",
                            "lastName": "Shimojo",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Shimojo"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 10037540,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "f9182e326a4b82e59769da1080daa52d74a4cbe3",
            "isKey": false,
            "numCitedBy": 372,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "A theoretical framework is proposed to understand binocular visual surface perception based on the idea of a mobile observer sampling images from random vantage points in space. Application of the generic sampling principle indicates that the visual system acts as if it were viewing surface layouts from generic not accidental vantage points. Through the observer's experience of optical sampling, which can be characterized geometrically, the visual system makes associative connections between images and surfaces, passively internalizing the conditional probabilities of image sampling from surfaces. This in turn enables the visual system to determine which surface a given image most strongly indicates. Thus, visual surface perception can be considered as inverse ecological optics based on learning through ecological optics. As such, it is formally equivalent to a degenerate form of Bayesian inference where prior probabilities are neglected."
            },
            "slug": "Experiencing-and-perceiving-visual-surfaces.-Nakayama-Shimojo",
            "title": {
                "fragments": [],
                "text": "Experiencing and perceiving visual surfaces."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38361753"
                        ],
                        "name": "M. Concetta Morrone",
                        "slug": "M.-Concetta-Morrone",
                        "structuredName": {
                            "firstName": "Maria",
                            "lastName": "Concetta Morrone",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Concetta Morrone"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2299127"
                        ],
                        "name": "D. Burr",
                        "slug": "D.-Burr",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Burr",
                            "middleNames": [
                                "Charles"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Burr"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 32945737,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "992f61cd4b86fd5f1415308cacda7cdc0280511b",
            "isKey": false,
            "numCitedBy": 741,
            "numCiting": 63,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents a simple and biologically plausible model of how mammalian visual systems could detect and identify features in an image. We suggest that the points in a waveform that have unique perceptual significance as ‘lines’ and ‘edges’ are the points where the Fourier components of the waveform come into phase with each other. At these points ‘local energy’ is maximal. Local energy is defined as the square root of the sum of the squared response of sets of matched filters, of identical amplitude spectrum but differing in phase spectrum by 90°: one filter type has an even-symmetric line-spread function, the other an odd-symmetric line-spread function. For a line the main contribution to the local energy peak is in the output of the even-symmetric filters, whereas for edges it is in the output of the odd-symmetric filters. If both filter types respond at the peak of local energy, both edges and lines are seen, either simultaneously or alternating in time. The model was tested with a series of images, and shown to predict well the position of perceived features and the organization of the images."
            },
            "slug": "Feature-detection-in-human-vision:-a-energy-model-Morrone-Burr",
            "title": {
                "fragments": [],
                "text": "Feature detection in human vision: a phase-dependent energy model"
            },
            "tldr": {
                "abstractSimilarityScore": 93,
                "text": "A simple and biologically plausible model of how mammalian visual systems could detect and identify features in an image is presented and it is suggested that the points in a waveform that have unique perceptual significance as ‘lines’ and ‘edges’ are the points where the Fourier components of the waveform come into phase with each other."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143814637"
                        ],
                        "name": "Berthold K. P. Horn",
                        "slug": "Berthold-K.-P.-Horn",
                        "structuredName": {
                            "firstName": "Berthold",
                            "lastName": "Horn",
                            "middleNames": [
                                "K.",
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Berthold K. P. Horn"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 27876502,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "2d4e7524414c59117a1bfa720263dcd86ef8033b",
            "isKey": false,
            "numCitedBy": 257,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "SUMMARY We have found the simple equation ± w = Vcos (ip — y), and solved it to find theequation of the curve of least energy in Whewell form s == ± V2 c F{ cos\" 1 Vcos(^ — <p), — | .\\ ^^, / We also developed a differential equation for the curve in Cartesian coordinatesaligned with the axis of symmetry, dy _ ^/l-(y/2c) 4 dx (y/2c} 2 ' The solution of this equation, for given initial conditions, led to x=^/2c\\2E(cos- l ^,- l -\\-F(cos- l ^,- l -}~\\.[ \\ 2c'^) \\ 2c'V2/J We considered the curve of least energy connecting the point (—1, 0) to thepoint (+1, 0) with vertical initial and final orientations. This curve has minimumradius of curvature _ r(j) 2 c (2^) 3/2 ' rises to a heighthas arc lengthand energy X= Jf=2c, cr^^ird) 4 2^2 (27r) 2 '._ 1 _ w ' c 2 ro) 4 ' or about 91.39 percent of that of the simple semicircle approximation. We havealso given a method for finding approximations, consisting of circular arcs, to thecurve of least energy.Note that the curve found here is"
            },
            "slug": "The-Curve-of-Least-Energy-Horn",
            "title": {
                "fragments": [],
                "text": "The Curve of Least Energy"
            },
            "tldr": {
                "abstractSimilarityScore": 74,
                "text": "The simple equation ± w = Vcos (ip — y) is found and solved to find the equation of the curve of least energy in Whewell form, and a differential equation for the curve in Cartesian coordinates aligned with the axis of symmetry is developed."
            },
            "venue": {
                "fragments": [],
                "text": "TOMS"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144806578"
                        ],
                        "name": "M. Wertheimer",
                        "slug": "M.-Wertheimer",
                        "structuredName": {
                            "firstName": "Max",
                            "lastName": "Wertheimer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Wertheimer"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 143283358,
            "fieldsOfStudy": [
                "Education"
            ],
            "id": "43a0503e38b4c47a5b794c04439299bd78310189",
            "isKey": false,
            "numCitedBy": 1467,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Theoretically I might say there were 327 brightnesses and nuances of colour. Do I have \"327\"? No. I have sky, house, and trees. It is impossible to achieve \"327 \" as such. And yet even though such droll calculation were possible and implied, say, for the house 120, the trees 90, the sky 117 -I should at least have this arrangement and division of the total, and not, say, 127 and 100 and 100; or 150 and 177."
            },
            "slug": "Laws-of-organization-in-perceptual-forms.-Wertheimer",
            "title": {
                "fragments": [],
                "text": "Laws of organization in perceptual forms."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1938
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40254695"
                        ],
                        "name": "F. Schumann",
                        "slug": "F.-Schumann",
                        "structuredName": {
                            "firstName": "Frank",
                            "lastName": "Schumann",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Schumann"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 142148959,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "d7a5fede99f70a05bc2ebcb1f2557905bb785f51",
            "isKey": false,
            "numCitedBy": 14,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Without a doubt, the view is now commonly held that there is only one source of knowledge in psychology: experience. And naturally, it is primarily a question of inner experience or introspection. It is known, however, that in comparison to outer perception, inner perception is so unreliable that only few of the facts obtained by this method can really be stated with confidence. If we look at the data from different experimenters of today, there are very few results of introspection that are even to some extent in agreement. Because of this, introspection alone as it is normally practiced does not give a solid enough foundation for developing the science of psychology. In fact, the scientists who try to discover comprehensive laws that rule mental events also use numerous hypothetical assumptions, so that the reliability of their claims naturally suffers considerably."
            },
            "slug": "Contributions-to-the-Analysis-of-Visual-Paper:-Some-Schumann",
            "title": {
                "fragments": [],
                "text": "Contributions to the Analysis of Visual Perception—First Paper: Some Observations on the Combination of Visual Impressions into Units"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 54,
                                "start": 50
                            }
                        ],
                        "text": "Subjective contours, first discovered by Schumann [22], were studied extensively by Kanizsa [12]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 11,
                                "start": 3
                            }
                        ],
                        "text": "F. Schumann."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 47,
                                "start": 39
                            }
                        ],
                        "text": "Subjective contours, rst discovered by Schumann [22], werestudied extensively by Kanizsa [12]."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "some observations on the combination of visual impressions into units (a"
            },
            "venue": {
                "fragments": [],
                "text": "hogg, trans.). In S. Petry and G. Meyer, editors, The perception of illusory contours. Springer-Verlag, 1987."
            },
            "year": 1900
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47569647"
                        ],
                        "name": "G. Kanizsa",
                        "slug": "G.-Kanizsa",
                        "structuredName": {
                            "firstName": "Gaetano",
                            "lastName": "Kanizsa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Kanizsa"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3102168"
                        ],
                        "name": "P. Legrenzi",
                        "slug": "P.-Legrenzi",
                        "structuredName": {
                            "firstName": "Paolo",
                            "lastName": "Legrenzi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Legrenzi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "115014957"
                        ],
                        "name": "P. Bozzi",
                        "slug": "P.-Bozzi",
                        "structuredName": {
                            "firstName": "Paolo",
                            "lastName": "Bozzi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Bozzi"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 142706095,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "1dcf4dae9bb04f25d12967b03e7e46d51717be44",
            "isKey": false,
            "numCitedBy": 857,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Organization-in-Vision:-Essays-on-Gestalt-Kanizsa-Legrenzi",
            "title": {
                "fragments": [],
                "text": "Organization in Vision: Essays on Gestalt Perception"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 150,
                                "start": 147
                            }
                        ],
                        "text": "Di erent models of subjective contour completion from these keypoints are proposed: variational models [6, 20], random walk [29] or a grouping eld [9]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 46,
                                "start": 39
                            }
                        ],
                        "text": "Occlusion reasoning is also studied in [9, 20]."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A computational model of neural contour pro cessing"
            },
            "venue": {
                "fragments": [],
                "text": "In Proc. Int. Conf. Computer"
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Elastica and computer vision Algebraic Geometry and Its Applications 550 Contour continuity in region based image segmentation 559"
            },
            "venue": {
                "fragments": [],
                "text": "Chandrajit Bajaj"
            },
            "year": 1994
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Contriutions to the analysis of visual perception | rst paper: some observations on the combination of visual impressions into units (a. hogg, trans.) The perception of illusory contours"
            },
            "venue": {
                "fragments": [],
                "text": "Contriutions to the analysis of visual perception | rst paper: some observations on the combination of visual impressions into units (a. hogg, trans.) The perception of illusory contours"
            },
            "year": 1900
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Contriutions to the analysis of visual perception — first paper: some observations on the combination of visual impressions into units (a. hogg, trans.) The perception of illusory contours"
            },
            "venue": {
                "fragments": [],
                "text": "Contriutions to the analysis of visual perception — first paper: some observations on the combination of visual impressions into units (a. hogg, trans.) The perception of illusory contours"
            },
            "year": 1900
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 95,
                                "start": 91
                            }
                        ],
                        "text": "This is important for a number of reasons (1) surfaces are the natural units of perception [19]; (2) one can compute texture/color descriptors for each region, which is necessary for applications such as content-based image querying."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Experiencing and perceiving visual"
            },
            "venue": {
                "fragments": [],
                "text": "surfaces. Science,"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Computing contour closures"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. Euro. Conf. Computer Vision, volume I"
            },
            "year": 1996
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 2,
            "methodology": 2
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 34,
        "totalPages": 4
    },
    "page_url": "https://www.semanticscholar.org/paper/Contour-Continuity-in-Region-Based-Image-Leung-Malik/a1ca62714f8086af1d7be12aa0cb6d9c25bf4bcd?sort=total-citations"
}