{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723883"
                        ],
                        "name": "F. Perronnin",
                        "slug": "F.-Perronnin",
                        "structuredName": {
                            "firstName": "Florent",
                            "lastName": "Perronnin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Perronnin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3344005"
                        ],
                        "name": "C. Dance",
                        "slug": "C.-Dance",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Dance",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Dance"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 62,
                                "start": 59
                            }
                        ],
                        "text": "As for Fλ, we extend the diagonal approximation derived in [7] for GMMs."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 12795415,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "23694b6d61668e62bb11f17c1d75dde3b4951948",
            "isKey": false,
            "numCitedBy": 1613,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "Within the field of pattern classification, the Fisher kernel is a powerful framework which combines the strengths of generative and discriminative approaches. The idea is to characterize a signal with a gradient vector derived from a generative probability model and to subsequently feed this representation to a discriminative classifier. We propose to apply this framework to image categorization where the input signals are images and where the underlying generative model is a visual vocabulary: a Gaussian mixture model which approximates the distribution of low-level features in images. We show that Fisher kernels can actually be understood as an extension of the popular bag-of-visterms. Our approach demonstrates excellent performance on two challenging databases: an in-house database of 19 object/scene categories and the recently released VOC 2006 database. It is also very practical: it has low computational needs both at training and test time and vocabularies trained on one set of categories can be applied to another set without any significant loss in performance."
            },
            "slug": "Fisher-Kernels-on-Visual-Vocabularies-for-Image-Perronnin-Dance",
            "title": {
                "fragments": [],
                "text": "Fisher Kernels on Visual Vocabularies for Image Categorization"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This work shows that Fisher kernels can actually be understood as an extension of the popular bag-of-visterms, and proposes to apply this framework to image categorization where the input signals are images and where the underlying generative model is a visual vocabulary: a Gaussian mixture model which approximates the distribution of low-level features in images."
            },
            "venue": {
                "fragments": [],
                "text": "2007 IEEE Conference on Computer Vision and Pattern Recognition"
            },
            "year": 2007
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2117020307"
                        ],
                        "name": "José A. Rodríguez",
                        "slug": "José-A.-Rodríguez",
                        "structuredName": {
                            "firstName": "José",
                            "lastName": "Rodríguez",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "José A. Rodríguez"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723883"
                        ],
                        "name": "F. Perronnin",
                        "slug": "F.-Perronnin",
                        "structuredName": {
                            "firstName": "Florent",
                            "lastName": "Perronnin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Perronnin"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 120,
                                "start": 116
                            }
                        ],
                        "text": "We report results using the local gradient histogram (LGH) features as they have shown state-of-the-art performance [10]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 16977951,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e3c2ea5c04ded4644e7ac3c8c5405c229494816f",
            "isKey": false,
            "numCitedBy": 140,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "In this article we propose a local descriptor for an unconstrained handwritten word spotting task. The presented features are inspired by the SIFT keypoint descriptor, widely employed in computer vision and object recognition, but underexploited in the handwriting recognition field. In our approach, a sliding window moves from left to right over a word image. At each position, the window is subdivided into cells, and in each cell a histogram of orientations is accumulated. Experiments using two different word spotting systems hidden Markov models and dynamic time warping demonstrate a very significant improvement when using the proposed features with respect to the state-of-the-art ones."
            },
            "slug": "Local-gradient-histogram-features-for-word-spotting-Rodríguez-Perronnin",
            "title": {
                "fragments": [],
                "text": "Local gradient histogram features for word spotting in unconstrained handwritten documents"
            },
            "tldr": {
                "abstractSimilarityScore": 78,
                "text": "A local descriptor for an unconstrained handwritten word spotting task inspired by the SIFT keypoint descriptor, widely employed in computer vision and object recognition, but underexploited in the handwriting recognition field is proposed."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2008
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1712063"
                        ],
                        "name": "C. Bahlmann",
                        "slug": "C.-Bahlmann",
                        "structuredName": {
                            "firstName": "Claus",
                            "lastName": "Bahlmann",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Bahlmann"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2800929"
                        ],
                        "name": "B. Haasdonk",
                        "slug": "B.-Haasdonk",
                        "structuredName": {
                            "firstName": "Bernard",
                            "lastName": "Haasdonk",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Haasdonk"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "36736177"
                        ],
                        "name": "H. Burkhardt",
                        "slug": "H.-Burkhardt",
                        "structuredName": {
                            "firstName": "Hans",
                            "lastName": "Burkhardt",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Burkhardt"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 124,
                                "start": 121
                            }
                        ],
                        "text": "We note that K is not guaranteed to be a true Mercer kernel (as is the case for instance of the DTW kernel introduced in [1]) but that this is not a practical limitation of our system as the SLR training is still a convex optimization problem."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 3,
                                "start": 0
                            }
                        ],
                        "text": "[1] who introduced a DTW kernel for the problem of online character recognition."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 47,
                                "start": 44
                            }
                        ],
                        "text": "Indeed, the classification of a sequence in [1] requires to compute many DTWs – one per support vector – whereas in the FK framework the classification involves vector-to-vector distances which are much faster to compute than DTWs."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 6477991,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3f1cb9b92d9a4d3761027c650bc41409592afa78",
            "isKey": true,
            "numCitedBy": 383,
            "numCiting": 27,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper we describe a novel classification approach for online handwriting recognition. The technique combines dynamic time warping (DTW) and support vector machines (SVMs) by establishing a new SVM kernel. We call this kernel Gaussian DTW (GDTW) kernel. This kernel approach has a main advantage over common HMM techniques. It does not assume a model for the generative class conditional densities. Instead, it directly addresses the problem of discrimination by creating class boundaries and thus is less sensitive to modeling assumptions. By incorporating DTW in the kernel function, general classification problems with variable-sized sequential data can be handled. In this respect the proposed method can be straightforwardly applied to all classification problems, where DTW gives a reasonable distance measure, e.g., speech recognition or genome processing. We show experiments with this kernel approach on the UNIPEN handwriting data, achieving results comparable to an HMM-based technique."
            },
            "slug": "Online-handwriting-recognition-with-support-vector-Bahlmann-Haasdonk",
            "title": {
                "fragments": [],
                "text": "Online handwriting recognition with support vector machines - a kernel approach"
            },
            "tldr": {
                "abstractSimilarityScore": 68,
                "text": "A novel classification approach for online handwriting recognition is described that combines dynamic time warping (DTW) and support vector machines (SVMs) by establishing a new SVM kernel that is directly addresses the problem of discrimination by creating class boundaries and thus is less sensitive to modeling assumptions."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings Eighth International Workshop on Frontiers in Handwriting Recognition"
            },
            "year": 2002
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1758550"
                        ],
                        "name": "R. Manmatha",
                        "slug": "R.-Manmatha",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Manmatha",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Manmatha"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1886047"
                        ],
                        "name": "Chengfeng Han",
                        "slug": "Chengfeng-Han",
                        "structuredName": {
                            "firstName": "Chengfeng",
                            "lastName": "Han",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Chengfeng Han"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31338632"
                        ],
                        "name": "E. Riseman",
                        "slug": "E.-Riseman",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Riseman",
                            "middleNames": [
                                "M."
                            ],
                            "suffix": ""
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Riseman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 130,
                                "start": 127
                            }
                        ],
                        "text": "Handwritten word-spotting (HWS) is the task which consists in detecting keywords in collections of handwritten document images [6]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 72,
                                "start": 66
                            }
                        ],
                        "text": "While early approaches to QBE HWS were based on holistic features [6, 4], the state-of-the-art is to characterize a word-image with a sequence of feature vectors extracted using a sliding window approach."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 6141115,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2c15155645fb0eebbd5400cbd2cd772ab22af0cc",
            "isKey": false,
            "numCitedBy": 275,
            "numCiting": 44,
            "paperAbstract": {
                "fragments": [],
                "text": "There are many historical manuscripts written in a single hand which it would be useful to index. Examples include the W.B. DuBois collection at the University of Massachusetts and the early Presidential libraries at the Library of Congress. Since Optical Character Recognition (OCR) does not work well on handwriting, an alternative scheme based on matching the images of the words is proposed for indexing such texts. The current paper deals with the matching aspects of this process. Two different techniques for matching words are discussed. The first method matches words assuming that the transformation between the words may be modelled by a translation (shift). The second method matches words assuming that the transformation between the words may be modelled by an affine transform. Experiments are shown demonstrating the feasibility of the approach for indexing handwriting. The method should also be applicable to retrieving previously stored material from personal digital assistants (PDAs)."
            },
            "slug": "Word-spotting:-a-new-approach-to-indexing-Manmatha-Han",
            "title": {
                "fragments": [],
                "text": "Word spotting: a new approach to indexing handwriting"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "Experiments are shown demonstrating the feasibility of the approach for indexing handwriting and the method should also be applicable to retrieving previously stored material from personal digital assistants (PDAs)."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings CVPR IEEE Computer Society Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2425332"
                        ],
                        "name": "P. Sanguansat",
                        "slug": "P.-Sanguansat",
                        "structuredName": {
                            "firstName": "Parinya",
                            "lastName": "Sanguansat",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Sanguansat"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2874330"
                        ],
                        "name": "W. Asdornwised",
                        "slug": "W.-Asdornwised",
                        "structuredName": {
                            "firstName": "Widhyakorn",
                            "lastName": "Asdornwised",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Asdornwised"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1730497"
                        ],
                        "name": "S. Jitapunkul",
                        "slug": "S.-Jitapunkul",
                        "structuredName": {
                            "firstName": "Somchai",
                            "lastName": "Jitapunkul",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Jitapunkul"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 4,
                                "start": 0
                            }
                        ],
                        "text": "[12] and Do and Artiéres [2] to the problem of online character recognition."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 15019305,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d66748d0de9d7d973a66ba300c701dbe96cc534b",
            "isKey": false,
            "numCitedBy": 23,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "We propose a method for online Thai handwritten character recognition using HMMs and SVMs with score-space kernels. Score-space kernels are generalized Fisher kernels based on underlying generative models, such as Gaussian mixture models (GMMs), which are output distributions of each state in HMMs. Our system combines the advantages of both generative and discriminative classifiers. In the first phase, HMMs are used for multi-classification, then SVMs are applied to resolve any uncertainty remaining after the first-pass HMM-based recognizer, but they are not applied for all classes because the results of some classes are worse. We consider the HMM confusion matrix to find the confused candidates in each class. If there is one candidate, it means there is no confusion in this class, and HMMs alone are sufficient to classify. SVMs are applied if there is more than one candidate. If there are more than two, the multi-class method is applied. On account of the basic score-spaces, likelihood and likelihood ratio score-spaces are not symmetrical. In the case of likelihood score-space, the parameters refer to only one generative model from two class models. In the case of likelihood ratio score-space, the parameters refer to both of them, but in different positions; thus one observation sequence can map to two score-vectors. We propose a new symmetric score-space, called symmetric likelihood ratio score-space. In this way, one observation sequence is mapped to only one score-vector. Experimental results show the average recognition rate improved from 89.9%, using baseline HMM, to 92.5%, using our proposed method."
            },
            "slug": "Online-Thai-handwritten-character-recognition-using-Sanguansat-Asdornwised",
            "title": {
                "fragments": [],
                "text": "Online Thai handwritten character recognition using hidden Markov models and support vector machines"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "A new symmetricscore-space is proposed, called symmetric likelihood ratio score-space, which aims to improve the average recognition rate of online Thai handwritten character recognition and combines the advantages of both generative and discriminative classifiers."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE International Symposium on Communications and Information Technology, 2004. ISCIT 2004."
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2352980"
                        ],
                        "name": "T. Rath",
                        "slug": "T.-Rath",
                        "structuredName": {
                            "firstName": "Toni",
                            "lastName": "Rath",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Rath"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1758550"
                        ],
                        "name": "R. Manmatha",
                        "slug": "R.-Manmatha",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Manmatha",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Manmatha"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 126,
                                "start": 123
                            }
                        ],
                        "text": "In their influential work, Rath and Manmatha proposed to use the dynamic time warping (DTW) algorithm to match word images [9]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 15554170,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e20e64661424bee772c7f002d45c1ac79578fb03",
            "isKey": false,
            "numCitedBy": 658,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "Libraries and other institutions are interested in providing access to scanned versions of their large collections of handwritten historical manuscripts on electronic media. Convenient access to a collection requires an index, which is manually created at great labor and expense. Since current handwriting recognizers do not perform well on historical documents, a technique called word spotting has been developed: clusters with occurrences of the same word in a collection are established using image matching. By annotating \"interesting\" clusters, an index can be built automatically. We present an algorithm for matching handwritten words in noisy historical documents. The segmented word images are preprocessed to create sets of 1-dimensional features, which are then compared using dynamic time warping. We present experimental results on two different data sets from the George Washington collection. Our experiments show that this algorithm performs better and is faster than competing matching techniques."
            },
            "slug": "Word-image-matching-using-dynamic-time-warping-Rath-Manmatha",
            "title": {
                "fragments": [],
                "text": "Word image matching using dynamic time warping"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This work presents an algorithm for matching handwritten words in noisy historical documents that performs better and is faster than competing matching techniques and presents experimental results on two different data sets from the George Washington collection."
            },
            "venue": {
                "fragments": [],
                "text": "2003 IEEE Computer Society Conference on Computer Vision and Pattern Recognition, 2003. Proceedings."
            },
            "year": 2003
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35132120"
                        ],
                        "name": "T. Jaakkola",
                        "slug": "T.-Jaakkola",
                        "structuredName": {
                            "firstName": "T.",
                            "lastName": "Jaakkola",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Jaakkola"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1733689"
                        ],
                        "name": "D. Haussler",
                        "slug": "D.-Haussler",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Haussler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Haussler"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 50,
                                "start": 47
                            }
                        ],
                        "text": "The FK was introduced by Jaakkola and Haussler [3] to combine the benefits of the generative and discriminative worlds."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 86,
                                "start": 83
                            }
                        ],
                        "text": "Jaakkola and Haussler propose to characterize X with the following gradient vector [3]:"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 91,
                                "start": 70
                            }
                        ],
                        "text": "T} be a set of samples which is supposed to have been generated by p. Jaakkola and Haussler propose to characterize X with the following gradient vector [3]:\nGλ(X) = ∇λL(X |λ) ."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 6,
                                "start": 3
                            }
                        ],
                        "text": "In [3], the Fisher information matrix Fλ is suggested for this purpose:"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 14336127,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e45c2420e6dc59ba6d357fb0c996ebf43c861560",
            "isKey": true,
            "numCitedBy": 1619,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "Generative probability models such as hidden Markov models provide a principled way of treating missing information and dealing with variable length sequences. On the other hand, discriminative methods such as support vector machines enable us to construct flexible decision boundaries and often result in classification performance superior to that of the model based approaches. An ideal classifier should combine these two complementary approaches. In this paper, we develop a natural way of achieving this combination by deriving kernel functions for use in discriminative methods such as support vector machines from generative probability models. We provide a theoretical justification for this combination as well as demonstrate a substantial improvement in the classification performance in the context of DNA and protein sequence analysis."
            },
            "slug": "Exploiting-Generative-Models-in-Discriminative-Jaakkola-Haussler",
            "title": {
                "fragments": [],
                "text": "Exploiting Generative Models in Discriminative Classifiers"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "A natural way of achieving this combination by deriving kernel functions for use in discriminative methods such as support vector machines from generative probability models is developed."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "108436631"
                        ],
                        "name": "P. Keaton",
                        "slug": "P.-Keaton",
                        "structuredName": {
                            "firstName": "Patrick",
                            "lastName": "Keaton",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Keaton"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143942875"
                        ],
                        "name": "H. Greenspan",
                        "slug": "H.-Greenspan",
                        "structuredName": {
                            "firstName": "Hayit",
                            "lastName": "Greenspan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Greenspan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145135018"
                        ],
                        "name": "R. Goodman",
                        "slug": "R.-Goodman",
                        "structuredName": {
                            "firstName": "Rodney",
                            "lastName": "Goodman",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Goodman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 72,
                                "start": 66
                            }
                        ],
                        "text": "While early approaches to QBE HWS were based on holistic features [6, 4], the state-of-the-art is to characterize a word-image with a sequence of feature vectors extracted using a sliding window approach."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 61734396,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "43a550793cbde16bf671078b15693daf92448c61",
            "isKey": false,
            "numCitedBy": 41,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "We present one of the first attempts towards automatic retrieval of documents, in the noisy environment of unconstrained, multiple author handwritten forms. The documents were written in cursive script for which conventional OCR and text retrieval engines are not adequate. We focus on a visual word spotting indexing scheme for scanned documents housed in the Archives of the Indies in Seville, Spain. The framework presented utilizes pattern recognition, learning and information fusion methods, and is motivated from human word-spotting studies. The proposed system is described and initial results are presented."
            },
            "slug": "Keyword-spotting-for-cursive-document-retrieval-Keaton-Greenspan",
            "title": {
                "fragments": [],
                "text": "Keyword spotting for cursive document retrieval"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This work focuses on a visual word spotting indexing scheme for scanned documents housed in the Archives of the Indies in Seville, Spain, and utilizes pattern recognition, learning and information fusion methods, and is motivated from human word-spotting studies."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings Workshop on Document Image Analysis (DIA'97)"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2875887"
                        ],
                        "name": "Jianguo Zhang",
                        "slug": "Jianguo-Zhang",
                        "structuredName": {
                            "firstName": "Jianguo",
                            "lastName": "Zhang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jianguo Zhang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3502855"
                        ],
                        "name": "Marcin Marszalek",
                        "slug": "Marcin-Marszalek",
                        "structuredName": {
                            "firstName": "Marcin",
                            "lastName": "Marszalek",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Marcin Marszalek"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1749609"
                        ],
                        "name": "S. Lazebnik",
                        "slug": "S.-Lazebnik",
                        "structuredName": {
                            "firstName": "Svetlana",
                            "lastName": "Lazebnik",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Lazebnik"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2462253"
                        ],
                        "name": "C. Schmid",
                        "slug": "C.-Schmid",
                        "structuredName": {
                            "firstName": "Cordelia",
                            "lastName": "Schmid",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Schmid"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 208,
                                "start": 204
                            }
                        ],
                        "text": "To avoid the need of tuning β, we follow the common practice of setting its value to the inverse of the mean value of the distance D() as estimated on a subset of the whole training set (see for instance [13])."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 8897751,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "35e855b0c1af4cc7bf62a8eb459c949776fbe7ee",
            "isKey": false,
            "numCitedBy": 190,
            "numCiting": 56,
            "paperAbstract": {
                "fragments": [],
                "text": "Recently, methods based on local image features have shown promise for texture and object recognition tasks. This paper presents a large-scale evaluation of an approach that represents images as distributions (signatures or histograms) of features extracted from a sparse set of keypoint locations and learns a Support Vector Machine classifier with kernels based on two effective measures for comparing distributions, the Earth Mover's Distance and the chi-square distance. We first evaluate the performance of our approach with different keypoint detectors and descriptors, as well as different kernels and classifiers. We then conduct a comparative evaluation with several state-of-the-art recognition methods on four texture and five object databases. On most of these databases, our implementation exceeds the best reported results and achieves comparable performance on the rest. Finally, we investigate the influence of background correlations on recognition performance via extensive tests on the PASCAL database, for which ground-truth object localization information is available. Our experiments demonstrate that image representations based on distributions of local features are surprisingly effective for classification of texture and object images under challenging real-world conditions, including significant intra-class variations and substantial background clutter."
            },
            "slug": "Local-Features-and-Kernels-for-Classification-of-An-Zhang-Marszalek",
            "title": {
                "fragments": [],
                "text": "Local Features and Kernels for Classification of Texture and Object Categories: An In-Depth Study"
            },
            "tldr": {
                "abstractSimilarityScore": 60,
                "text": "This paper presents a large-scale evaluation of an approach that represents images as distributions of features extracted from a sparse set of keypoint locations and learns a Support Vector Machine classifier with kernels based on two effective measures for comparing distributions, the Earth Mover's Distance and the chi-square distance."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2005
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1765150"
                        ],
                        "name": "B. Krishnapuram",
                        "slug": "B.-Krishnapuram",
                        "structuredName": {
                            "firstName": "Balaji",
                            "lastName": "Krishnapuram",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Krishnapuram"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145006560"
                        ],
                        "name": "L. Carin",
                        "slug": "L.-Carin",
                        "structuredName": {
                            "firstName": "Lawrence",
                            "lastName": "Carin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Carin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34659351"
                        ],
                        "name": "Mário A. T. Figueiredo",
                        "slug": "Mário-A.-T.-Figueiredo",
                        "structuredName": {
                            "firstName": "Mário",
                            "lastName": "Figueiredo",
                            "middleNames": [
                                "A.",
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Mário A. T. Figueiredo"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2659620"
                        ],
                        "name": "A. Hartemink",
                        "slug": "A.-Hartemink",
                        "structuredName": {
                            "firstName": "Alexander",
                            "lastName": "Hartemink",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Hartemink"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 44,
                                "start": 41
                            }
                        ],
                        "text": "We used Sparse Logistic Regression (SLR) [5], i."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 65,
                                "start": 62
                            }
                        ],
                        "text": "In practice, the SLR and SVM exhibit very similar performance [5]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 98,
                                "start": 95
                            }
                        ],
                        "text": "In our case, we will make use of a kernel classifier based on sparse logistic regression (SLR) [5]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 5927350,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a966783349c09ff532cd31b14a3a155c85f6c284",
            "isKey": true,
            "numCitedBy": 907,
            "numCiting": 55,
            "paperAbstract": {
                "fragments": [],
                "text": "Recently developed methods for learning sparse classifiers are among the state-of-the-art in supervised learning. These methods learn classifiers that incorporate weighted sums of basis functions with sparsity-promoting priors encouraging the weight estimates to be either significantly large or exactly zero. From a learning-theoretic perspective, these methods control the capacity of the learned classifier by minimizing the number of basis functions used, resulting in better generalization. This paper presents three contributions related to learning sparse classifiers. First, we introduce a true multiclass formulation based on multinomial logistic regression. Second, by combining a bound optimization approach with a component-wise update procedure, we derive fast exact algorithms for learning sparse multiclass classifiers that scale favorably in both the number of training samples and the feature dimensionality, making them applicable even to large data sets in high-dimensional feature spaces. To the best of our knowledge, these are the first algorithms to perform exact multinomial logistic regression with a sparsity-promoting prior. Third, we show how nontrivial generalization bounds can be derived for our classifier in the binary case. Experimental results on standard benchmark data sets attest to the accuracy, sparsity, and efficiency of the proposed methods."
            },
            "slug": "Sparse-multinomial-logistic-regression:-fast-and-Krishnapuram-Carin",
            "title": {
                "fragments": [],
                "text": "Sparse multinomial logistic regression: fast algorithms and generalization bounds"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "This paper introduces a true multiclass formulation based on multinomial logistic regression and derives fast exact algorithms for learning sparse multiclass classifiers that scale favorably in both the number of training samples and the feature dimensionality, making them applicable even to large data sets in high-dimensional feature spaces."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 2005
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1712517"
                        ],
                        "name": "L. Rabiner",
                        "slug": "L.-Rabiner",
                        "structuredName": {
                            "firstName": "Lawrence",
                            "lastName": "Rabiner",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Rabiner"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 154,
                                "start": 151
                            }
                        ],
                        "text": "This posterior probability can be computed exactly using the forward-backward algorithm or approximately using the Viterbi algorithm (see for instance [8] for"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 3,
                                "start": 0
                            }
                        ],
                        "text": "[8]), train an HMM modeling the keyword using only the positive images."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 13618539,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "8fe2ea0a67954f1380b3387e3262f1cdb9f9b3e5",
            "isKey": false,
            "numCitedBy": 24802,
            "numCiting": 98,
            "paperAbstract": {
                "fragments": [],
                "text": "The fabric comprises a novel type of netting which will have particular utility in screening out mosquitoes and like insects and pests. The fabric is defined of voids having depth as well as width and length. The fabric is usable as a material from which to form clothing for wear, or bed coverings, or sleeping bags, etc., besides use simply as a netting."
            },
            "slug": "A-Tutorial-on-Hidden-Markov-Models-and-Selected-Rabiner",
            "title": {
                "fragments": [],
                "text": "A Tutorial on Hidden Markov Models and Selected Applications"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "The fabric comprises a novel type of netting which will have particular utility in screening out mosquitoes and like insects and pests."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1730609"
                        ],
                        "name": "O. Chapelle",
                        "slug": "O.-Chapelle",
                        "structuredName": {
                            "firstName": "Olivier",
                            "lastName": "Chapelle",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Chapelle"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50560492"
                        ],
                        "name": "V. Vapnik",
                        "slug": "V.-Vapnik",
                        "structuredName": {
                            "firstName": "Vladimir",
                            "lastName": "Vapnik",
                            "middleNames": [
                                "Naumovich"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Vapnik"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 793899,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "cbc78c2669eb595c988ab69a6dd4cbabc2421043",
            "isKey": false,
            "numCitedBy": 398,
            "numCiting": 47,
            "paperAbstract": {
                "fragments": [],
                "text": "New functionals for parameter (model) selection of Support Vector Machines are introduced based on the concepts of the span of support vectors and rescaling of the feature space. It is shown that using these functionals, one can both predict the best choice of parameters of the model and the relative quality of performance for any value of parameter."
            },
            "slug": "Model-Selection-for-Support-Vector-Machines-Chapelle-Vapnik",
            "title": {
                "fragments": [],
                "text": "Model Selection for Support Vector Machines"
            },
            "tldr": {
                "abstractSimilarityScore": 99,
                "text": "New functionals for parameter (model) selection of Support Vector Machines are introduced based on the concepts of the span of support vectors and rescaling of the feature space and it is shown that using these functionals one can both predict the best choice of parameters of the model and the relative quality of performance for any value of parameter."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 1999
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 39,
                                "start": 35
                            }
                        ],
                        "text": "We use as a baseline the system of [11] which models keywords with a HMM and normalizes the scores using a GMM."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 112,
                                "start": 108
                            }
                        ],
                        "text": "We compare its performance, both in terms of classification accuracy and speed, with the baseline system of [11]."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 142,
                                "start": 138
                            }
                        ],
                        "text": "We then report results for the proposed approach using the linear and non-linear kernel, and compare their performance with the system of [11]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 147,
                                "start": 143
                            }
                        ],
                        "text": "More recently, Rodrı́guez and Perronnin proposed to train a whole-word HMM using the query images and to score the candidate images on the HMM [11]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 142,
                                "start": 138
                            }
                        ],
                        "text": "To compute the gradient vectors, we estimated the posterior probabilities γt(i, j) using the Viterbi algorithm for a fair comparison with [11] ."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 56,
                                "start": 52
                            }
                        ],
                        "text": "Average precision (in %) for the baseline system of [11] and for the proposed system based on FK using a linear kernel (FK-L) and a non-linear kernel (FK-NL)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Score normalization for HMM-based handwritten word spotting using a universal background model"
            },
            "venue": {
                "fragments": [],
                "text": "In ICFHR,"
            },
            "year": 2008
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 28,
                                "start": 25
                            }
                        ],
                        "text": "[12] and Do and Artiéres [2] to the problem of online character recognition."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 85,
                                "start": 77
                            }
                        ],
                        "text": "As for the FK framework, it was applied by Sangnansat et al. [12] and Do and Artiéres [2] to the problem of online character recognition."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Artires. Model selection with support vector machines"
            },
            "venue": {
                "fragments": [],
                "text": "In ICFHR,"
            },
            "year": 2008
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 38,
                                "start": 34
                            }
                        ],
                        "text": "In the next section, we describe in detail the proposed solution."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 83,
                                "start": 79
                            }
                        ],
                        "text": "In their influential work, Rath and Manmatha proposed to use the dynamic time warping (DTW) algorithm to match word images [9]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Score normalization for HMM-based handwritten word spotting using a universal background model"
            },
            "venue": {
                "fragments": [],
                "text": "ICFHR"
            },
            "year": 2008
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 7,
            "methodology": 8,
            "result": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 15,
        "totalPages": 2
    },
    "page_url": "https://www.semanticscholar.org/paper/Fisher-Kernels-for-Handwritten-Word-spotting-Perronnin-Rodríguez-Serrano/bfbdaa38a3cc7c46558f1497925f977e41d12d44?sort=total-citations"
}