{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3453447"
                        ],
                        "name": "J. Mundy",
                        "slug": "J.-Mundy",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Mundy",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mundy"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1688869"
                        ],
                        "name": "Andrew Zisserman",
                        "slug": "Andrew-Zisserman",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Zisserman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Andrew Zisserman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 117429742,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "5ad56913c7b703eefde3ec61dd2ede2b7131ec23",
            "isKey": false,
            "numCitedBy": 696,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Part 1 Foundations: algebraic invariants - invariant theory and enumerative combinatorics of young tableaux, Shreeram S. Abhyankar, geometric interpretation of joint conic invariants, Joseph L. Mundy, et al, an experimental evaluation of projective invariants, Christopher Coelho, et al the projection of two non-coplanar conics, Stephen J. Maybank the non-existence of general-case view-invariants, J. Brian Burns, et al invariants of non-algebraic curves - noise resistant invariants of curves, Isaac Weiss, semi-differential invariants, Luc J. Van Gool, et al, projective invariants for curves in two and three dimensions, Michael H. Brill, et al, numerical evaluation of differential and semi-differential invariants, Christopher Brown, recognizing general curved objects efficiently, Andrew Zisserman, et al fitting affine invariant conics to curves, Deepak Kapur and Joseph L. Mundy, projectively invariant decomposition of planar shapes, Stefan Carlsson invariants from multiple views - invariant linear methods in photogrammetry and model-matching, Eamon B. Barrett, et al semi-differential invariants for nonplanar curves, Luc J. Van Gool, et al disambiguating stereo matches with spatio-temporal surfaces, Olivier Faugeras and Theo Papadopoulo. Part 2 Applications: transformation invariant indexing, Haim J. Wolfson and Yehezkel Lamdan affine invariants for model-based recognition, John E. Hopcroft, et al object recognition based on moment (or algebraic) invariants, Gabriel Taubin and David B. Cooper fast recognition using algebraic invariants, Charles A. Rothwell, et al toward 3D curved object recognition from image contours, Jean Ponce and David J. Kriegman relative positioning with uncalibrated cameras, Roger Mohr, et al. Appendix: projective geometry for machine vision, Joseph L. Mundy and Andrew Zisserman."
            },
            "slug": "Geometric-invariance-in-computer-vision-Mundy-Zisserman",
            "title": {
                "fragments": [],
                "text": "Geometric invariance in computer vision"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1756534"
                        ],
                        "name": "H. Wolfson",
                        "slug": "H.-Wolfson",
                        "structuredName": {
                            "firstName": "Haim",
                            "lastName": "Wolfson",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Wolfson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 76,
                                "start": 64
                            }
                        ],
                        "text": "This invariance is exploited by many object recognition systems [13, 20, 25] for indexing into an object database."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 123,
                                "start": 108
                            }
                        ],
                        "text": "The resulting shape variables are equivalent to the a ne invariants that have been used in previous studies [9, 17, 20, 25]."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 199,
                                "start": 191
                            }
                        ],
                        "text": "Two approaches have been developed to address this problem: (1) image-based methods [5, 18, 22]; and (2) geometrybased methods such as the generalized Hough transform [13], geometric hashing [20, 25], alignment [14], and geometric invariants [17]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 27534351,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "54780ad3a1d5924df6ce0afbf2d2193415ca9fdd",
            "isKey": false,
            "numCitedBy": 156,
            "numCiting": 30,
            "paperAbstract": {
                "fragments": [],
                "text": "The Geometric Hashing paradigm for model-based recognition of objects in cluttered scenes is discussed. This paradigm enables a unified approach to rigid object recognition under different viewing transformation assumptions both for 2-D and 3-D objects obtained by different sensors, e.g. vision, range, tactile. It is based on an intensive off-line model preprocessing (learning) stage, where model information is indexed into a hash-table using minimal, transformation invariant features. This enables the on-line recognition algorithm to be particularly efficient. The algorithm is straightforwardly parallelizable. Initial experimentation of the technique has led to successful recognition of both 2-D and 3-D objects in cluttered scenes from an arbitrary viewpoint. We, also, compare the Geometric Hashing with the Hough Transform and the alignment techniques. Extensions of the basic paradigm which reduce its worst case recognition complexity are discussed."
            },
            "slug": "Model-Based-Object-Recognition-by-Geometric-Hashing-Wolfson",
            "title": {
                "fragments": [],
                "text": "Model-Based Object Recognition by Geometric Hashing"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "Extensions of the basic paradigm which reduce its worst case recognition complexity are discussed, and the Geometric Hashing with the Hough Transform and the alignment techniques are compared."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2511655"
                        ],
                        "name": "M. Burl",
                        "slug": "M.-Burl",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Burl",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Burl"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1690922"
                        ],
                        "name": "P. Perona",
                        "slug": "P.-Perona",
                        "structuredName": {
                            "firstName": "Pietro",
                            "lastName": "Perona",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Perona"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 112,
                                "start": 102
                            }
                        ],
                        "text": "The a ne shape density for a subset of features can then be used to rank the incomplete constellation [6, 7, 16]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 129,
                                "start": 122
                            }
                        ],
                        "text": "Our result simultaneously addresses both the di culties mentioned above while extending the probabilistic shape framework [7, 10] from simple translation, scaling and image-plane rotation invariance to full a ne invariance."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 59,
                                "start": 38
                            }
                        ],
                        "text": "An emerging framework for recognition [4, 7, 8, 16, 19, 24] combines the image-based and geometrybased methods."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 82,
                                "start": 76
                            }
                        ],
                        "text": "A particularly promising approach is provided by probabilistic shape models [6, 7]."
                    },
                    "intents": []
                }
            ],
            "corpusId": 9204636,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "044779db85dc83e2633951791b29bc311cfbae53",
            "isKey": false,
            "numCitedBy": 133,
            "numCiting": 44,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a new framework for recognizing planar object classes, which is based on local feature detectors and a probabilistic model of the spatial arrangement of the features. The allowed object deformations are represented through shape statistics, which are learned from examples. Instances of an object in an image are detected by finding the appropriate features in the correct spatial configuration. The algorithm is robust with respect to partial occlusion, detector false alarms, and missed features. A 94% success rate was achieved for the problem of locating quasi-frontal views of faces in cluttered scenes."
            },
            "slug": "Recognition-of-planar-object-classes-Burl-Perona",
            "title": {
                "fragments": [],
                "text": "Recognition of planar object classes"
            },
            "tldr": {
                "abstractSimilarityScore": 94,
                "text": "A new framework for recognizing planar object classes is presented, which is based on local feature detectors and a probabilistic model of the spatial arrangement of the features, and the allowed object deformations are represented through shape statistics, which are learned from examples."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings CVPR IEEE Computer Society Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7205190"
                        ],
                        "name": "Tim Cootes",
                        "slug": "Tim-Cootes",
                        "structuredName": {
                            "firstName": "Tim",
                            "lastName": "Cootes",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tim Cootes"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144482985"
                        ],
                        "name": "C. Taylor",
                        "slug": "C.-Taylor",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Taylor",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Taylor"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 175,
                                "start": 172
                            }
                        ],
                        "text": "Various representations have been used to model spatial con gurations including mutual distances [16], springs [26], energy functions over mesh grids [24], and eigenshapes [8]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 59,
                                "start": 38
                            }
                        ],
                        "text": "An emerging framework for recognition [4, 7, 8, 16, 19, 24] combines the image-based and geometrybased methods."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 39877209,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "de6f7d242b78bf5e87966fb72565ba43d277084e",
            "isKey": false,
            "numCitedBy": 25,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "Most deformable models use a local optimisation scheme to locate their targets in images, and require a 'good enough' starting point. This paper describes an approach for generating such starting points automatically given no prior knowledge of the pose of the target(s) in the image. It relies upon choosing a suitable set of features, candidates for which can be found in the image. Hypotheses are formed from sets of candidates, and their plausibility tested using the statistics of their relative positions and orientations. The most plausible are used as the initial position of an Active Shape Model, which can then accurately locate the target object. The approach is demonstrated for two different image interpretation problems."
            },
            "slug": "Locating-Objects-of-Varying-Shape-Using-Statistical-Cootes-Taylor",
            "title": {
                "fragments": [],
                "text": "Locating Objects of Varying Shape Using Statistical Feature Detectors"
            },
            "tldr": {
                "abstractSimilarityScore": 57,
                "text": "This paper describes an approach for generating starting points automatically given no prior knowledge of the pose of the target(s) in the image, which relies upon choosing a suitable set of features, candidates for which can be found in theimage, which is demonstrated for two different image interpretation problems."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "72126416"
                        ],
                        "name": "Y. C. Hecker",
                        "slug": "Y.-C.-Hecker",
                        "structuredName": {
                            "firstName": "Yaron",
                            "lastName": "Hecker",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. C. Hecker"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "70029967"
                        ],
                        "name": "R. Bolle",
                        "slug": "R.-Bolle",
                        "structuredName": {
                            "firstName": "Ruud",
                            "lastName": "Bolle",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Bolle"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 76,
                                "start": 64
                            }
                        ],
                        "text": "This invariance is exploited by many object recognition systems [13, 20, 25] for indexing into an object database."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 171,
                                "start": 167
                            }
                        ],
                        "text": "Two approaches have been developed to address this problem: (1) image-based methods [5, 18, 22]; and (2) geometrybased methods such as the generalized Hough transform [13], geometric hashing [20, 25], alignment [14], and geometric invariants [17]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 122806262,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "28f9a2d2c49839b21a8216866f019ad7f32ad993",
            "isKey": false,
            "numCitedBy": 55,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "The generalized Hough transform and geometric hashing are two contemporary paradigms for model-based object recognition. Both schemes simultaneously find instances of objects in a scene and determine the location and orientation of these instances. The methods encode the models for the objects in a similar fashion and object recognition is achieved by image features \"voting\" for object models. For both schemes, the object recognition time is largely independent of the number of objects that are encoded in the object-model database. This paper puts the two schemes in perspective and examines differences and similarities. The authors also study object representation techniques and discuss how object representations are used for object recognition and position estimation. >"
            },
            "slug": "On-Geometric-Hashing-and-the-Generalized-Hough-Hecker-Bolle",
            "title": {
                "fragments": [],
                "text": "On Geometric Hashing and the Generalized Hough Transform"
            },
            "tldr": {
                "abstractSimilarityScore": 77,
                "text": "The generalized Hough transform and geometric hashing are two contemporary paradigms for model-based object recognition that are put in perspective and differences and similarities are examined."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Syst. Man Cybern. Syst."
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32803110"
                        ],
                        "name": "M. S. Costa",
                        "slug": "M.-S.-Costa",
                        "structuredName": {
                            "firstName": "Mauro",
                            "lastName": "Costa",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. S. Costa"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1710238"
                        ],
                        "name": "R. Haralick",
                        "slug": "R.-Haralick",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Haralick",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Haralick"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1809809"
                        ],
                        "name": "L. Shapiro",
                        "slug": "L.-Shapiro",
                        "structuredName": {
                            "firstName": "Linda",
                            "lastName": "Shapiro",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Shapiro"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 123,
                                "start": 108
                            }
                        ],
                        "text": "The resulting shape variables are equivalent to the a ne invariants that have been used in previous studies [9, 17, 20, 25]."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                }
            ],
            "corpusId": 13687427,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d91e139cc1cbdb90e60b0944436025f34f0260ad",
            "isKey": false,
            "numCitedBy": 63,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "Application of the affine-invariant point-matching scheme proposed by R. Hummel and H. Wolfson (1988) to the problem of recognizing and determining the pose of sheet metal parts is discussed. Attention is given to errors that can occur with this method due to quantization, stability, symmetry, and noise problems. These errors make the original affine-invariant matching technique unsuitable for use on the factory floor. An explicit noise model, which the Hummel and Wolfson technique lacks, is used. An optimal approach which overcomes these problems is then derived. The performance of the proposed algorithm under the influence of several distorting parameters is evaluated.<<ETX>>"
            },
            "slug": "Optimal-affine-invariant-point-matching-Costa-Haralick",
            "title": {
                "fragments": [],
                "text": "Optimal affine-invariant point matching"
            },
            "tldr": {
                "abstractSimilarityScore": 90,
                "text": "Application of the affine-invariant point-matching scheme proposed by R. Hummel and H. Wolfson (1988) to the problem of recognizing and determining the pose of sheet metal parts is discussed and an optimal approach is derived."
            },
            "venue": {
                "fragments": [],
                "text": "[1990] Proceedings. 10th International Conference on Pattern Recognition"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "150204446"
                        ],
                        "name": "M. C. Burly",
                        "slug": "M.-C.-Burly",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Burly",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. C. Burly"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2087868060"
                        ],
                        "name": "T. K. Leungz",
                        "slug": "T.-K.-Leungz",
                        "structuredName": {
                            "firstName": "T.",
                            "lastName": "Leungz",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. K. Leungz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2099470250"
                        ],
                        "name": "M. Webery",
                        "slug": "M.-Webery",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Webery",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Webery"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 8,
                                "start": 5
                            }
                        ],
                        "text": "Burl [4] showed such a similar extension for the Euclidean shape density."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 59,
                                "start": 38
                            }
                        ],
                        "text": "An emerging framework for recognition [4, 7, 8, 16, 19, 24] combines the image-based and geometrybased methods."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 13948138,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "64979eb2cf87f74ea0376373f1fc1e7f356364c5",
            "isKey": false,
            "numCitedBy": 11,
            "numCiting": 59,
            "paperAbstract": {
                "fragments": [],
                "text": "Object recognition is both about recognizing speciic objects, e.g., \\That is my dog Spot.\" and about recognizing classes of objects, e.g., \\That is a dog.\" Our focus is on the latter problem, even though we do not ooer a precise deenition for what constitutes a class. In some cases, for example with human faces, the objects in a class are visually similar and form a visual object class. In other cases, say chairs, objects in the class may not look at all alike|the only similarities are in function. Recognition of functional object classes requires higher-level cognitive reasoning, we restrict here our attention to visual object classes. The main diiculty in object recognition is the problem of invariance. The pixel representation provided by the camera is dependent upon the lighting conditions, object pose, camera position, etc. Further, there is inherent variability between diierent instances from the same object class. Our approach to this problem is to model an object class as a set of local parts arranged in a deformable spatial connguration. For example, human faces consist of parts such as the eyes, nose, and mouth whose positions in the image plane vary with pose and expression as well as from individual to individual. The allowed object deformations are represented through shape statistics, which are learned from examples. Instances of an object in an image are detected by nding the appropriate features in the correct spatial connguration. The algorithm is robust with respect to partial occlusion, detector false alarms, and missed features. A 94% success rate is demonstrated for the problem of locating quasi-frontal views of faces in cluttered scenes."
            },
            "slug": "Recognition-of-Visual-Object-Classes-Burly-Leungz",
            "title": {
                "fragments": [],
                "text": "Recognition of Visual Object Classes"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The approach to this problem is to model an object class as a set of local parts arranged in a deformable spatial connguration, which consists of parts such as the eyes, nose, and mouth whose positions in the image plane vary with pose and expression as well as from individual to individual."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145081362"
                        ],
                        "name": "A. Yuille",
                        "slug": "A.-Yuille",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Yuille",
                            "middleNames": [
                                "Loddon"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Yuille"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 115,
                                "start": 111
                            }
                        ],
                        "text": "Various representations have been used to model spatial con gurations including mutual distances [16], springs [26], energy functions over mesh grids [24], and eigenshapes [8]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 16413347,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "37d46a2355a95abee6576986a460399adbebf6b9",
            "isKey": false,
            "numCitedBy": 421,
            "numCiting": 32,
            "paperAbstract": {
                "fragments": [],
                "text": "We describe an approach for extracting facial features from images and for determining the spatial organization between these features using the concept of a deformable template. This is a parameterized geometric model of the object to be recognized together with a measure of how well it fits the image data. Variations in the parameters correspond to allowable deformations of the object and can be specified by a probabilistic model. After the extraction stage the parameters of the deformable template can be used for object description and recognition."
            },
            "slug": "Deformable-Templates-for-Face-Recognition-Yuille",
            "title": {
                "fragments": [],
                "text": "Deformable Templates for Face Recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 94,
                "text": "An approach for extracting facial features from images and for determining the spatial organization between these features using the concept of a deformable template using a parameterized geometric model of the object to be recognized together with a measure of how well it fits the image data."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of Cognitive Neuroscience"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39112482"
                        ],
                        "name": "T. D. Alter",
                        "slug": "T.-D.-Alter",
                        "structuredName": {
                            "firstName": "Tao",
                            "lastName": "Alter",
                            "middleNames": [
                                "Daniel"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. D. Alter"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34734622"
                        ],
                        "name": "D. Jacobs",
                        "slug": "D.-Jacobs",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Jacobs",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Jacobs"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 153,
                                "start": 142
                            }
                        ],
                        "text": "However, it has been shown that, in practice, the calculated a ne invariants can be quite sensitive to errors in the image plane measurements [1, 12, 20]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 125,
                                "start": 122
                            }
                        ],
                        "text": "Previous work has been performed to characterize the distribution of the error by bounds [12] or low order approximations [1]."
                    },
                    "intents": []
                }
            ],
            "corpusId": 36526651,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f5899a3a3e3f4a6d303b1be97816339cd4a7d797",
            "isKey": false,
            "numCitedBy": 24,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "Robust recognition systems require a careful understanding of the effects of error in sensed features. Error in these image features results in uncertainty in the possible image location of each additional model feature. We present an accurate, analytic approximation for this uncertainty when model poses are based on matching three image and model points. This result applies to objects that are fully three-dimensional, where past results considered only two-dimensional objects. Further, we introduce a linear programming algorithm to compute this uncertainty when poses are based on any number of initial matches.<<ETX>>"
            },
            "slug": "Error-propagation-in-full-3D-from-2D-object-Alter-Jacobs",
            "title": {
                "fragments": [],
                "text": "Error propagation in full 3D-from-2D object recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "An accurate, analytic approximation for this uncertainty when model poses are based on matching three image and model points is presented, and this result applies to objects that are fully three-dimensional, where past results considered only two-dimensional objects."
            },
            "venue": {
                "fragments": [],
                "text": "1994 Proceedings of IEEE Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145266088"
                        ],
                        "name": "T. Leung",
                        "slug": "T.-Leung",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Leung",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Leung"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2511655"
                        ],
                        "name": "M. Burl",
                        "slug": "M.-Burl",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Burl",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Burl"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1690922"
                        ],
                        "name": "P. Perona",
                        "slug": "P.-Perona",
                        "structuredName": {
                            "firstName": "Pietro",
                            "lastName": "Perona",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Perona"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2904067,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0d50d0e2af0b45cc7ed25fe4aa97af900c9bd32a",
            "isKey": false,
            "numCitedBy": 389,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "An algorithm for locating quasi-frontal views of human faces in cluttered scenes is presented. The algorithm works by coupling a set of local feature detectors with a statistical model of the mutual distances between facial features it is invariant with respect to translation, rotation (in the plane), and scale and can handle partial occlusions of the face. On a challenging database with complicated and varied backgrounds, the algorithm achieved a correct localization rate of 95% in images where the face appeared quasi-frontally.<<ETX>>"
            },
            "slug": "Finding-faces-in-cluttered-scenes-using-random-Leung-Burl",
            "title": {
                "fragments": [],
                "text": "Finding faces in cluttered scenes using random labeled graph matching"
            },
            "tldr": {
                "abstractSimilarityScore": 66,
                "text": "An algorithm for locating quasi-frontal views of human faces in cluttered scenes is presented and it is found that it is invariant with respect to translation, rotation, and scale and can handle partial occlusions of the face."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IEEE International Conference on Computer Vision"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1736245"
                        ],
                        "name": "Laurenz Wiskott",
                        "slug": "Laurenz-Wiskott",
                        "structuredName": {
                            "firstName": "Laurenz",
                            "lastName": "Wiskott",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Laurenz Wiskott"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1704573"
                        ],
                        "name": "C. Malsburg",
                        "slug": "C.-Malsburg",
                        "structuredName": {
                            "firstName": "Christoph",
                            "lastName": "Malsburg",
                            "middleNames": [
                                "von",
                                "der"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Malsburg"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 154,
                                "start": 150
                            }
                        ],
                        "text": "Various representations have been used to model spatial con gurations including mutual distances [16], springs [26], energy functions over mesh grids [24], and eigenshapes [8]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 59,
                                "start": 38
                            }
                        ],
                        "text": "An emerging framework for recognition [4, 7, 8, 16, 19, 24] combines the image-based and geometrybased methods."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 1325911,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2e4ba33f614ae0578b3d6c2015df536a2795048f",
            "isKey": false,
            "numCitedBy": 75,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a system for the interpretation of camera images of scenes composed of several known objects with mutual occlusion. The scenes are analyzed by the recognition of the objects present and by the determination of their occlusion relations. Objects are internally represented by stored model graphs. These are formed in a semi-automatic way by showing objects against a varying background. Objects are recognized by dynamic link matching. Our experiments show that our system is very successful in analyzing cluttered scenes. The system architecture goes beyond classical neural networks by making extensive use of flexible links between units, as proposed in the dynamic link architecture. The present implementation is, however, rather algorithmic in style and is to be regarded as a pilot study that is preparing the way for a detailed implementation of the architecture."
            },
            "slug": "A-Neural-System-for-the-Recognition-of-Partially-in-Wiskott-Malsburg",
            "title": {
                "fragments": [],
                "text": "A Neural System for the Recognition of Partially Occluded Objects in Cluttered Scenes: A Pilot Study"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The system architecture goes beyond classical neural networks by making extensive use of flexible links between units, as proposed in the dynamic link architecture, and is to be regarded as a pilot study that is preparing the way for a detailed implementation of the architecture."
            },
            "venue": {
                "fragments": [],
                "text": "Int. J. Pattern Recognit. Artif. Intell."
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102881550"
                        ],
                        "name": "D. Kendall",
                        "slug": "D.-Kendall",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Kendall",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Kendall"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 50702498,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "9367399b05cc0193396275476e9734c3be3c8313",
            "isKey": false,
            "numCitedBy": 1393,
            "numCiting": 40,
            "paperAbstract": {
                "fragments": [],
                "text": "The shape-space l. k m whose points a represent the shapes of not totally degenerate /c-ads in IR m is introduced as a quotient space carrying the quotient metric. When m = 1, we find that Y\\ = S k ~ 2 ; when m ^ 3, the shape-space contains singularities. This paper deals mainly with the case m = 2, when the shape-space I* ca n be identified with a version of CP*~ 2 . Of special importance are the shape-measures induced on CP k ~ 2 by any assigned diffuse law of distribution for the k vertices. We determine several such shape-measures, we resolve some of the technical problems associated with the graphic presentation and statistical analysis of empirical shape distributions, and among applications we discuss the relevance of these ideas to testing for the presence of non-accidental multiple alignments in collections of (i) neolithic stone monuments and (ii) quasars. Finally the recently introduced Ambartzumian density is examined from the present point of view, its norming constant is found, and its connexion with random Crofton polygons is established."
            },
            "slug": "SHAPE-MANIFOLDS,-PROCRUSTEAN-METRICS,-AND-COMPLEX-Kendall",
            "title": {
                "fragments": [],
                "text": "SHAPE MANIFOLDS, PROCRUSTEAN METRICS, AND COMPLEX PROJECTIVE SPACES"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2511655"
                        ],
                        "name": "M. Burl",
                        "slug": "M.-Burl",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Burl",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Burl"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145266088"
                        ],
                        "name": "T. Leung",
                        "slug": "T.-Leung",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Leung",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Leung"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1690922"
                        ],
                        "name": "P. Perona",
                        "slug": "P.-Perona",
                        "structuredName": {
                            "firstName": "Pietro",
                            "lastName": "Perona",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Perona"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 103,
                                "start": 92
                            }
                        ],
                        "text": "The result is interesting because most other techniques are designed only for frontal faces [6, 21, 23]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 112,
                                "start": 102
                            }
                        ],
                        "text": "The a ne shape density for a subset of features can then be used to rank the incomplete constellation [6, 7, 16]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 6,
                                "start": 3
                            }
                        ],
                        "text": "In [6] local part detectors and probabilistic shape models were combined to provide reliable localization of quasi-frontal faces in cluttered scenes and with partial occlusion."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 98,
                                "start": 91
                            }
                        ],
                        "text": "At present, the detection rate of our algorithm is about 70% on the face databases used in [6, 16]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 82,
                                "start": 76
                            }
                        ],
                        "text": "A particularly promising approach is provided by probabilistic shape models [6, 7]."
                    },
                    "intents": []
                }
            ],
            "corpusId": 115624923,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3aed15f35f59c65dd0857b29edaf141ebf77126b",
            "isKey": false,
            "numCitedBy": 107,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper, a face localization system is proposed in which local detectors are coupled with a statistical model of the spatial arrangement of facial features to yield robust performance. The outputs from the local detectors are treated as candidate locations and constellations are formed from these. The effects of translation, rotation, and scale are eliminated by mapping to a set of shape variables. The constellations are then ranked according to the likelihood that the shape variables correspond to a face versus an alternative model. Incomplete constellations, which occur when some of the true features are missed, are handled in a principled way."
            },
            "slug": "Face-Localization-via-Shape-Statistics-Burl-Leung",
            "title": {
                "fragments": [],
                "text": "Face Localization via Shape Statistics"
            },
            "tldr": {
                "abstractSimilarityScore": 87,
                "text": "A face localization system is proposed in which local detectors are coupled with a statistical model of the spatial arrangement of facial features to yield robust performance and constellations are formed from these."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38817267"
                        ],
                        "name": "K. Sung",
                        "slug": "K.-Sung",
                        "structuredName": {
                            "firstName": "Kah",
                            "lastName": "Sung",
                            "middleNames": [
                                "Kay"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Sung"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 103,
                                "start": 92
                            }
                        ],
                        "text": "The result is interesting because most other techniques are designed only for frontal faces [6, 21, 23]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 167,
                                "start": 163
                            }
                        ],
                        "text": "In the face detection context, occlusions will present a very di cult situation in the intensity matching-based face detectors of Rowley et al [21] and Sung et al [23], while our system can deal with it naturally."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 7164794,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "088eb2d102c6bb486f5270d0b2adff76961994cf",
            "isKey": false,
            "numCitedBy": 2061,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": "We present an example-based learning approach for locating vertical frontal views of human faces in complex scenes. The technique models the distribution of human face patterns by means of a few view-based \"face\" and \"nonface\" model clusters. At each image location, a difference feature vector is computed between the local image pattern and the distribution-based model. A trained classifier determines, based on the difference feature vector measurements, whether or not a human face exists at the current image location. We show empirically that the distance metric we adopt for computing difference feature vectors, and the \"nonface\" clusters we include in our distribution-based model, are both critical for the success of our system."
            },
            "slug": "Example-Based-Learning-for-View-Based-Human-Face-Sung-Poggio",
            "title": {
                "fragments": [],
                "text": "Example-Based Learning for View-Based Human Face Detection"
            },
            "tldr": {
                "abstractSimilarityScore": 60,
                "text": "An example-based learning approach for locating vertical frontal views of human faces in complex scenes and shows empirically that the distance metric adopted for computing difference feature vectors, and the \"nonface\" clusters included in the distribution-based model, are both critical for the success of the system."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2105872"
                        ],
                        "name": "F. Bookstein",
                        "slug": "F.-Bookstein",
                        "structuredName": {
                            "firstName": "Fred",
                            "lastName": "Bookstein",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Bookstein"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 130,
                                "start": 121
                            }
                        ],
                        "text": "The use of shape models to represent variation in biological samples (e.g. sea shells) was pioneered by Kendall [15] and Bookstein [2], but has only recently been applied to computer vision."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 59,
                                "start": 56
                            }
                        ],
                        "text": "sea shells) was pioneered by Kendall [15] and Bookstein [2], but has only recently been applied to computer vision."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 18015580,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "c6bd5ce5755c3ba992880ee2edbc20281ed563b6",
            "isKey": false,
            "numCitedBy": 601,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": "Biometric studies of the forms of organisms usually consider size and shape variations in the geometric configuration of landmarks, points that correspond biologically from form to form. The size variables may be usefully considered the linear vector space spanned by the set of all distances between pairs of landmarks. The shape of a single triangle AABC of landmarks may be reduced to a single pair of shape coordinates locating the vertex C in the coordinate system with landmark A sent to (0,O) and landmark B to (1,O). A useful space of shape variables is the span of all such shape coordinate pairs for various triples of landmarks. On a convenient null model of identical circular normal perturbations at each landmark independently, one size variable S , which may be taken as the mean square of all the interlandmark distances, has covariance zero with every shape variable. Then associations between shape and size may be tested by the F ratio for multiple regression of S on any basis for shape space. For a single triangle of landmarks, the existence of any mean difference or mean change in shape may be tested by Hotelling's T 2 applied to any pair of shape coordinates for that triangle. When such a difference is statistically significant, it may be interpreted as the ratio of a pair of size variables measured along directions a t an angle averaging 90\" in the samples of forms. One size variable will bear the greatest mean rate or ratio of change between the forms, the other the least. Analysis of configurations of more than three landmarks reduces to consideration of size variables involving at most three landmarks. These techniques are demonstrated in a study of the growth of the head in 62 normal Ann Arbor youth. Each comparison of interest is summarized in its own orthogonal coordinate system, the biorthogonal grid pair."
            },
            "slug": "Size-and-Shape-Spaces-for-Landmark-Data-in-Two-Bookstein",
            "title": {
                "fragments": [],
                "text": "Size and Shape Spaces for Landmark Data in Two Dimensions"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1835233"
                        ],
                        "name": "I. Dryden",
                        "slug": "I.-Dryden",
                        "structuredName": {
                            "firstName": "Ian",
                            "lastName": "Dryden",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Dryden"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3209910"
                        ],
                        "name": "K. Mardia",
                        "slug": "K.-Mardia",
                        "structuredName": {
                            "firstName": "Kanti",
                            "lastName": "Mardia",
                            "middleNames": [
                                "V."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Mardia"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 58,
                                "start": 54
                            }
                        ],
                        "text": "This result generalizes the work of Dryden and Mardia [10]."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 129,
                                "start": 122
                            }
                        ],
                        "text": "Our result simultaneously addresses both the di culties mentioned above while extending the probabilistic shape framework [7, 10] from simple translation, scaling and image-plane rotation invariance to full a ne invariance."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 120455101,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "9aeb70824923b3acc9f97ef22b988cb07e667e14",
            "isKey": false,
            "numCitedBy": 71,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper we investigate the exact shape distribution for general Gaussian labelled point configurations in two dimensions. The shape density is written in a closed form, in terms of Kendall's or Bookstein's shape variables. The distribution simplifies considerably in certain cases, including the complex normal, isotropic, circular Markov and equal means cases. Various asymptotic properties of the distribution are investigated, including a large variation distribution and the normal approximation for small variations. The triangle case is considered in particular detail, and we compare the density with simulated densities for some examples. Finally, we consider inference problems, with an application in biology."
            },
            "slug": "General-shape-distributions-in-a-plane-Dryden-Mardia",
            "title": {
                "fragments": [],
                "text": "General shape distributions in a plane"
            },
            "venue": {
                "fragments": [],
                "text": "Advances in Applied Probability"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49555086"
                        ],
                        "name": "L. Sirovich",
                        "slug": "L.-Sirovich",
                        "structuredName": {
                            "firstName": "Lawrence",
                            "lastName": "Sirovich",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Sirovich"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2053520352"
                        ],
                        "name": "M. Kirby",
                        "slug": "M.-Kirby",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Kirby",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Kirby"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 95,
                                "start": 84
                            }
                        ],
                        "text": "Two approaches have been developed to address this problem: (1) image-based methods [5, 18, 22]; and (2) geometrybased methods such as the generalized Hough transform [13], geometric hashing [20, 25], alignment [14], and geometric invariants [17]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 982857,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2a62d0cca2fabf1d6f6ee15e4c14cef415b657d1",
            "isKey": false,
            "numCitedBy": 2592,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "A method is presented for the representation of (pictures of) faces. Within a specified framework the representation is ideal. This results in the characterization of a face, to within an error bound, by a relatively low-dimensional vector. The method is illustrated in detail by the use of an ensemble of pictures taken for this purpose."
            },
            "slug": "Low-dimensional-procedure-for-the-characterization-Sirovich-Kirby",
            "title": {
                "fragments": [],
                "text": "Low-dimensional procedure for the characterization of human faces."
            },
            "tldr": {
                "abstractSimilarityScore": 57,
                "text": "A method is presented for the representation of faces that results in the characterization of a face, to within an error bound, by a relatively low-dimensional vector."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics and image science"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2511655"
                        ],
                        "name": "M. Burl",
                        "slug": "M.-Burl",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Burl",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Burl"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1695784"
                        ],
                        "name": "U. Fayyad",
                        "slug": "U.-Fayyad",
                        "structuredName": {
                            "firstName": "Usama",
                            "lastName": "Fayyad",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "U. Fayyad"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1690922"
                        ],
                        "name": "P. Perona",
                        "slug": "P.-Perona",
                        "structuredName": {
                            "firstName": "Pietro",
                            "lastName": "Perona",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Perona"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50860274"
                        ],
                        "name": "Padhraic Smyth",
                        "slug": "Padhraic-Smyth",
                        "structuredName": {
                            "firstName": "Padhraic",
                            "lastName": "Smyth",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Padhraic Smyth"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 95,
                                "start": 84
                            }
                        ],
                        "text": "Two approaches have been developed to address this problem: (1) image-based methods [5, 18, 22]; and (2) geometrybased methods such as the generalized Hough transform [13], geometric hashing [20, 25], alignment [14], and geometric invariants [17]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 5647595,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "7aeb1fd1d15173b3b0ce389993494e5d7d95960d",
            "isKey": false,
            "numCitedBy": 84,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "Our long-term goal is to develop a trainable tool for locating patterns of interest in large image databases. Toward this goal we have developed a prototype system, based on classical filtering and statistical pattern recognition techniques, for automatically locating volcanoes in the Magellan SAR database of Venus. Training for the specific volcano-detection task is obtained by synthesizing feature templates (via normalization and principal components analysis) from a small number of examples provided by experts. Candidate regions identified by a focus of attention (FOA) algorithm are classified based on correlations with the feature templates. Preliminary tests show performance comparable to trained human observers.<<ETX>>"
            },
            "slug": "Automating-the-hunt-for-volcanoes-on-Venus-Burl-Fayyad",
            "title": {
                "fragments": [],
                "text": "Automating the hunt for volcanoes on Venus"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "A prototype system, based on classical filtering and statistical pattern recognition techniques, for automatically locating volcanoes in the Magellan SAR database of Venus, and preliminary tests show performance comparable to trained human observers."
            },
            "venue": {
                "fragments": [],
                "text": "1994 Proceedings of IEEE Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1994
        },
        {
            "authors": [],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 123,
                                "start": 108
                            }
                        ],
                        "text": "The resulting shape variables are equivalent to the a ne invariants that have been used in previous studies [9, 17, 20, 25]."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 246,
                                "start": 242
                            }
                        ],
                        "text": "Two approaches have been developed to address this problem: (1) image-based methods [5, 18, 22]; and (2) geometrybased methods such as the generalized Hough transform [13], geometric hashing [20, 25], alignment [14], and geometric invariants [17]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 208784962,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0ff65ac698013cdd9d61326cab49a1d75404e001",
            "isKey": false,
            "numCitedBy": 18721,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Editors",
            "title": {
                "fragments": [],
                "text": "Editors"
            },
            "venue": {
                "fragments": [],
                "text": "Brain Research Bulletin"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2598854"
                        ],
                        "name": "I. Rigoutsos",
                        "slug": "I.-Rigoutsos",
                        "structuredName": {
                            "firstName": "Isidore",
                            "lastName": "Rigoutsos",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Rigoutsos"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30489560"
                        ],
                        "name": "R. Hummel",
                        "slug": "R.-Hummel",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Hummel",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Hummel"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 153,
                                "start": 142
                            }
                        ],
                        "text": "However, it has been shown that, in practice, the calculated a ne invariants can be quite sensitive to errors in the image plane measurements [1, 12, 20]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 93,
                                "start": 89
                            }
                        ],
                        "text": "Our result is also applicable to the problem of rehashing the a ne invariants studied in [20]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 76,
                                "start": 64
                            }
                        ],
                        "text": "This invariance is exploited by many object recognition systems [13, 20, 25] for indexing into an object database."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 199,
                                "start": 191
                            }
                        ],
                        "text": "Two approaches have been developed to address this problem: (1) image-based methods [5, 18, 22]; and (2) geometrybased methods such as the generalized Hough transform [13], geometric hashing [20, 25], alignment [14], and geometric invariants [17]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 123,
                                "start": 108
                            }
                        ],
                        "text": "The resulting shape variables are equivalent to the a ne invariants that have been used in previous studies [9, 17, 20, 25]."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                }
            ],
            "corpusId": 206561182,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d7fc1c85bf41266762623a81abaad8cbf19c48e4",
            "isKey": true,
            "numCitedBy": 62,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-Bayesian-Approach-to-Model-Matching-with-Hashing-Rigoutsos-Hummel",
            "title": {
                "fragments": [],
                "text": "A Bayesian Approach to Model Matching with Geometric Hashing"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Vis. Image Underst."
            },
            "year": 1995
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 112,
                                "start": 102
                            }
                        ],
                        "text": "The a ne shape density for a subset of features can then be used to rank the incomplete constellation [6, 7, 16]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 101,
                                "start": 97
                            }
                        ],
                        "text": "Various representations have been used to model spatial con gurations including mutual distances [16], springs [26], energy functions over mesh grids [24], and eigenshapes [8]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 59,
                                "start": 38
                            }
                        ],
                        "text": "An emerging framework for recognition [4, 7, 8, 16, 19, 24] combines the image-based and geometrybased methods."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 98,
                                "start": 91
                            }
                        ],
                        "text": "At present, the detection rate of our algorithm is about 70% on the face databases used in [6, 16]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Finding Faces in Cluttered Scenes"
            },
            "venue": {
                "fragments": [],
                "text": "ICCV, Cambridge, MA"
            },
            "year": 1995
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 111,
                                "start": 104
                            }
                        ],
                        "text": "The use of shape models to represent variation in biological samples (e.g. sea shells) was pioneered by Kendall [15] and Bookstein [2], but has only recently been applied to computer vision."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 41,
                                "start": 37
                            }
                        ],
                        "text": "sea shells) was pioneered by Kendall [15] and Bookstein [2], but has only recently been applied to computer vision."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 62,
                                "start": 55
                            }
                        ],
                        "text": "Following the de nition of Euclidean shape proposed by Kendall [15], we will de ne a ne shape as the information remaining in a planar con guration\nof labeled points after di erences due to a ne transformations have been factored out."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 67,
                                "start": 63
                            }
                        ],
                        "text": "Following the de nition of Euclidean shape proposed by Kendall [15], we will de ne a ne shape as the information remaining in a planar con guration of labeled points after di erences due to a ne transformations have been factored out."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "ShapeManifolds"
            },
            "venue": {
                "fragments": [],
                "text": "ProcrusteanMetrics, and Complex Projective Spaces\". Bull. London Math Soc., 16"
            },
            "year": 1984
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 153,
                                "start": 142
                            }
                        ],
                        "text": "However, it has been shown that, in practice, the calculated a ne invariants can be quite sensitive to errors in the image plane measurements [1, 12, 20]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 93,
                                "start": 89
                            }
                        ],
                        "text": "Previous work has been performed to characterize the distribution of the error by bounds [12] or low order approximations [1]."
                    },
                    "intents": []
                }
            ],
            "corpusId": 34483597,
            "fieldsOfStudy": [],
            "id": "dee4452076cdf1b31350a0bf5577b8df32eb0102",
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A Study of Affine Matching With Bounded Sensor Error"
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145663869"
                        ],
                        "name": "D. W. Lewis",
                        "slug": "D.-W.-Lewis",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Lewis",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. W. Lewis"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 44,
                                "start": 40
                            }
                        ],
                        "text": "(See, for example, Theorem 2, pg 106 in [11]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 39294286,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9b5f66a6b02003d2717c698e1c1deb8facca05a6",
            "isKey": false,
            "numCitedBy": 1999,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Matrix-theory-Lewis",
            "title": {
                "fragments": [],
                "text": "Matrix theory"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 59,
                                "start": 38
                            }
                        ],
                        "text": "An emerging framework for recognition [4, 7, 8, 16, 19, 24] combines the image-based and geometrybased methods."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Learning Feature UncertaintyModels for Object Recognition"
            },
            "venue": {
                "fragments": [],
                "text": "In IEEE Int. Sym. on Comp. Vis.,"
            },
            "year": 1995
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 96,
                                "start": 93
                            }
                        ],
                        "text": "We obtained \\true\" 3D locations of points on the human head using active lighting techniques [3]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "3-D Photography System using Stripe Projection"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1997
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 103,
                                "start": 92
                            }
                        ],
                        "text": "The result is interesting because most other techniques are designed only for frontal faces [6, 21, 23]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 147,
                                "start": 143
                            }
                        ],
                        "text": "In the face detection context, occlusions will present a very di cult situation in the intensity matching-based face detectors of Rowley et al [21] and Sung et al [23], while our system can deal with it naturally."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Neural networkbased face detection"
            },
            "venue": {
                "fragments": [],
                "text": "CVPR."
            },
            "year": 1996
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 14,
            "methodology": 16,
            "result": 5
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 27,
        "totalPages": 3
    },
    "page_url": "https://www.semanticscholar.org/paper/Probabilistic-affine-invariants-for-recognition-Leung-Burl/846b99d151892e70046e5ca541430be4ff67209f?sort=total-citations"
}