{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2480424"
                        ],
                        "name": "M. Hawken",
                        "slug": "M.-Hawken",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Hawken",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Hawken"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1735689"
                        ],
                        "name": "A. Parker",
                        "slug": "A.-Parker",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Parker",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Parker"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 9934779,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "b2526eb4516be80de1e13fa0507c5c5e00f12f00",
            "isKey": false,
            "numCitedBy": 198,
            "numCiting": 75,
            "paperAbstract": {
                "fragments": [],
                "text": "Contrast sensitivity as a function of spatial frequency was determined for 138 neurons in the foveal region of primate striate cortex. The accuracy of three models in describing these functions was assessed by the method of least squares. Models based on difference-of-Gaussians (DOG) functions were shown to be superior to those based on the Gabor function or the second differential of a Gaussian. In the most general case of the DOG models, each subregion of a simple cell’s receptive field was constructed from a single DOG function. All the models are compatible with the classical observation that the receptive fields of simple cells are made up of spatially discrete ‘on’ and ‘off’ regions. Although the DOG-based models have more free parameters, they can account better for the variety of shapes of spatial contrast sensitivity functions observed in cortical cells and, unlike other models, they provide a detailed description of the organization of subregions of the receptive field that is consistent with the physiological constraints imposed by earlier stages in the visual pathway. Despite the fact that the DOG-based models have spatially discrete components, the resulting amplitude spectra in the frequency domain describe complex cells just as well as simple cells. The superiority of the DOG-based models as a primary spatial filter is discussed in relation to popular models of visual processing that use the Gabor function or the second differential of a Gaussian."
            },
            "slug": "Spatial-properties-of-neurons-in-the-monkey-striate-Hawken-Parker",
            "title": {
                "fragments": [],
                "text": "Spatial properties of neurons in the monkey striate cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 71,
                "text": "Contrast sensitivity as a function of spatial frequency was determined for 138 neurons in the foveal region of primate striate cortex and models based on difference-of-Gaussians (DOG) functions were shown to be superior to those based on the Gabor function or the second differential of a Gaussian."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7136759,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "c5f5311fa1f34159ab3a0a1d58da51cd0340a640",
            "isKey": false,
            "numCitedBy": 6319,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The striate cortex was studied in lightly anaesthetized macaque and spider monkeys by recording extracellularly from single units and stimulating the retinas with spots or patterns of light. Most cells can be categorized as simple, complex, or hypercomplex, with response properties very similar to those previously described in the cat. On the average, however, receptive fields are smaller, and there is a greater sensitivity to changes in stimulus orientation. A small proportion of the cells are colour coded."
            },
            "slug": "Receptive-fields-and-functional-architecture-of-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields and functional architecture of monkey striate cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 82,
                "text": "The striate cortex was studied in lightly anaesthetized macaque and spider monkeys by recording extracellularly from single units and stimulating the retinas with spots or patterns of light, with response properties very similar to those previously described in the cat."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145707107"
                        ],
                        "name": "J. Movshon",
                        "slug": "J.-Movshon",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Movshon",
                            "middleNames": [
                                "Anthony"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Movshon"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1935795"
                        ],
                        "name": "I. Thompson",
                        "slug": "I.-Thompson",
                        "structuredName": {
                            "firstName": "Ian",
                            "lastName": "Thompson",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Thompson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34941108"
                        ],
                        "name": "D. Tolhurst",
                        "slug": "D.-Tolhurst",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Tolhurst",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Tolhurst"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 5659259,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "d435143b4a7b2d7c56a696504e87db39157c3449",
            "isKey": false,
            "numCitedBy": 963,
            "numCiting": 54,
            "paperAbstract": {
                "fragments": [],
                "text": "1. We have examined the responses of simple cells in the cat's atriate cortex to visual patterns that were designed to reveal the extent to which these cells may be considered to sum light‐evoked influences linearly across their receptive fields. We used one‐dimensional luminance‐modulated bars and grating as stimuli; their orientation was always the same as the preferred orientation of the neurone under study. The stimuli were presented on an oscilloscope screen by a digital computer, which also accumulated neuronal responses and controlled a randomized sequence of stimulus presentations. 2. The majority of simple cells respond to sinusoidal gratings that are moving or whose contrast is modulated in time in a manner consistent with the hypothesis that they have linear spatial summation. Their responses to moving gratings of all spatial frequencies are modulated in synchrony with the passage of the gratings' bars across their receptive fields, and they do not produce unmodulated responses even at the highest spatial frequencies. Many of these cells respond to temporally modulated stationary gratings simply by changing their response amplitude sinusoidally as the spatial phase of the grating the grating is varied. Nonetheless, their behavior appears to indicate linear spatial summation, since we show in an Appendix that the absence of a 'null' phase in a visual neurone need not indicate non‐linear spatial summation, and further that a linear neurone lacking a 'null' phase should give responses of the form that we have observed in this type of simple cell. 3. A minority of simple cells appears to have significant non‐linearities of spatial summation. These neurones respond to moving gratings of high spatial frequency with a partially or totally unmodulated elevation of firing rate. They have no 'null' phases when tested with stationary gratings, and reveal their non‐linearity by giving responses to gratings of some spatial phases that are composed partly or wholly of even harmonics of the stimulus frequency ('on‐off' responses). 4. We compared simple receptive fields with their sensitivity to sinusoidal gratings of different spatial frequencies. Qualitatively, the most sensitive subregions of simple cells' receptive fields are roughly the same width as the individual bars of the gratings to which they are most sensitive. Quantitatively, their receptive field profiles measured with thin stationary lines, agree well with predicted profiles derived by Fourier synthesis of their spatial frequency tuning curves."
            },
            "slug": "Spatial-summation-in-the-receptive-fields-of-simple-Movshon-Thompson",
            "title": {
                "fragments": [],
                "text": "Spatial summation in the receptive fields of simple cells in the cat's striate cortex."
            },
            "tldr": {
                "abstractSimilarityScore": 92,
                "text": "The responses of simple cells in the cat's atriate cortex to visual patterns that were designed to reveal the extent to which these cells may be considered to sum light‐evoked influences linearly across their receptive fields are examined."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39409429"
                        ],
                        "name": "R. L. Valois",
                        "slug": "R.-L.-Valois",
                        "structuredName": {
                            "firstName": "Russell",
                            "lastName": "Valois",
                            "middleNames": [
                                "L.",
                                "de"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. L. Valois"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2129244"
                        ],
                        "name": "D. G. Albrecht",
                        "slug": "D.-G.-Albrecht",
                        "structuredName": {
                            "firstName": "Duane",
                            "lastName": "Albrecht",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. G. Albrecht"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40471674"
                        ],
                        "name": "Lisa G. Thorell",
                        "slug": "Lisa-G.-Thorell",
                        "structuredName": {
                            "firstName": "Lisa",
                            "lastName": "Thorell",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Lisa G. Thorell"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16496844,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "e2f74bec30cc4e471919de4dfd27c45dbc7b4b9d",
            "isKey": false,
            "numCitedBy": 1118,
            "numCiting": 53,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Spatial-frequency-selectivity-of-cells-in-macaque-Valois-Albrecht",
            "title": {
                "fragments": [],
                "text": "Spatial frequency selectivity of cells in macaque visual cortex"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145707107"
                        ],
                        "name": "J. Movshon",
                        "slug": "J.-Movshon",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Movshon",
                            "middleNames": [
                                "Anthony"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Movshon"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1935795"
                        ],
                        "name": "I. Thompson",
                        "slug": "I.-Thompson",
                        "structuredName": {
                            "firstName": "Ian",
                            "lastName": "Thompson",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Thompson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34941108"
                        ],
                        "name": "D. Tolhurst",
                        "slug": "D.-Tolhurst",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Tolhurst",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Tolhurst"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7684023,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "83f9320a93b7c35a4d4791d4012898c9c25da8cc",
            "isKey": false,
            "numCitedBy": 670,
            "numCiting": 74,
            "paperAbstract": {
                "fragments": [],
                "text": "1. We have examined the spatial and temporal tuning properties of 238 cortical neurones, recorded using conventional techniques from acutely prepared anaesthetized cats. We determined spatial and temporal frequency tuning curves using sinusoidal grating stimuli presented to each neurone's receptive field by a digital computer on a cathode ray tube. 2. We measured tuning curves either by determining response amplitude as a function of spatial or temporal frequency, or by measuring contrast sensitivity (the inverse of the contrast of the grating that just elicited a detectable response). The two measures give very similar tuning curves in all cases. 3. We recorded from 184 neurones in area 17; of these 156 had receptive fields within 5 degrees of the area centralis. The range of preferred spatial frequency for these neurones was 0.3‐‐3 c/deg, and their spatial frequency tuning band widths varied from 0.7 to 3.2 octaves at half‐amplitude. The most common band width was roughly 1.3 octaves. Simple and complex cells in area 17 did not differ in their distributions of preferred spatial frequency, although complex cells were, on average, slightly less selective for spatial frequency than simple cells. 4. We recorded from fifty‐four neurones from area 18, and performed several experiments in which we recorded from corresponding portions of both area 17 and area 18 in the same electrode penetration. Neurones in area 18 preferred spatial frequencies that were, on average, one third as high as those preferred by area 17 neurones at the same retinal eccentricity. Thus the range of preferred spatial frequency in area eighteen cells having receptive fields within 5 deg of the area centralis was between less than 0.1 and 0.5 c/deg. The distributions of optimum spatial frequency in the two areas were practically non‐overlapping at eccentricities as high as 15 deg, the greatest eccentricity we examined. Neurones in area 18 were about as selective for spatial frequency as were neurones in area 17. 5. We determined temporal frequency tuning characteristics for some neurones from each area, using gratings that moved steadily across the screen. Neurones from area 17 all responded well to low temporal frequencies, and less well to higher frequencies (in excess of, usually, 2 or 4 Hz). In contrast, neurones recorded from area 18 sometimes had similar tuning properties, but more commonly showed a pronounced reduction in response as the temporal frequency was moved either above or below some optimum value (usually 2‐‐8 Hz). 6. We conclude from these results that areas 17 and 18 act in parallel to process different aspects of the visual information relayed from the retina via the lateral geniculate complex. Some or all of the differences between the areas may be attributable to the predominance of Y cell input to area 18 and the predominance of X cell input to area 17..."
            },
            "slug": "Spatial-and-temporal-contrast-sensitivity-of-in-17-Movshon-Thompson",
            "title": {
                "fragments": [],
                "text": "Spatial and temporal contrast sensitivity of neurones in areas 17 and 18 of the cat's visual cortex."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "It is concluded that areas 17 and 18 act in parallel to process different aspects of the visual information relayed from the retina via the lateral geniculate complex."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17055992,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6b4fe4aa4d66fecc7b2869569002714d91d0b3f7",
            "isKey": false,
            "numCitedBy": 12432,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "What chiefly distinguishes cerebral cortex from other parts of the central nervous system is the great diversity of its cell types and interconnexions. It would be astonishing if such a structure did not profoundly modify the response patterns of fibres coming into it. In the cat's visual cortex, the receptive field arrangements of single cells suggest that there is indeed a degree of complexity far exceeding anything yet seen at lower levels in the visual system. In a previous paper we described receptive fields of single cortical cells, observing responses to spots of light shone on one or both retinas (Hubel & Wiesel, 1959). In the present work this method is used to examine receptive fields of a more complex type (Part I) and to make additional observations on binocular interaction (Part II). This approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours. In the past, the technique of recording evoked slow waves has been used with great success in studies of functional anatomy. It was employed by Talbot & Marshall (1941) and by Thompson, Woolsey & Talbot (1950) for mapping out the visual cortex in the rabbit, cat, and monkey. Daniel & Whitteiidge (1959) have recently extended this work in the primate. Most of our present knowledge of retinotopic projections, binocular overlap, and the second visual area is based on these investigations. Yet the method of evoked potentials is valuable mainly for detecting behaviour common to large populations of neighbouring cells; it cannot differentiate functionally between areas of cortex smaller than about 1 mm2. To overcome this difficulty a method has in recent years been developed for studying cells separately or in small groups during long micro-electrode penetrations through nervous tissue. Responses are correlated with cell location by reconstructing the electrode tracks from histological material. These techniques have been applied to"
            },
            "slug": "Receptive-fields,-binocular-interaction-and-in-the-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields, binocular interaction and functional architecture in the cat's visual cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This method is used to examine receptive fields of a more complex type and to make additional observations on binocular interaction and this approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1962
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4908829"
                        ],
                        "name": "R. Schumer",
                        "slug": "R.-Schumer",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Schumer",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Schumer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145707107"
                        ],
                        "name": "J. Movshon",
                        "slug": "J.-Movshon",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Movshon",
                            "middleNames": [
                                "Anthony"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Movshon"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 41690003,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "17d189815704185919eafd80ccc8540071a5eabb",
            "isKey": false,
            "numCitedBy": 41,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Length-summation-in-simple-cells-of-cat-striate-Schumer-Movshon",
            "title": {
                "fragments": [],
                "text": "Length summation in simple cells of cat striate cortex"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32733837"
                        ],
                        "name": "H. Wilson",
                        "slug": "H.-Wilson",
                        "structuredName": {
                            "firstName": "Hugh",
                            "lastName": "Wilson",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Wilson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 31772015,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "c215514dba886382009732afd1346cd4a86c9501",
            "isKey": false,
            "numCitedBy": 82,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "Visual discrimination of contour curvature was investigated using stimuli having a single point of maximum curvature and a continuous derivative. Curvature discrimination as a function of mean curvature could be described by a power law with an exponent averaging 1.57. Data were also gathered as a function of line width, stimulus orientation, and retinal eccentricity. Finally, masking experiments provided evidence that the mechanisms responsible for curvature discrimination were both orientation and spatial-frequency selective. The data are well fitted by theoretical results derived from a line-element model that has recently been applied to spatial-frequency discrimination."
            },
            "slug": "Discrimination-of-contour-curvature:-data-and-Wilson",
            "title": {
                "fragments": [],
                "text": "Discrimination of contour curvature: data and theory."
            },
            "tldr": {
                "abstractSimilarityScore": 72,
                "text": "Visual discrimination of contour curvature was investigated using stimuli having a single point of maximum curvature and a continuous derivative to provide evidence that the mechanisms responsible for curvature discrimination were both orientation and spatial-frequency selective."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics and image science"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1781325"
                        ],
                        "name": "J. Daugman",
                        "slug": "J.-Daugman",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Daugman",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Daugman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 9271650,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "02f89cd1fd6f013a1a301a292936ff8fb06aff25",
            "isKey": false,
            "numCitedBy": 3420,
            "numCiting": 46,
            "paperAbstract": {
                "fragments": [],
                "text": "Two-dimensional spatial linear filters are constrained by general uncertainty relations that limit their attainable information resolution for orientation, spatial frequency, and two-dimensional (2D) spatial position. The theoretical lower limit for the joint entropy, or uncertainty, of these variables is achieved by an optimal 2D filter family whose spatial weighting functions are generated by exponentiated bivariate second-order polynomials with complex coefficients, the elliptic generalization of the one-dimensional elementary functions proposed in Gabor's famous theory of communication [J. Inst. Electr. Eng. 93, 429 (1946)]. The set includes filters with various orientation bandwidths, spatial-frequency bandwidths, and spatial dimensions, favoring the extraction of various kinds of information from an image. Each such filter occupies an irreducible quantal volume (corresponding to an independent datum) in a four-dimensional information hyperspace whose axes are interpretable as 2D visual space, orientation, and spatial frequency, and thus such a filter set could subserve an optimally efficient sampling of these variables. Evidence is presented that the 2D receptive-field profiles of simple cells in mammalian visual cortex are well described by members of this optimal 2D filter family, and thus such visual neurons could be said to optimize the general uncertainty relations for joint 2D-spatial-2D-spectral information resolution. The variety of their receptive-field dimensions and orientation and spatial-frequency bandwidths, and the correlations among these, reveal several underlying constraints, particularly in width/length aspect ratio and principal axis organization, suggesting a polar division of labor in occupying the quantal volumes of information hyperspace.(ABSTRACT TRUNCATED AT 250 WORDS)"
            },
            "slug": "Uncertainty-relation-for-resolution-in-space,-and-Daugman",
            "title": {
                "fragments": [],
                "text": "Uncertainty relation for resolution in space, spatial frequency, and orientation optimized by two-dimensional visual cortical filters."
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "Evidence is presented that the 2D receptive-field profiles of simple cells in mammalian visual cortex are well described by members of this optimal 2D filter family, and thus such visual neurons could be said to optimize the general uncertainty relations for joint 2D-spatial-2D-spectral information resolution."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics and image science"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34941108"
                        ],
                        "name": "D. Tolhurst",
                        "slug": "D.-Tolhurst",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Tolhurst",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Tolhurst"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1935795"
                        ],
                        "name": "I. Thompson",
                        "slug": "I.-Thompson",
                        "structuredName": {
                            "firstName": "Ian",
                            "lastName": "Thompson",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Thompson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 24690002,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "c9f07d97053908103b85fd2b771dd1fc92abf158",
            "isKey": false,
            "numCitedBy": 148,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": "The amplitudes of the responses of over 300 neurons in area 17 of the cat were examined as a function of the spatial frequency of moving sinusoidal gratings. The optimal spatial frequency and the bandwidth of the tuning curves were determined. The bandwidth varied considerably from neuron to neuron. Neurons optimally responsive to high spatial frequencies tended to have narrower tuning curves than those responsive to lower frequencies. Neurons with narrow spatial frequency tuning curves also tended to have narrow orientation tuning curves. These observations suggest that linear spatial summation tends to occur over a relatively constant area of visual field despite marked differences in each neuron’s optimal spatial frequency, a prediction of one model of visual analysis. There was little difference in either the optimal spatial frequencies or the bandwidths of tuning for different functional classes of neuron. Neurons with broad tuning curves tended to be restricted to lamina IV and its environs, being concentrated in the deep part of lamina II–III and the upper part of lamina IV ab. Neurons with very low optimal spatial frequencies were uncommon and tended to be found either at the border of laminae II–III and IV or in lamina V. These laminar distributions are discussed with respect to the laminar differences in the projection of l. g. n. X- and Y- cells to the visual cortex."
            },
            "slug": "On-the-variety-of-spatial-frequency-selectivities-Tolhurst-Thompson",
            "title": {
                "fragments": [],
                "text": "On the variety of spatial frequency selectivities shown by neurons in area 17 of the cat"
            },
            "tldr": {
                "abstractSimilarityScore": 57,
                "text": "The amplitudes of the responses of over 300 neurons in area 17 of the cat were examined and suggest that linear spatial summation tends to occur over a relatively constant area of visual field despite marked differences in each neuron’s optimal spatial frequency, a prediction of one model of visual analysis."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32733837"
                        ],
                        "name": "H. Wilson",
                        "slug": "H.-Wilson",
                        "structuredName": {
                            "firstName": "Hugh",
                            "lastName": "Wilson",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Wilson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38508487"
                        ],
                        "name": "D. Gelb",
                        "slug": "D.-Gelb",
                        "structuredName": {
                            "firstName": "Douglas",
                            "lastName": "Gelb",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Gelb"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 2495419,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "1b6ba29612e2918925e09489d42ee3d2fbb7f322",
            "isKey": false,
            "numCitedBy": 288,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "Recent data from several laboratories have shown that spatial-frequency discrimination is not a smooth function of frequency but rather exhibits alternate peaks and troughs. A model for spatial-frequency discrimination analogous to line-element models for color discrimination is presented here and shown to provide a reasonable fit to the available data. This model is based on the predicted responses of six spatial-frequency-tuned mechanisms, whose sensitivity curves have been estimated in previously published masking experiments. In order to fit the data it is necessary to pool responses from units centered under the stimulus as well as from spatially neighboring units. Thus it appears that the visual system utilizes both spatial and spatial-frequency information in discrimination tasks."
            },
            "slug": "Modified-line-element-theory-for-spatial-frequency-Wilson-Gelb",
            "title": {
                "fragments": [],
                "text": "Modified line-element theory for spatial-frequency and width discrimination."
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "A model for spatial-frequency discrimination analogous to line-element models for color discrimination is presented here and shown to provide a reasonable fit to the available data."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics and image science"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153604912"
                        ],
                        "name": "G. Phillips",
                        "slug": "G.-Phillips",
                        "structuredName": {
                            "firstName": "Greg",
                            "lastName": "Phillips",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Phillips"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32733837"
                        ],
                        "name": "H. Wilson",
                        "slug": "H.-Wilson",
                        "structuredName": {
                            "firstName": "Hugh",
                            "lastName": "Wilson",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Wilson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 35683610,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "cd93cf9cc3b1544e287e1861e9119170e305e084",
            "isKey": false,
            "numCitedBy": 286,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "Orientation tuning curves were measured at 10 spatial frequencies ranging from 0.5 to 11.3 cycles per degree (cpd) using a masking paradigm. The stimuli were spatially localized test patterns of 1.0 octave bandwidth superimposed upon cosine grating masks. By using a model that corrects for the nonlinearity inherent in the masking process, we obtain the half-amplitude half-bandwidths (theta 1/2) of Cartesian-separable receptive fields that may underlie orientation selectivity. Additional experiments show that the data are not compatible with separability in polar coordinates (spatial frequency and orientation). The orientation half-bandwidths have been found to decrease somewhat with increasing spatial frequency, going from about 30 degrees at 0.5 cpd to 15 degrees at 11.3 cpd, for both sustained and transient forms of temporal modulation. Similar bandwidths are obtained from data where the test is oriented along 45 degrees. These bandwidth estimates are shown to be consistent with subthreshold summation data as well as physiological data from monkey striate cortex."
            },
            "slug": "Orientation-bandwidths-of-spatial-mechanisms-by-Phillips-Wilson",
            "title": {
                "fragments": [],
                "text": "Orientation bandwidths of spatial mechanisms measured by masking."
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "By using a model that corrects for the nonlinearity inherent in the masking process, the half-amplitude half-bandwidths of Cartesian-separable receptive fields that may underlie orientation selectivity are obtained and are shown to be consistent with subthreshold summation data as well as physiological data from monkey striate cortex."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics and image science"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3133875"
                        ],
                        "name": "C. Blakemore",
                        "slug": "C.-Blakemore",
                        "structuredName": {
                            "firstName": "Colin",
                            "lastName": "Blakemore",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Blakemore"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4800025"
                        ],
                        "name": "F. Campbell",
                        "slug": "F.-Campbell",
                        "structuredName": {
                            "firstName": "Fergus",
                            "lastName": "Campbell",
                            "middleNames": [
                                "William"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Campbell"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15948874,
            "fieldsOfStudy": [
                "Medicine"
            ],
            "id": "1e1f6f39b97b1ed460dd6e1a8819903ea8966cd8",
            "isKey": false,
            "numCitedBy": 2055,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "1. It was found that an occipital evoked potential can be elicited in the human by moving a grating pattern without changing the mean light flux entering the eye. Prolonged viewing of a high contrast grating reduces the amplitude of the potential evoked by a low contrast grating."
            },
            "slug": "On-the-existence-of-neurones-in-the-human-visual-to-Blakemore-Campbell",
            "title": {
                "fragments": [],
                "text": "On the existence of neurones in the human visual system selectively sensitive to the orientation and size of retinal images"
            },
            "tldr": {
                "abstractSimilarityScore": 99,
                "text": "It was found that an occipital evoked potential can be elicited in the human by moving a grating pattern without changing the mean light flux entering the eye."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1969
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "36155815"
                        ],
                        "name": "J. Robson",
                        "slug": "J.-Robson",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Robson",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Robson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1932236"
                        ],
                        "name": "N. Graham",
                        "slug": "N.-Graham",
                        "structuredName": {
                            "firstName": "N.",
                            "lastName": "Graham",
                            "middleNames": [
                                "V.",
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Graham"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7250795,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "7bbbaabe002dab78c3a036a43d5ebc3e4f288a2c",
            "isKey": false,
            "numCitedBy": 635,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Probability-summation-and-regional-variation-in-the-Robson-Graham",
            "title": {
                "fragments": [],
                "text": "Probability summation and regional variation in contrast sensitivity across the visual field"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1407756324"
                        ],
                        "name": "C. Enroth-Cugell",
                        "slug": "C.-Enroth-Cugell",
                        "structuredName": {
                            "firstName": "Christina",
                            "lastName": "Enroth-Cugell",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Enroth-Cugell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "36155815"
                        ],
                        "name": "J. Robson",
                        "slug": "J.-Robson",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Robson",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Robson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 3052969,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "c6609ae352d9e1c99530136e41798f337496ff27",
            "isKey": false,
            "numCitedBy": 2635,
            "numCiting": 52,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Spatial summation within cat retinal receptive fields was studied by recording from optic‐tract fibres the responses of ganglion cells to grating patterns whose luminance perpendicular to the bars varied sinusoidally about the mean level."
            },
            "slug": "The-contrast-sensitivity-of-retinal-ganglion-cells-Enroth-Cugell-Robson",
            "title": {
                "fragments": [],
                "text": "The contrast sensitivity of retinal ganglion cells of the cat"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Spatial summation within cat retinal receptive fields was studied by recording from optic‐tract fibres the responses of ganglion cells to grating patterns whose luminance perpendicular to the bars varied sinusoidally about the mean level."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1966
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5024927"
                        ],
                        "name": "D. Ferster",
                        "slug": "D.-Ferster",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Ferster",
                            "middleNames": [
                                "L"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Ferster"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10770809,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "e27e6e18f525a6cd3f457b56da84a78d06597a63",
            "isKey": false,
            "numCitedBy": 314,
            "numCiting": 41,
            "paperAbstract": {
                "fragments": [],
                "text": "Neurons of the visual cortex of the cat were penetrated with intracellular electrodes and postsynaptic potentials evoked by visual stimuli recorded. By alternately polarizing the cell with steady current injected through the recording electrode, IPSPs and EPSPs could be recorded and analyzed independently. Hyperpolarizing current suppressed IPSPs and enhanced EPSPs by moving the membrane potential toward the IPSP equilibrium potential. Depolarizing the cell toward the EPSP equilibrium potential enhanced IPSP. The responses to electrical stimulation of the LGN, where EPSPs and IPSPs could be distinguished easily by virtue of their characteristic latencies and shapes, were used to set the current injection to the appropriate level to view the two types of synaptic potential. EPSPs were found to be well oriented in that maximal depolarizing responses could be evoked at only one stimulus orientation; rotating the stimulus orientation in either direction produced a fall in the EPSP response. IPSPs were also well tuned to orientation, and invariably the preferred orientations of EPSPs and IPSPs in any one cell were identical. In addition, no systematic difference in the width of tuning of the two types of potential was seen. This result has been obtained from penetrations of over 30 cortical cells, including those with simple and complex receptive fields It is concluded that orientation of cortical receptive fields is neither created nor sharpened by inhibition between neurons with different orientation preference. The function of inhibition evoked simultaneously with excitation by optimally oriented stimuli has yet to be determined, though it is likely to be the mechanism underlying other corticalreceptive field properties, such as direction selectivit and end-stopping."
            },
            "slug": "Orientation-selectivity-of-synaptic-potentials-in-Ferster",
            "title": {
                "fragments": [],
                "text": "Orientation selectivity of synaptic potentials in neurons of cat primary visual cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "It is concluded that orientation of cortical receptive fields is neither created nor sharpened by inhibition between neurons with different orientation preference, though it is likely to be the mechanism underlying other corticalreceptive field properties, such as direction selectivit and end-stopping."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of neuroscience : the official journal of the Society for Neuroscience"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2367447"
                        ],
                        "name": "H. Spitzer",
                        "slug": "H.-Spitzer",
                        "structuredName": {
                            "firstName": "Hedva",
                            "lastName": "Spitzer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Spitzer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3050059"
                        ],
                        "name": "S. Hochstein",
                        "slug": "S.-Hochstein",
                        "structuredName": {
                            "firstName": "Shaul",
                            "lastName": "Hochstein",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Hochstein"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 35627371,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "c20fba573a489081b85b3b4f475e464995d475b3",
            "isKey": false,
            "numCitedBy": 93,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "We studied the response time course and amplitude dependence on stimulation parameters in cat cortical visual neurons to determine their receptive-field spatial-summation characteristics. Response poststimulus time (PST) histograms of cortical simple cells to contrast-reversal grating stimulation generally have a single peak for each stimulus temporal cycle, though the responses appear rectified. In response to contrast-reversal grating stimulation the general PST histogram time course for complex cells is two peaks, though often these peaks are of different amplitudes. The time course of complex-cell responses, and the ratio of these two response peaks often varies with stimulation parameters. The appearance of a single response peak in simple cells is reflected in the dominance of the odd harmonic Fourier portion, whereas the half-wave rectification leads to a considerable even harmonic portion. Still, this even portion is never significantly greater than the odd portion. When complex cell PST histograms have two nearly equal peaks, Fourier transformation reveals almost only even harmonic components. When the histogram contains two peaks of unequal amplitude Fourier analysis reveals large odd and even components. An even:odd Fourier harmonic portion ratio larger than 1 may be seen as a defining characteristic of complex cells, differentiating them from simple cells. Histograms with two unequal peaks appear \"mixed,\" containing something of the \"pure\" single-peaked response and something of the pure double-peaked response. The degree to which the response is mixed may be measured by the ratio of the even:odd portion amplitudes. There is a great degree of variability with stimulation parameters (both spatial phase and spatial frequency) of the time course of mixed responses as opposed to the case of responses that have two equal peaks independent of stimulation grating phase and frequency. In both simple and complex cells there is a close coincidence of the spatial frequency ranges over which the even and odd portions are substantial, though many complex cells show a periodic variation of the even:odd portions ratio. This spatial-frequency dependence differs from that of LGN Y-cells where the odd portion dominates at low spatial frequencies and the even portion at high spatial frequencies. The ratio of even-to-odd portion cut-off is close to 3:1 in all Y-cells, a characteristic we did not find in cortical simple or complex cells. We suggest, therefore, that the nonlinearity of these complex cells does not derive from that of Y-cells.(ABSTRACT TRUNCATED AT 400 WORDS)"
            },
            "slug": "Simple-and-complex-cell-response-dependences-on-Spitzer-Hochstein",
            "title": {
                "fragments": [],
                "text": "Simple- and complex-cell response dependences on stimulation parameters."
            },
            "tldr": {
                "abstractSimilarityScore": 76,
                "text": "The response time course and amplitude dependence on stimulation parameters in cat cortical visual neurons are studied to determine their receptive-field spatial-summation characteristics and it is suggested that the nonlinearity of these complex cells does not derive from that of Y-cells."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152575393"
                        ],
                        "name": "R. Dubner",
                        "slug": "R.-Dubner",
                        "structuredName": {
                            "firstName": "Ronald",
                            "lastName": "Dubner",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Dubner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1794253"
                        ],
                        "name": "S. Zeki",
                        "slug": "S.-Zeki",
                        "structuredName": {
                            "firstName": "Semir",
                            "lastName": "Zeki",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Zeki"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10227173,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "c9d45353ec634c6fcc94e0e9265ba9674b2db01a",
            "isKey": false,
            "numCitedBy": 621,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Response-properties-and-receptive-fields-of-cells-Dubner-Zeki",
            "title": {
                "fragments": [],
                "text": "Response properties and receptive fields of cells in an anatomically defined region of the superior temporal sulcus in the monkey."
            },
            "venue": {
                "fragments": [],
                "text": "Brain research"
            },
            "year": 1971
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 18,
        "totalPages": 2
    },
    "page_url": "https://www.semanticscholar.org/paper/Two-dimensional-spatial-structure-of-receptive-in-Parker-Hawken/11a437b768ff54b6af01b5568087b38d97942f00?sort=total-citations"
}