{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2505902"
                        ],
                        "name": "N. Komodakis",
                        "slug": "N.-Komodakis",
                        "structuredName": {
                            "firstName": "Nikos",
                            "lastName": "Komodakis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Komodakis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2441655"
                        ],
                        "name": "G. Tziritas",
                        "slug": "G.-Tziritas",
                        "structuredName": {
                            "firstName": "Georgios",
                            "lastName": "Tziritas",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Tziritas"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 38,
                                "start": 35
                            }
                        ],
                        "text": "This is stated in the next theorem [5] : Theorem 4."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 3,
                                "start": 0
                            }
                        ],
                        "text": "[5] The solution x selected by PD3b during a c-iteration has the minimum primal cost among all solutions that result after a c-expansion of x, except for those"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 88,
                                "start": 85
                            }
                        ],
                        "text": "Furthermore, the last property can be used to prove that conditions (14) remain true [5]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 100,
                                "start": 97
                            }
                        ],
                        "text": "The main routines of PD2μ are mostly similar to the ones of PD1 with only minor differences (see [5] for more details)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 32,
                                "start": 29
                            }
                        ],
                        "text": "In this case it can be shown [5] that if the pair of labels c, b is assigned to p, q (by x) then the resulting load of p, q is greater than the actual separation cost of p, q or equivalently their virtual separation cost overestimates their actual separation cost contrary to the OPTIMALITY CRITERION above (in all other cases there is no such overestimation)."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 128,
                                "start": 125
                            }
                        ],
                        "text": "Based on this definition the following theorem can be proved asserting that PD1 always leads to an fapp-approximate solution [5]:"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 69,
                                "start": 66
                            }
                        ],
                        "text": "Based on the reassign rule, the following properties can be shown [5] to hold for the resulting solutions x, ȳ:"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 79,
                                "start": 76
                            }
                        ],
                        "text": "It can then be shown that PD2μ indeed generates an fappapproximate solution [5]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 17551391,
            "fieldsOfStudy": [
                "Computer Science",
                "Mathematics"
            ],
            "id": "eaadb311afe95c4582ded9c37fd11ec52f9c224a",
            "isKey": false,
            "numCitedBy": 4,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "A linear programming based framework is presented which is capable of providing combinatorial-based approximation algorithms to a certain class of NP-complete classification problems. The resulting algorithms utilize tools from the duality theory of linear programming and have guaranteed optimality properties. Finally, it is shown that state-of-the-art classification techniques can be derived merely as a special case of the considered framework."
            },
            "slug": "Approximate-Labeling-via-the-Primal-Dual-Schema-Komodakis-Tziritas",
            "title": {
                "fragments": [],
                "text": "Approximate Labeling via the Primal-Dual Schema"
            },
            "tldr": {
                "abstractSimilarityScore": 73,
                "text": "A linear programming based framework is presented which is capable of providing combinatorial-based approximation algorithms to a certain class of NP-complete classification problems and it is shown that state-of-the-art classification techniques can be derived merely as a special case of the considered framework."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2005
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1733122"
                        ],
                        "name": "C. Chekuri",
                        "slug": "C.-Chekuri",
                        "structuredName": {
                            "firstName": "Chandra",
                            "lastName": "Chekuri",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Chekuri"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144335444"
                        ],
                        "name": "S. Khanna",
                        "slug": "S.-Khanna",
                        "structuredName": {
                            "firstName": "Sanjeev",
                            "lastName": "Khanna",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Khanna"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1751440"
                        ],
                        "name": "J. Naor",
                        "slug": "J.-Naor",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Naor",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Naor"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2908093"
                        ],
                        "name": "L. Zosin",
                        "slug": "L.-Zosin",
                        "structuredName": {
                            "firstName": "Leonid",
                            "lastName": "Zosin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Zosin"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 44,
                                "start": 38
                            }
                        ],
                        "text": "One class of approximation algorithms [3, 2] solves the ML problem by formulating it as the Linear Programming relaxation of an integer program."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 99,
                                "start": 96
                            }
                        ],
                        "text": "Here we will use the following integer programming formulation of the ML problem, introduced in [2]:"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 14525745,
            "fieldsOfStudy": [
                "Computer Science",
                "Mathematics"
            ],
            "id": "36d35a2316518af12684964c9b9764d4308c401a",
            "isKey": false,
            "numCitedBy": 143,
            "numCiting": 37,
            "paperAbstract": {
                "fragments": [],
                "text": "We consider approximation algorithms for the metric labeling problem. This problem was introduced in a recent paper by Kleinberg and Tardos [20], and captures many classification problems that arise in computer vision and related fields. They gave an &Ogr;(log k log log k) approximation for the general case where k is the number of labels and a 2-approximation for the uniform metric case. More recently, Gupta and Tardos [15] gave a 4-approximation for the truncated linear metric, a natural non-uniform metric motivated by practical applications to image restoration and visual correspondence. In this paper we introduce a natural integer programming formulation and show that the integrality gap of its linear relaxation either matches or improves the ratios known for several cases of the metric labeling problem studied until now, providing a unified approach to solving them. In particular, we show that the integrality gap of our LP is bounded by &Ogr;(log k log log k) for general metric and 2 for the uniform metric thus matching the ratios in [20]. We also develop an algorithm based on our LP that achieves a ratio of 2 + √2 ≃ 3.414 for the truncated linear metric improving the ratio given in [15]. Our algorithm uses the fact that the integrality gap of our LP is 1 on a linear metric. We believe that our formulation has the potential to provide improved approximation algorithms for the general case and other useful special cases. Finally, our formulation admits general non-metric distance functions. This leads to a non-trivial approximation guarantee for a non-metric case that arises in practice [21], namely the truncated quadratic distance function. We note here that there are non-metric distance functions for which no bounded approximation ratio is achievable."
            },
            "slug": "Approximation-algorithms-for-the-metric-labeling-a-Chekuri-Khanna",
            "title": {
                "fragments": [],
                "text": "Approximation algorithms for the metric labeling problem via a new linear programming formulation"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "A natural integer programming formulation is introduced and it is shown that the integrality gap of its linear relaxation either matches or improves the ratios known for several cases of the metric labeling problem studied until now, providing a unified approach to solving them."
            },
            "venue": {
                "fragments": [],
                "text": "SODA '01"
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1922280"
                        ],
                        "name": "O. Veksler",
                        "slug": "O.-Veksler",
                        "structuredName": {
                            "firstName": "Olga",
                            "lastName": "Veksler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Veksler"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 89,
                                "start": 77
                            }
                        ],
                        "text": "On the other hand, a variety of combinatorial algorithms based on graph cuts [1, 8, 4, 9] have been developed which are fast but that have been interpreted only as greedy local search techniques up to now."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 118960561,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "752623161a999ceb79ee7b828b67fd4835aff5c6",
            "isKey": false,
            "numCitedBy": 294,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Energy minimization is an elegant approach to computer vision. Vision problems usually have many solutions due to uncertainties in the imaging process and ambiguities in visual interpretation. The energy function encodes the problem constraints, and its minimum gives the optimal solution. Despite numerous advantages, this approach is severely limited by the high computational cost. \nThe main contribution of my thesis lies in developing efficient combinatorial optimization algorithms for several important classes of energy functions which incorporate everywhere smooth, piecewise constant, and piecewise smooth priors. These priors assume, respectively, that the quantity to be estimated varies smoothly over its domain, consist of several pieces with constant values, or consist of several pieces with smoothly varying values. The algorithms rely on graph cuts as a powerful optimization technique. \nFor a certain everywhere smooth prior we develop an algorithm which finds the exact minimum by computing a single graph cut. This method is most suitable to estimate quantities without discontinuities. But even when discontinuities exist, the method produces good results in certain cases. The running time is low order polynomial. \nFor several wide classes of piecewise smooth priors we develop two approximation algorithms (we show that exact minimization in NP-hard in these cases). These algorithms produce a local minimum in interesting large move spaces. Furthermore, one of them finds a solution within a known factor from the optimum. The algorithms are iterative and compute several graph cuts at each iteration. The running time at each iteration is effectively linear due to the special graph structure. In practice it takes just a few iterations to converge. Moreover most of the progress happens during the first iteration. \nFor a certain piecewise constant prior we adapt the algorithms developed for the piecewise smooth prior. One of them finds a solution within a factor of two from the optimum. In addition we develop a third algorithm which finds a local minimum in yet another move space. \nWe demonstrate the effectiveness of our approach on image restoration, stereo, and motion. For the data with ground truth, our methods significantly outperform standard methods."
            },
            "slug": "Efficient-Graph-Based-Energy-Minimization-Methods-Veksler",
            "title": {
                "fragments": [],
                "text": "Efficient Graph-Based Energy Minimization Methods in Computer Vision"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This thesis develops efficient combinatorial optimization algorithms for several important classes of energy functions which incorporate everywhere smooth, piecewise constant, and piecewise smooth priors, and demonstrates the effectiveness of the approach on image restoration, stereo, and motion."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1720384"
                        ],
                        "name": "V. Vazirani",
                        "slug": "V.-Vazirani",
                        "structuredName": {
                            "firstName": "Vijay",
                            "lastName": "Vazirani",
                            "middleNames": [
                                "V."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Vazirani"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 104,
                                "start": 101
                            }
                        ],
                        "text": "turning an infeasible dual solution into a feasible one by division) is also known as “dual-fitting” [7] in the linear programming literature."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 92,
                                "start": 89
                            }
                        ],
                        "text": "A primal-dual f -approximation algorithm achieves that by use of the following principle [7]:"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 123,
                                "start": 120
                            }
                        ],
                        "text": "To this end we made use of the following property: Given the pair of primal-dual programs in section 2, it can be shown [7] that any ratio r = c x/b y (where x, y is a pair of integral-primal, dual feasible solutions) provides a suboptimality bound in the sense that x is guaranteed to be an r-approximation to the optimal integral solution."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 162,
                                "start": 159
                            }
                        ],
                        "text": "Finally, it should be noted that for certain special cases of the ML problem our algorithms’ approximation factors coincide with the so-called integrality gap [7] which is essentially the best possible approximation factor a primal-dual algorithm may achieve."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 834161,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "112e14d8f5d9e9b1cd99ae862cefc085566fb580",
            "isKey": true,
            "numCitedBy": 3976,
            "numCiting": 71,
            "paperAbstract": {
                "fragments": [],
                "text": "Covering the basic techniques used in the latest research work, the author consolidates progress made so far, including some very recent and promising results, and conveys the beauty and excitement of work in the field. He gives clear, lucid explanations of key results and ideas, with intuitive proofs, and provides critical examples and numerous illustrations to help elucidate the algorithms. Many of the results presented have been simplified and new insights provided. Of interest to theoretical computer scientists, operations researchers, and discrete mathematicians."
            },
            "slug": "Approximation-Algorithms-Vazirani",
            "title": {
                "fragments": [],
                "text": "Approximation Algorithms"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Covering the basic techniques used in the latest research work, the author consolidates progress made so far, including some very recent and promising results, and conveys the beauty and excitement of work in the field."
            },
            "venue": {
                "fragments": [],
                "text": "Springer Berlin Heidelberg"
            },
            "year": 2003
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 39,
                                "start": 36
                            }
                        ],
                        "text": "3) α-expansion graph cut techniques [1] are included merely as a special case of our framework."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 29,
                                "start": 26
                            }
                        ],
                        "text": "The a-b swap algorithm in [1] can get stuck in labeling A whose cost is T i."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 89,
                                "start": 77
                            }
                        ],
                        "text": "On the other hand, a variety of combinatorial algorithms based on graph cuts [1, 8, 4, 9] have been developed which are fast but that have been interpreted only as greedy local search techniques up to now."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 105,
                                "start": 102
                            }
                        ],
                        "text": "In addition it can be shown that PD2μ=1 is actually equivalent to the c-expansion graph cut algorithm [1] (that was interpreted only as a greedy local search technique up to now)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 45232003,
            "fieldsOfStudy": [],
            "id": "a57520b68e73b5e1fc3668b443daf74ebe957cc7",
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Fast Approximate Energy Minimization via Graph Cuts"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144653004"
                        ],
                        "name": "V. Kolmogorov",
                        "slug": "V.-Kolmogorov",
                        "structuredName": {
                            "firstName": "Vladimir",
                            "lastName": "Kolmogorov",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Kolmogorov"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "104192849"
                        ],
                        "name": "R. Zabin",
                        "slug": "R.-Zabin",
                        "structuredName": {
                            "firstName": "Rawaa",
                            "lastName": "Zabin",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Zabin"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 89,
                                "start": 77
                            }
                        ],
                        "text": "On the other hand, a variety of combinatorial algorithms based on graph cuts [1, 8, 4, 9] have been developed which are fast but that have been interpreted only as greedy local search techniques up to now."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 53303132,
            "fieldsOfStudy": [
                "Computer Science",
                "Mathematics"
            ],
            "id": "6a1876f699838d79c184b7a2349f927c6f5ec99e",
            "isKey": false,
            "numCitedBy": 2088,
            "numCiting": 54,
            "paperAbstract": {
                "fragments": [],
                "text": "In the last few years, several new algorithms based on graph cuts have been developed to solve energy minimization problems in computer vision. Each of these techniques constructs a graph such that the minimum cut on the graph also minimizes the energy. Yet, because these graph constructions are complex and highly specific to a particular energy function, graph cuts have seen limited application to date. In this paper, we give a characterization of the energy functions that can be minimized by graph cuts. Our results are restricted to functions of binary variables. However, our work generalizes many previous constructions and is easily applicable to vision problems that involve large numbers of labels, such as stereo, motion, image restoration, and scene reconstruction. We give a precise characterization of what energy functions can be minimized using graph cuts, among the energy functions that can be written as a sum of terms containing three or fewer binary variables. We also provide a general-purpose construction to minimize such an energy function. Finally, we give a necessary condition for any energy function of binary variables to be minimized by graph cuts. Researchers who are considering the use of graph cuts to optimize a particular energy function can use our results to determine if this is possible and then follow our construction to create the appropriate graph. A software implementation is freely available."
            },
            "slug": "What-energy-functions-can-be-minimized-via-graph-Kolmogorov-Zabin",
            "title": {
                "fragments": [],
                "text": "What energy functions can be minimized via graph cuts"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "This work gives a precise characterization of what energy functions can be minimized using graph cuts, among the energy functions that can be written as a sum of terms containing three or fewer binary variables."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2004
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Proceedings of the Tenth IEEE International Conference on Computer Vision"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Tenth IEEE International Conference on Computer Vision"
            }
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 5,
            "methodology": 3,
            "result": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 7,
        "totalPages": 1
    },
    "page_url": "https://www.semanticscholar.org/paper/A-new-framework-for-approximate-labeling-via-graph-Komodakis-Tziritas/81c1bcb85b20b1a883c4758496b1b1509000bf01?sort=total-citations"
}