{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1695689"
                        ],
                        "name": "Geoffrey E. Hinton",
                        "slug": "Geoffrey-E.-Hinton",
                        "structuredName": {
                            "firstName": "Geoffrey",
                            "lastName": "Hinton",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Geoffrey E. Hinton"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145715698"
                        ],
                        "name": "Christopher K. I. Williams",
                        "slug": "Christopher-K.-I.-Williams",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Williams",
                            "middleNames": [
                                "K.",
                                "I."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Christopher K. I. Williams"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 125432121,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1335b3997c95c7543691770651564c91e2517673",
            "isKey": false,
            "numCitedBy": 20,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "In this thesis I develop a method for recognizing isolated handprinted digits using trainable deformable models. Each digit is modelled by a cubic B-spline whose basic shape is defined by the \"home\" positions of the control points. A Gaussian distribution over displacements of the control points away from their home locations defines a probability distribution over shapes. The quality of the match of a spline model to an image is calculated as the likelihood of the data under a mixture of Gaussian \"ink generators\" placed along the length of the spline. Each spline model is adjusted to minimize an energy function that includes both the deformation energy of the model and the likelihood of the data, using a elastic matching procedure which is a generalization of the Expectation Maximization (EM) algorithm. I show that the matching procedure can be significantly speeded up by using a neural net to provide better starting points for the search. \nThe use of deformable models has a number of advantages. (1) After identifying the model most likely to have generated the data, the system not only produces a classification of the digit but also a rich description of the instantiation parameters. I have shown that these can be used to detect writing style consistency within a string of digits. (2) During the process of explaining the image, generative models can perform recognition-driven segmentation. (3) Unlike many other recognition schemes the method does not rely on some form of pre-normalization of input images, but can handle arbitrary scalings, translations and a limited degree of image rotation. The main disadvantage of the method is it requires much more computation than more standard optical character recognition techniques."
            },
            "slug": "Combining-deformable-models-and-neural-networks-for-Hinton-Williams",
            "title": {
                "fragments": [],
                "text": "Combining deformable models and neural networks for handprinted digit recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 58,
                "text": "A method for recognizing isolated handprinted digits using trainable deformable models that can handle arbitrary scalings, translations and a limited degree of image rotation and can be significantly speeded up by using a neural net to provide better starting points for the search."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145715698"
                        ],
                        "name": "Christopher K. I. Williams",
                        "slug": "Christopher-K.-I.-Williams",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Williams",
                            "middleNames": [
                                "K.",
                                "I."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Christopher K. I. Williams"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2713302"
                        ],
                        "name": "M. Revow",
                        "slug": "M.-Revow",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Revow",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Revow"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1695689"
                        ],
                        "name": "Geoffrey E. Hinton",
                        "slug": "Geoffrey-E.-Hinton",
                        "structuredName": {
                            "firstName": "Geoffrey",
                            "lastName": "Hinton",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Geoffrey E. Hinton"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 79,
                                "start": 75
                            }
                        ],
                        "text": "Another possibility is to model the residual images using \\ ourish models\" [46]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 57852830,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bbf4924123e798f32c028d184dd8ee051bef55a3",
            "isKey": false,
            "numCitedBy": 13,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "Deformable models are an attractive way for characterizing handwritten digits since they have relatively few parameters, are able to capture many topological variations, and incorporate much prior knowledge. We have described a system [8] that uses learned digit models consisting of splines whose shape is governed by a small number of control points. Images can be classi ed by separately tting each digit model to the image, and using a simple neural network to decide which model ts best. We use an elastic matching algorithm to minimize an energy function that includes both the deformation energy of the digit model and the log probability that the model would generate the inked pixels in the image. The use of multiple models for each digit can characterize the population of handwritten digits better. We show how multiple models may be used without increasing the time required for elastic matching."
            },
            "slug": "Hand-printed-digit-recognition-using-deformable-Williams-Revow",
            "title": {
                "fragments": [],
                "text": "Hand-printed digit recognition using deformable models"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "This work uses an elastic matching algorithm to minimize an energy function that includes both the deformation energy of the digit model and the log probability that the model would generate the inked pixels in the image."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1695689"
                        ],
                        "name": "Geoffrey E. Hinton",
                        "slug": "Geoffrey-E.-Hinton",
                        "structuredName": {
                            "firstName": "Geoffrey",
                            "lastName": "Hinton",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Geoffrey E. Hinton"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145715698"
                        ],
                        "name": "Christopher K. I. Williams",
                        "slug": "Christopher-K.-I.-Williams",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Williams",
                            "middleNames": [
                                "K.",
                                "I."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Christopher K. I. Williams"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2713302"
                        ],
                        "name": "M. Revow",
                        "slug": "M.-Revow",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Revow",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Revow"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 201,
                                "start": 197
                            }
                        ],
                        "text": "Motivated by the success of model-based shape recognition in overcoming some of these shortcomings [18], we have investigated the use of deformable elastic models for handwritten digit recognition [19]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 15052186,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "15034107f195f625922881ef197515a7997b4c0d",
            "isKey": false,
            "numCitedBy": 123,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "Hand-printed digits can be modeled as splines that are governed by about 8 control points. For each known digit, the control points have preferred \"home\" locations, and deformations of the digit are generated by moving the control points away from their home locations. Images of digits can be produced by placing Gaussian ink generators uniformly along the spline. Real images can be recognized by finding the digit model most likely to have generated the data. For each digit model we use an elastic matching algorithm to minimize an energy function that includes both the deformation energy of the digit model and the log probability that the model would generate the inked pixels in the image. The model with the lowest total energy wins. If a uniform noise process is included in the model of image generation, some of the inked pixels can be rejected as noise as a digit model is fitting a poorly segmented image. The digit models learn by modifying the home locations of the control points."
            },
            "slug": "Adaptive-Elastic-Models-for-Hand-Printed-Character-Hinton-Williams",
            "title": {
                "fragments": [],
                "text": "Adaptive Elastic Models for Hand-Printed Character Recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "An elastic matching algorithm is used to minimize an energy function that includes both the deformation energy of the digit model and the log probability that the model would generate the inked pixels in the image."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1695689"
                        ],
                        "name": "Geoffrey E. Hinton",
                        "slug": "Geoffrey-E.-Hinton",
                        "structuredName": {
                            "firstName": "Geoffrey",
                            "lastName": "Hinton",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Geoffrey E. Hinton"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2713302"
                        ],
                        "name": "M. Revow",
                        "slug": "M.-Revow",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Revow",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Revow"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1790646"
                        ],
                        "name": "P. Dayan",
                        "slug": "P.-Dayan",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Dayan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Dayan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 97,
                                "start": 93
                            }
                        ],
                        "text": "While its classi cation performance is comparable to other state-of-the-art classi ers [10], [50] it is signi cantly more computationally intensive."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 1785727,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9dea20c1e5bbb1f543ff08113ffde5380c679f1f",
            "isKey": false,
            "numCitedBy": 129,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "We construct a mixture of locally linear generative models of a collection of pixel-based images of digits, and use them for recognition. Different models of a given digit are used to capture different styles of writing, and new images are classified by evaluating their log-likelihoods under each model. We use an EM-based algorithm in which the M-step is computationally straightforward principal components analysis (PCA). Incorporating tangent-plane information [12] about expected local deformations only requires adding tangent vectors into the sample covariance matrices for the PCA, and it demonstrably improves performance."
            },
            "slug": "Recognizing-Handwritten-Digits-Using-Mixtures-of-Hinton-Revow",
            "title": {
                "fragments": [],
                "text": "Recognizing Handwritten Digits Using Mixtures of Linear Models"
            },
            "tldr": {
                "abstractSimilarityScore": 38,
                "text": "An EM-based algorithm in which the M-step is computationally straightforward principal components analysis (PCA), and incorporating tangent-plane information about expected local deformations only requires adding tangent vectors into the sample covariance matrices for the PCA, and it demonstrably improves performance."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3026607"
                        ],
                        "name": "J. Bertille",
                        "slug": "J.-Bertille",
                        "structuredName": {
                            "firstName": "Jean-Michel",
                            "lastName": "Bertille",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Bertille"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 122,
                                "start": 118
                            }
                        ],
                        "text": "It is lost (as pointed out in [36]) when models based more directly on Durbin and Willshaw's elastic net are employed [37]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 9375561,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "dfc65b0a3a162cb55ab83bfd5c4cee9f7c87cd12",
            "isKey": false,
            "numCitedBy": 8,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "The usual methods for digit recognition on handwritten mail addresses are either structural or statistical. The structural ones operate by expert rule application. When the extraction process of such rules is done by hand, these approaches are generally difficult to design. The statistical methods use degenerated image descriptions of the digit which consist mainly of feature vectors. The decision zone learning in the corresponding vectorial space allows vector clusterization. In such techniques, the system recognition result is directly related to the chosen measure of vector relevance. This choice is difficult and no completely satisfactory solution exists in this domain. In order to overcome the drawbacks of these methods, the author has evaluated an elastic matching algorithm. This approach models and quantifies the distortions undergone by the digit to be recognized as compared with the theoretical and ideal pattern. Consequently, there is neither obligation of a decision rule elaboration nor a need for feature vector design. The author describes the principles of the elastic matching algorithm and analyzes its performance when run on a reference set.<<ETX>>"
            },
            "slug": "An-elastic-matching-approach-applied-to-digit-Bertille",
            "title": {
                "fragments": [],
                "text": "An elastic matching approach applied to digit recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "An elastic matching algorithm is evaluated that models and quantifies the distortions undergone by the digit to be recognized as compared with the theoretical and ideal pattern and has neither obligation of a decision rule elaboration nor a need for feature vector design."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 2nd International Conference on Document Analysis and Recognition (ICDAR '93)"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "120242409"
                        ],
                        "name": "J. Bromley",
                        "slug": "J.-Bromley",
                        "structuredName": {
                            "firstName": "Jane",
                            "lastName": "Bromley",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Bromley"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1747317"
                        ],
                        "name": "J. Denker",
                        "slug": "J.-Denker",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Denker",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Denker"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 73,
                                "start": 69
                            }
                        ],
                        "text": "This can be ameliorated by training the system to reject junk images [17], but it is hard to get a good sample of rare types of junk."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 5783336,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "694b5a7aa81d727e8a4e5be54aeae0e71ee508a9",
            "isKey": false,
            "numCitedBy": 31,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "Very good performance for the classification of handwritten digits has been achieved using feedforward backpropagation networks (LeCun et al. 1990; Martin and Pittman 1990). These initial networks were trained and tested on clean, well-segmented images. In the real world, however, images are rarely perfect, which causes problems. For example, at one time one of our best performing digit classifiers interpreted a horizontal bar as a 2; in this example the most useful response would be to reject the image as unclassifiable. The aim of the work reported here was to train a network to reject the type of unclassifiable images (“rubbish”) typically produced by an automatic segmenter for strings of digits (e.g., zip codes), while maintaining its performance level at classifying digits, by adding images of rubbish to the training set."
            },
            "slug": "Improving-Rejection-Performance-on-Handwritten-by-Bromley-Denker",
            "title": {
                "fragments": [],
                "text": "Improving Rejection Performance on Handwritten Digits by Training with Rubbish"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "The aim of the work reported here was to train a network to reject the type of unclassifiable images typically produced by an automatic segmenter for strings of digits while maintaining its performance level at classifying digits, by adding images of rubbish to the training set."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1952587"
                        ],
                        "name": "J. Keeler",
                        "slug": "J.-Keeler",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Keeler",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Keeler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2681887"
                        ],
                        "name": "D. Rumelhart",
                        "slug": "D.-Rumelhart",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Rumelhart",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Rumelhart"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1787377"
                        ],
                        "name": "W. Leow",
                        "slug": "W.-Leow",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Leow",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Leow"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 127,
                                "start": 124
                            }
                        ],
                        "text": "We would expect this type of network to be less susceptible to over tting than conventional neural network recognizers [8], [9], [45]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 47,
                                "start": 44
                            }
                        ],
                        "text": "More recently there have been a number [8], [9], [10] of successful attempts to automatically learn appropriate local features using feedforward neural networks."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 894091,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "847d6ece37d22430a0d9e061b5dc1d1b8c679055",
            "isKey": false,
            "numCitedBy": 159,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "Neural network algorithms have proven useful for recognition of individual, segmented characters. However, their recognition accuracy has been limited by the accuracy of the underlying segmentation algorithm. Conventional, rule-based segmentation algorithms encounter difficulty if the characters are touching, broken, or noisy. The problem in these situations is that often one cannot properly segment a character until it is recognized yet one cannot properly recognize a character until it is segmented. We present here a neural network algorithm that simultaneously segments and recognizes in an integrated system. This algorithm has several novel features: it uses a supervised learning algorithm (backpropagation), but is able to take position-independent information as targets and self-organize the activities of the units in a competitive fashion to infer the positional information. We demonstrate this ability with overlapping handprinted numerals."
            },
            "slug": "Integrated-Segmentation-and-Recognition-of-Numerals-Keeler-Rumelhart",
            "title": {
                "fragments": [],
                "text": "Integrated Segmentation and Recognition of Hand-Printed Numerals"
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "A neural network algorithm that simultaneously segments and recognizes in an integrated system that uses a supervised learning algorithm (backpropagation), but is able to take position-independent information as targets and self-organize the activities of the units in a competitive fashion to infer the positional information."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1713795"
                        ],
                        "name": "C. Suen",
                        "slug": "C.-Suen",
                        "structuredName": {
                            "firstName": "Ching",
                            "lastName": "Suen",
                            "middleNames": [
                                "Yee"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Suen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1717110"
                        ],
                        "name": "C. Nadal",
                        "slug": "C.-Nadal",
                        "structuredName": {
                            "firstName": "Christine",
                            "lastName": "Nadal",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Nadal"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49691013"
                        ],
                        "name": "R. Legault",
                        "slug": "R.-Legault",
                        "structuredName": {
                            "firstName": "Raymond",
                            "lastName": "Legault",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Legault"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47184210"
                        ],
                        "name": "T. Mai",
                        "slug": "T.-Mai",
                        "structuredName": {
                            "firstName": "Tuan",
                            "lastName": "Mai",
                            "middleNames": [
                                "Anh"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Mai"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144905110"
                        ],
                        "name": "L. Lam",
                        "slug": "L.-Lam",
                        "structuredName": {
                            "firstName": "Louisa",
                            "lastName": "Lam",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Lam"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 26,
                                "start": 23
                            }
                        ],
                        "text": "Some researchers [11], [4], [12] have boosted performance using combinations of classi ers."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 194,
                                "start": 191
                            }
                        ],
                        "text": "Review of past work We will not attempt to review here the voluminous work on optical character recognition that has spanned more than three decades (useful reviews can be found in [2], [3], [4])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 62684858,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "08ce01a35cf8af38ee24a9a0f549f7d4d16e55bf",
            "isKey": false,
            "numCitedBy": 347,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "Four independently, developed expert algorithms for recognizing unconstrained handwritten numerals are presented. All have high recognition rates. Different experimental approaches for incorporating these recognition methods into a more powerful system are also presented. The resulting multiple-expert system proves that the consensus of these methods tends to compensate for individual weaknesses, while preserving individual strengths. It is shown that it is possible to reduce the substitution rate to a desired level while maintaining a fairly high recognition rate in the classification of totally unconstrained handwritten ZIP code numerals. If reliability is of the utmost importance, substitutions can be avoided completely (reliability=100%) while retaining a recognition rate above 90%. Results are compared with those for some of the most effective numeral recognition systems found in the literature. >"
            },
            "slug": "Computer-recognition-of-unconstrained-handwritten-Suen-Nadal",
            "title": {
                "fragments": [],
                "text": "Computer recognition of unconstrained handwritten numerals"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "It is shown that it is possible to reduce the substitution rate to a desired level while maintaining a fairly high recognition rate in the classification of totally unconstrained handwritten ZIP code numerals."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2676309"
                        ],
                        "name": "C. Burges",
                        "slug": "C.-Burges",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Burges",
                            "middleNames": [
                                "J.",
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Burges"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3145585"
                        ],
                        "name": "O. Matan",
                        "slug": "O.-Matan",
                        "structuredName": {
                            "firstName": "Ofer",
                            "lastName": "Matan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Matan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "116525682"
                        ],
                        "name": "Y. Le Cun",
                        "slug": "Y.-Le-Cun",
                        "structuredName": {
                            "firstName": "Y.",
                            "lastName": "Le Cun",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Le Cun"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1747317"
                        ],
                        "name": "J. Denker",
                        "slug": "J.-Denker",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Denker",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Denker"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2041866"
                        ],
                        "name": "L. Jackel",
                        "slug": "L.-Jackel",
                        "structuredName": {
                            "firstName": "Lawrence",
                            "lastName": "Jackel",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Jackel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326170"
                        ],
                        "name": "C. E. Stenard",
                        "slug": "C.-E.-Stenard",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Stenard",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. E. Stenard"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2975061"
                        ],
                        "name": "C. Nohl",
                        "slug": "C.-Nohl",
                        "structuredName": {
                            "firstName": "Craig",
                            "lastName": "Nohl",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Nohl"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144050629"
                        ],
                        "name": "J. Ben",
                        "slug": "J.-Ben",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Ben",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Ben"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 26,
                                "start": 22
                            }
                        ],
                        "text": "So a system typically [15] tries many candidate segmentations and all the recognizer can indicate is whether a particular segmentation leads to con dent recognition."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 61729936,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "32315b101afe9bacb725cf80944884e7ac053245",
            "isKey": false,
            "numCitedBy": 50,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "The authors describe a method which combines dynamic programming and a neural network recognizer for segmenting and recognizing character strings. The method selects the optimal consistent combination of cuts from a set of candidate cuts generated using heuristics. The optimal segmentation is found by representing the image, the candidate segments, and their scores as a graph in which the shortest path corresponds to the optimal interpretation. The scores are given by neural net outputs for each segment. A significant advantage of the method is that the labor required to segment images manually is eliminated. The system was trained on approximately 7000 unsegmented handwritten zip codes provided by the United States Postal Service. The system has achieved a per-zip-code raw recognition rate of 81% on a 2368 handwritten zip-code test set.<<ETX>>"
            },
            "slug": "Shortest-path-segmentation:-a-method-for-training-a-Burges-Matan",
            "title": {
                "fragments": [],
                "text": "Shortest path segmentation: a method for training a neural network to recognize character strings"
            },
            "tldr": {
                "abstractSimilarityScore": 72,
                "text": "A method which combines dynamic programming and a neural network recognizer for segmenting and recognizing character strings and has achieved a per-zip-code raw recognition rate of 81% on a 2368 handwritten zip-code test set."
            },
            "venue": {
                "fragments": [],
                "text": "[Proceedings 1992] IJCNN International Joint Conference on Neural Networks"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35091394"
                        ],
                        "name": "Yuchun Lee",
                        "slug": "Yuchun-Lee",
                        "structuredName": {
                            "firstName": "Yuchun",
                            "lastName": "Lee",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yuchun Lee"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 115,
                                "start": 111
                            }
                        ],
                        "text": "Statistical recognizers can occasionally con dently classify images that do not look anything like a character [16]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 44713185,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9697881f7c675bfe719c0b2e23ffb6be38ddd754",
            "isKey": false,
            "numCitedBy": 187,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "Results of recent research suggest that carefully designed multilayer neural networks with local receptive fields and shared weights may be unique in providing low error rates on handwritten digit recognition tasks. This study, however, demonstrates that these networks, radial basis function (RBF) networks, and k nearest-neighbor (kNN) classifiers, all provide similar low error rates on a large handwritten digit database. The backpropagation network is overall superior in memory usage and classification time but can provide false positive classifications when the input is not a digit. The backpropagation network also has the longest training time. The RBF classifier requires more memory and more classification time, but less training time. When high accuracy is warranted, the RBF classifier can generate a more effective confidence judgment for rejecting ambiguous inputs. The simple kNN classifier can also perform handwritten digit recognition, but requires a prohibitively large amount of memory and is much slower at classification. Nevertheless, the simplicity of the algorithm and fast training characteristics makes the kNN classifier an attractive candidate in hardware-assisted classification tasks. These results on a large, high input dimensional problem demonstrate that practical constraints including training time, memory usage, and classification time often constrain classifier selection more strongly than small differences in overall error rate."
            },
            "slug": "Handwritten-Digit-Recognition-Using-K-Radial-Basis-Lee",
            "title": {
                "fragments": [],
                "text": "Handwritten Digit Recognition Using K Nearest-Neighbor, Radial-Basis Function, and Backpropagation Neural Networks"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "These results on a large, high input dimensional problem demonstrate that practical constraints including training time, memory usage, and classification time often constrain classifier selection more strongly than small differences in overall error rate."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1694191"
                        ],
                        "name": "J. Hull",
                        "slug": "J.-Hull",
                        "structuredName": {
                            "firstName": "Jonathan",
                            "lastName": "Hull",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Hull"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 217,
                                "start": 213
                            }
                        ],
                        "text": "Results on isolated digits The performance of the elastic net in recognizing isolated digits has been tested on data from the CEDAR CDROM 1 database of Cities, States, ZIP Codes, Digits, and Alphabetic Characters [44]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 115,
                                "start": 111
                            }
                        ],
                        "text": "It is interesting to note that br training data were segmented with the same diligence as the goodbs test data [44]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 8148915,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "62a134740314b4469c83c8921ae2e1beea22b8f5",
            "isKey": false,
            "numCitedBy": 1725,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "An image database for handwritten text recognition research is described. Digital images of approximately 5000 city names, 5000 state names, 10000 ZIP Codes, and 50000 alphanumeric characters are included. Each image was scanned from mail in a working post office at 300 pixels/in in 8-bit gray scale on a high-quality flat bed digitizer. The data were unconstrained for the writer, style, and method of preparation. These characteristics help overcome the limitations of earlier databases that contained only isolated characters or were prepared in a laboratory setting under prescribed circumstances. Also, the database is divided into explicit training and testing sets to facilitate the sharing of results among researchers as well as performance comparisons. >"
            },
            "slug": "A-Database-for-Handwritten-Text-Recognition-Hull",
            "title": {
                "fragments": [],
                "text": "A Database for Handwritten Text Recognition Research"
            },
            "tldr": {
                "abstractSimilarityScore": 81,
                "text": "An image database for handwritten text recognition research is described that contains digital images of approximately 5000 city names, 5000 state names, 10000 ZIP Codes, and 50000 alphanumeric characters to overcome the limitations of earlier databases."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2812486"
                        ],
                        "name": "P. Simard",
                        "slug": "P.-Simard",
                        "structuredName": {
                            "firstName": "Patrice",
                            "lastName": "Simard",
                            "middleNames": [
                                "Y."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Simard"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1688882"
                        ],
                        "name": "Yann LeCun",
                        "slug": "Yann-LeCun",
                        "structuredName": {
                            "firstName": "Yann",
                            "lastName": "LeCun",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yann LeCun"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1747317"
                        ],
                        "name": "J. Denker",
                        "slug": "J.-Denker",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Denker",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Denker"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11382731,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8314dda1ec43ce57ff877f8f02ed89acb68ca035",
            "isKey": false,
            "numCitedBy": 581,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "Memory-based classification algorithms such as radial basis functions or K-nearest neighbors typically rely on simple distances (Euclidean, dot product...), which are not particularly meaningful on pattern vectors. More complex, better suited distance measures are often expensive and rather ad-hoc (elastic matching, deformable templates). We propose a new distance measure which (a) can be made locally invariant to any set of transformations of the input and (b) can be computed efficiently. We tested the method on large handwritten character databases provided by the Post Office and the NIST. Using invariances with respect to translation, rotation, scaling, shearing and line thickness, the method consistently outperformed all other systems tested on the same databases."
            },
            "slug": "Efficient-Pattern-Recognition-Using-a-New-Distance-Simard-LeCun",
            "title": {
                "fragments": [],
                "text": "Efficient Pattern Recognition Using a New Transformation Distance"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "A new distance measure which can be made locally invariant to any set of transformations of the input and can be computed efficiently is proposed."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144905110"
                        ],
                        "name": "L. Lam",
                        "slug": "L.-Lam",
                        "structuredName": {
                            "firstName": "Louisa",
                            "lastName": "Lam",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Lam"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1713795"
                        ],
                        "name": "C. Suen",
                        "slug": "C.-Suen",
                        "structuredName": {
                            "firstName": "Ching",
                            "lastName": "Suen",
                            "middleNames": [
                                "Yee"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Suen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 7,
                                "start": 3
                            }
                        ],
                        "text": "Y. Suen, C. Nadal, R. Legault, T. A. Mai, and L. Lam, \\Computer recognition of uncon-strained handwritten numerals.\""
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 25,
                                "start": 21
                            }
                        ],
                        "text": "[6] L. Lam and C. Y. Suen, \\Structural classi cation and relaxation matching of totally un-constrained handwritten zip-code numbers\", Pattern Recognition, vol. 21, no. 1, pp. 19{31,1988."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 14,
                                "start": 10
                            }
                        ],
                        "text": "[2] C. Y. Suen, \\Automatic recognition of handprinted characters - the state of the art\", Pro-ceedings of the IEEE, vol. 68, no. 4, pp. 469{487, 1980."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 52,
                                "start": 40
                            }
                        ],
                        "text": "On the otherhand the recognizer used by Lam and Suen [6] uses local features."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 57,
                                "start": 54
                            }
                        ],
                        "text": "On the other hand the recognizer used by Lam and Suen [6] uses local features."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 43831110,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6f02e347101079709113b2f2d91496e6d22b00cf",
            "isKey": true,
            "numCitedBy": 153,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Structural-classification-and-relaxation-matching-Lam-Suen",
            "title": {
                "fragments": [],
                "text": "Structural classification and relaxation matching of totally unconstrained handwritten zip-code numbers"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit."
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2835432"
                        ],
                        "name": "G. Cash",
                        "slug": "G.-Cash",
                        "structuredName": {
                            "firstName": "Glenn",
                            "lastName": "Cash",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Cash"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "14915648"
                        ],
                        "name": "M. Hatamian",
                        "slug": "M.-Hatamian",
                        "structuredName": {
                            "firstName": "Mehdi",
                            "lastName": "Hatamian",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Hatamian"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 52,
                                "start": 49
                            }
                        ],
                        "text": "As an example of a global, statistical approach, [5] extracts 8 central and 2 raw moments as features."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 123043060,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b18c68425157ac4533b15ecd98115e8bcdbc264d",
            "isKey": false,
            "numCitedBy": 157,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Optical-character-recognition-by-the-method-of-Cash-Hatamian",
            "title": {
                "fragments": [],
                "text": "Optical character recognition by the method of moments"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2862374"
                        ],
                        "name": "U. Grenander",
                        "slug": "U.-Grenander",
                        "structuredName": {
                            "firstName": "Ulf",
                            "lastName": "Grenander",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "U. Grenander"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2661433"
                        ],
                        "name": "Yunshyong Chow",
                        "slug": "Yunshyong-Chow",
                        "structuredName": {
                            "firstName": "Yunshyong",
                            "lastName": "Chow",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yunshyong Chow"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1963249"
                        ],
                        "name": "D. M. Keenan",
                        "slug": "D.-M.-Keenan",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Keenan",
                            "middleNames": [
                                "Macrae"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. M. Keenan"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 22,
                                "start": 18
                            }
                        ],
                        "text": "Following [1] and [33] we de ne the deformation energy, Edef , to be the negative log probability of the deformation."
                    },
                    "intents": []
                }
            ],
            "corpusId": 195592621,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ac891dff9effb37aeb5800406addc8f71f86b0b6",
            "isKey": false,
            "numCitedBy": 407,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "The text develops a global shape model and applies it to the analysis of real pictures acquired with a visible light camera under varying conditions of optical degradation. Computational feasibility of the algorithms derived from this model is achieved by analytical means. The aim is to develop methods for image understanding based on structured restoration, for example automatic detection of abnormalities. The limits of applicability of the algorithms are also traced by making the optical degradations more and more severe until the algorithms no longer succeed in their task. This book is suitable for an advanced undergraduate or graduate seminar in pattern theory, or as an accompanying book for applied probability, computer vision or pattern recognition."
            },
            "slug": "Hands:-A-Pattern-Theoretic-Study-of-Biological-Grenander-Chow",
            "title": {
                "fragments": [],
                "text": "Hands: A Pattern Theoretic Study of Biological Shapes"
            },
            "tldr": {
                "abstractSimilarityScore": 73,
                "text": "The text develops a global shape model and applies it to the analysis of real pictures acquired with a visible light camera under varying conditions of optical degradation to develop methods for image understanding based on structured restoration, for example automatic detection of abnormalities."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145809751"
                        ],
                        "name": "F. Kimura",
                        "slug": "F.-Kimura",
                        "structuredName": {
                            "firstName": "Fumitaka",
                            "lastName": "Kimura",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Kimura"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145492601"
                        ],
                        "name": "M. Shridhar",
                        "slug": "M.-Shridhar",
                        "structuredName": {
                            "firstName": "Malayappan",
                            "lastName": "Shridhar",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Shridhar"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 32,
                                "start": 28
                            }
                        ],
                        "text": "Some researchers [11], [4], [12] have boosted performance using combinations of classi ers."
                    },
                    "intents": []
                }
            ],
            "corpusId": 17743186,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "541cb51275e57bb93050862875597ee1ed037954",
            "isKey": false,
            "numCitedBy": 307,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Handwritten-numerical-recognition-based-on-multiple-Kimura-Shridhar",
            "title": {
                "fragments": [],
                "text": "Handwritten numerical recognition based on multiple algorithms"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit."
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1802201"
                        ],
                        "name": "S. Impedovo",
                        "slug": "S.-Impedovo",
                        "structuredName": {
                            "firstName": "Sebastiano",
                            "lastName": "Impedovo",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Impedovo"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 184,
                                "start": 181
                            }
                        ],
                        "text": "Review of past work We will not attempt to review here the voluminous work on optical character recognition that has spanned more than three decades (useful reviews can be found in [2], [3])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 43373638,
            "fieldsOfStudy": [
                "Computer Science",
                "Psychology"
            ],
            "id": "f62e56ccb91da4f9b694850cd65bcc2f1f45b111",
            "isKey": false,
            "numCitedBy": 56,
            "numCiting": 77,
            "paperAbstract": {
                "fragments": [],
                "text": "1: Introduction and overview of field.- Frontiers in handwriting recognition.- 2: Handwritten character recognition.- Historical review of theory and practice of handwritten character recognition.- Automatic recognition of handwritten characters.- Learning, representation, understanding and recognition of characters and words - an intelligent approach.- Digital transforms in handwriting recognition.- Pattern recognition with optimal margin classifiers.- 3: Handwritten word recognition.- On the robustness of recognition of degraded line images.- Invariant handwriting features useful in cursive script recognition.- Off-line recognition of bad quality handwritten words using prototypes.- Handwriting recognition by statistical methods.- Towards a visual recognition of cursive script.- A hierarchical handwritten word segmentation.- 4: Contextual methods in handwriting recognition.- Cursive words recognition: methods and strategies.- Hidden Markov models in handwriting recognition.- Language-level syntactic and semantic constraints applied to visual word recognition.- Verification of handwritten British postcodes using address features.- Improvement of OCR by language model.- An approximate string matching method for handwriting recognition post-processing using a dictionary.- 5: Neural networks in handwriting recognition.- Neural-net computing for machine recognition of handwritten English language text.- Cooperation of feedforward neural networks for handwritten digit recognition.- Normalisation and preprocessing for a recurrent network off-line handwriting recognition system.- 6: Architectures for handwriting.- Architectures for handwriting recognition.- 7: Databases for handwriting recognition.- Large database organization for document images.- 8: Signature recognition and verification.- A model-based dynamic signature verification system.- Algorithms for signature verification.- Handwritten signature verification: a global approach.- 9: Application of handwriting recognition.- Total approach for practical character recognition system development.- A pen-based music editor."
            },
            "slug": "Fundamentals-in-Handwriting-Recognition-Impedovo",
            "title": {
                "fragments": [],
                "text": "Fundamentals in Handwriting Recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "This paper presents a meta-modelling approach for practical character recognition system development using a pen-based music editor and a model-based dynamic signature verification system."
            },
            "venue": {
                "fragments": [],
                "text": "NATO ASI Series"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145081362"
                        ],
                        "name": "A. Yuille",
                        "slug": "A.-Yuille",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Yuille",
                            "middleNames": [
                                "Loddon"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Yuille"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 69,
                                "start": 63
                            }
                        ],
                        "text": "The facial featuremodel example they used has been extended by Yuille [30], who constructs a more detaileddescriptions of the feature shapes and global matching criteria in terms of peak, valley andedge intensities."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 17,
                                "start": 11
                            }
                        ],
                        "text": "[30] A. L. Yuille, \\Deformable templates for face recognition\", Journal of Cognitive Neuroscience,vol. 3(1), pp. 59{70, 1991.34\n[31] M. Kass, A. Witkin, and D. Terzopoulos, \\Snakes: Active contour models\", in Proceedingsof the First International Conference on Computer Vision, Washington, D. C., 1987, IEEEComputer Society Press."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 118,
                                "start": 114
                            }
                        ],
                        "text": "Their matching procedure works on a coarse scale, but it is scale dependent and degrades in the presence of noise [30]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 75,
                                "start": 71
                            }
                        ],
                        "text": "The facial feature model example they used has been extended by Yuille [30], who constructs a more detailed descriptions of the feature shapes and global matching criteria in terms of peak, valley and edge intensities."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 54,
                                "start": 48
                            }
                        ],
                        "text": "References[1] R. Durbin, R. Szeliski, and A. L. Yuille, \\An analysis of the elastic net approach to thetravelling salesman problem\", Neural Computation, vol. 1, pp. 348{358, 1989."
                    },
                    "intents": []
                }
            ],
            "corpusId": 16413347,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "37d46a2355a95abee6576986a460399adbebf6b9",
            "isKey": true,
            "numCitedBy": 421,
            "numCiting": 32,
            "paperAbstract": {
                "fragments": [],
                "text": "We describe an approach for extracting facial features from images and for determining the spatial organization between these features using the concept of a deformable template. This is a parameterized geometric model of the object to be recognized together with a measure of how well it fits the image data. Variations in the parameters correspond to allowable deformations of the object and can be specified by a probabilistic model. After the extraction stage the parameters of the deformable template can be used for object description and recognition."
            },
            "slug": "Deformable-Templates-for-Face-Recognition-Yuille",
            "title": {
                "fragments": [],
                "text": "Deformable Templates for Face Recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 94,
                "text": "An approach for extracting facial features from images and for determining the spatial organization between these features using the concept of a deformable template using a parameterized geometric model of the object to be recognized together with a measure of how well it fits the image data."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of Cognitive Neuroscience"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1749800"
                        ],
                        "name": "T. M. Ha",
                        "slug": "T.-M.-Ha",
                        "structuredName": {
                            "firstName": "Thien",
                            "lastName": "Ha",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. M. Ha"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1720945"
                        ],
                        "name": "H. Bunke",
                        "slug": "H.-Bunke",
                        "structuredName": {
                            "firstName": "Horst",
                            "lastName": "Bunke",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Bunke"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 26470760,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0b1348f45311e098544ac68f1904624a13180ac5",
            "isKey": false,
            "numCitedBy": 219,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents a new approach to off-line, handwritten numeral recognition. From the concept of perturbation due to writing habits and instruments, we propose a recognition method which is able to account for a variety of distortions due to eccentric handwriting. We tested our method on two worldwide standard databases of isolated numerals, namely CEDAR and NIST, and obtained 99.09 percent and 99.54 percent correct recognition rates at no-rejection level respectively. The latter result was obtained by testing on more than 170000 numerals."
            },
            "slug": "Off-Line,-Handwritten-Numeral-Recognition-by-Method-Ha-Bunke",
            "title": {
                "fragments": [],
                "text": "Off-Line, Handwritten Numeral Recognition by Perturbation Method"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "This paper proposes a recognition method which is able to account for a variety of distortions due to eccentric handwriting, and tested its method on two worldwide standard databases of isolated numerals, namely CEDAR and NIST."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2110094"
                        ],
                        "name": "J. Bridle",
                        "slug": "J.-Bridle",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Bridle",
                            "middleNames": [
                                "Scott"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Bridle"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 59636530,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1f462943c8d0af69c12a09058251848324135e5a",
            "isKey": false,
            "numCitedBy": 1100,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "We are concerned with feed-forward non-linear networks (multi-layer perceptrons, or MLPs) with multiple outputs. We wish to treat the outputs of the network as probabilities of alternatives (e.g. pattern classes), conditioned on the inputs. We look for appropriate output non-linearities and for appropriate criteria for adaptation of the parameters of the network (e.g. weights). We explain two modifications: probability scoring, which is an alternative to squared error minimisation, and a normalised exponential (softmax) multi-input generalisation of the logistic non-linearity. The two modifications together result in quite simple arithmetic, and hardware implementation is not difficult either. The use of radial units (squared distance instead of dot product) immediately before the softmax output stage produces a network which computes posterior distributions over class labels based on an assumption of Gaussian within-class distributions. However the training, which uses cross-class information, can result in better performance at class discrimination than the usual within-class training method, unless the within-class distribution assumptions are actually correct."
            },
            "slug": "Probabilistic-Interpretation-of-Feedforward-Network-Bridle",
            "title": {
                "fragments": [],
                "text": "Probabilistic Interpretation of Feedforward Classification Network Outputs, with Relationships to Statistical Pattern Recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "Two modifications are explained: probability scoring, which is an alternative to squared error minimisation, and a normalised exponential (softmax) multi-input generalisation of the logistic non- linearity of feed-forward non-linear networks with multiple outputs."
            },
            "venue": {
                "fragments": [],
                "text": "NATO Neurocomputing"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1913418"
                        ],
                        "name": "B. Widrow",
                        "slug": "B.-Widrow",
                        "structuredName": {
                            "firstName": "Bernard",
                            "lastName": "Widrow",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Widrow"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 195703395,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "15a0f30ad2efee0b1f6d7143f3b770ad774da746",
            "isKey": false,
            "numCitedBy": 78,
            "numCiting": 76,
            "paperAbstract": {
                "fragments": [],
                "text": "Template matching is a fundamental technique of pattern recognition. Although this technique is very general, its applicability has been limited because of the difficulty often encountered when fitting templates to natural data. Natural patterns are often distorted, misshapen, stretched in size, fuzzy, rotated, translated, observed at an unusual perspective, etc. Flexible templates (rubber masks) have been devised which, when fitted to natural data, can be used for measurement, data reduction, data smoothing, and classification of highly irregular waveforms and image shapes. These problems had been largely unsolved by existing template matching methods."
            },
            "slug": "The-\"Rubber-Mask\"-Technique-I.-Pattern-Measurement-Widrow",
            "title": {
                "fragments": [],
                "text": "The \"Rubber-Mask\" Technique I. Pattern Measurement and Analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "Flexible templates (rubber masks) have been devised which, when fitted to natural data, can be used for measurement, data reduction, data smoothing, and classification of highly irregular waveforms and image shapes."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32538203"
                        ],
                        "name": "P. Brown",
                        "slug": "P.-Brown",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Brown",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Brown"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 366,
                                "start": 362
                            }
                        ],
                        "text": "The maximummutual information criterion emphasizes correct discrimination rather than correct modeling of the image data, and it generally leads to better discriminative performance [40], although the advantage of discriminative learning vanishes if the generative model is correct and the tting process produces the true probability of the data given the model [41]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 60769407,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1aa31d5deb45f477a6de45b3b75b62c7f4a213e7",
            "isKey": false,
            "numCitedBy": 269,
            "numCiting": 54,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : This thesis examines the acoustic-modeling problem in automatic speech recognition from an information-theoretic point of view. This problem is to design a speech-recognition system which can extract from the speech waveform as much information as possible about the corresponding word sequence. The information extraction process is broken down into two steps: a signal processing step which converts a speech waveform into a sequence of information bearing acoustic feature vectors, and a step which models such a sequence. This thesis is primarily concerned with the use of hidden Markov models to model sequences of feature vectors which lie in a continuous space such as R sub N. It explores the trade-off between packing a lot of information into such sequences and being able to model them accurately. The difficulty of developing accurate models of continuous parameter sequences is addressed by investigating a method of parameter estimation which is specifically designed to cope with inaccurate modeling assumptions."
            },
            "slug": "The-acoustic-modeling-problem-in-automatic-speech-Brown",
            "title": {
                "fragments": [],
                "text": "The acoustic-modeling problem in automatic speech recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "This thesis is primarily concerned with the use of hidden Markov models to model sequences of feature vectors which lie in a continuous space such as R sub N and explores the trade-off between packing a lot of information into such sequences and being able to model them accurately."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3160228"
                        ],
                        "name": "K. Fukushima",
                        "slug": "K.-Fukushima",
                        "structuredName": {
                            "firstName": "Kunihiko",
                            "lastName": "Fukushima",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Fukushima"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35250703"
                        ],
                        "name": "N. Wake",
                        "slug": "N.-Wake",
                        "structuredName": {
                            "firstName": "Nobuaki",
                            "lastName": "Wake",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Wake"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 53,
                                "start": 49
                            }
                        ],
                        "text": "More recently there have been a number [8], [9], [10] of successful attempts to automatically learn appropriate local features using feedforward neural networks."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 35409661,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2ea3ebebfa4493713dbaaf681488b30e641fc1c2",
            "isKey": false,
            "numCitedBy": 263,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "A pattern recognition system which works with the mechanism of the neocognitron, a neural network model for deformation-invariant visual pattern recognition, is discussed. The neocognition was developed by Fukushima (1980). The system has been trained to recognize 35 handwritten alphanumeric characters. The ability to recognize deformed characters correctly depends strongly on the choice of the training pattern set. Some techniques for selecting training patterns useful for deformation-invariant recognition of a large number of characters are suggested."
            },
            "slug": "Handwritten-alphanumeric-character-recognition-by-Fukushima-Wake",
            "title": {
                "fragments": [],
                "text": "Handwritten alphanumeric character recognition by the neocognitron"
            },
            "tldr": {
                "abstractSimilarityScore": 80,
                "text": "A pattern recognition system which works with the mechanism of the neocognitron, a neural network model for deformation-invariant visual pattern recognition, is discussed, which has been trained to recognize 35 handwritten alphanumeric characters."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Neural Networks"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143756630"
                        ],
                        "name": "M. Varga",
                        "slug": "M.-Varga",
                        "structuredName": {
                            "firstName": "Margaret",
                            "lastName": "Varga",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Varga"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2715243"
                        ],
                        "name": "R. Hanka",
                        "slug": "R.-Hanka",
                        "structuredName": {
                            "firstName": "Rudolf",
                            "lastName": "Hanka",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Hanka"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 83,
                                "start": 79
                            }
                        ],
                        "text": "The method has been adapted to match tomographic [25] and thermographic images [26]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 121335143,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "833f2dcaae3005b16efafa6fefdbad3c4ff8dc77",
            "isKey": false,
            "numCitedBy": 4,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "A method of automatically stretching a series of hand thermograms to a standard form is described. It is based on an elastic model which has the iterative and co-operative properties of relaxation labelling, while not requiring large storage space for label updating. At each iteration some of the mutual differences between image pairs are removed, making the association between the new pairs more reliable. The experiments described show that mismatches decrease with each iteration, and thus the reliability of both local and global matches is increased. The method is co-operative because a feature at one location influences decisions made in its surrounding area. Nearest neighbour relationships are used to derive local difference vectors between features. These vectors are combined in a weighted averaging scheme to produce corrected difference vectors which are then applied to an image to create a new image for further matching. An FFT based technique has been developed to enhance the efficiency of the corrected difference vector evaluation. The method has been found to be efficient and cost effective for 2-dimensional image matching."
            },
            "slug": "Dynamic-elastic-image-stretching-technique-applied-Varga-Hanka",
            "title": {
                "fragments": [],
                "text": "Dynamic elastic image stretching technique applied to thermographic images"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The experiments described show that mismatches decrease with each iteration, and thus the reliability of both local and global matches is increased, and the method has been found to be efficient and cost effective for 2-dimensional image matching."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1784213"
                        ],
                        "name": "R. Bajcsy",
                        "slug": "R.-Bajcsy",
                        "structuredName": {
                            "firstName": "Ruzena",
                            "lastName": "Bajcsy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Bajcsy"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1802545"
                        ],
                        "name": "S. Kovacic",
                        "slug": "S.-Kovacic",
                        "structuredName": {
                            "firstName": "Stanislav",
                            "lastName": "Kovacic",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Kovacic"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 26,
                                "start": 22
                            }
                        ],
                        "text": "Bajcsy and co-workers [27], [28] integrate the notion of a trade-o between data t and deformation in their multiresolution elastic matching scheme for registering an image with respect to a template."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 19718946,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "36c9356db20ab4eace62d86e0a576fa6382d84b9",
            "isKey": false,
            "numCitedBy": 1217,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Multiresolution-elastic-matching-Bajcsy-Kovacic",
            "title": {
                "fragments": [],
                "text": "Multiresolution elastic matching"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Vis. Graph. Image Process."
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1688882"
                        ],
                        "name": "Yann LeCun",
                        "slug": "Yann-LeCun",
                        "structuredName": {
                            "firstName": "Yann",
                            "lastName": "LeCun",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yann LeCun"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2219581"
                        ],
                        "name": "B. Boser",
                        "slug": "B.-Boser",
                        "structuredName": {
                            "firstName": "Bernhard",
                            "lastName": "Boser",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Boser"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1747317"
                        ],
                        "name": "J. Denker",
                        "slug": "J.-Denker",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Denker",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Denker"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "37274089"
                        ],
                        "name": "D. Henderson",
                        "slug": "D.-Henderson",
                        "structuredName": {
                            "firstName": "Donnie",
                            "lastName": "Henderson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Henderson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2799635"
                        ],
                        "name": "R. Howard",
                        "slug": "R.-Howard",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Howard",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Howard"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34859193"
                        ],
                        "name": "W. Hubbard",
                        "slug": "W.-Hubbard",
                        "structuredName": {
                            "firstName": "Wayne",
                            "lastName": "Hubbard",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Hubbard"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2041866"
                        ],
                        "name": "L. Jackel",
                        "slug": "L.-Jackel",
                        "structuredName": {
                            "firstName": "Lawrence",
                            "lastName": "Jackel",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Jackel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 122,
                                "start": 119
                            }
                        ],
                        "text": "We would expect this type of network to be less susceptible to over tting than conventional neural network recognizers [8], [9], [45]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 42,
                                "start": 39
                            }
                        ],
                        "text": "More recently there have been a number [8], [9], [10] of successful attempts to automatically learn appropriate local features using feedforward neural networks."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 146,
                                "start": 143
                            }
                        ],
                        "text": "This is in contrast to the thousands of free parameters and multiple passes over the training data required by a typical neural net recognizer [8]."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                }
            ],
            "corpusId": 2542741,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "86ab4cae682fbd49c5a5bedb630e5a40fa7529f6",
            "isKey": false,
            "numCitedBy": 2931,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "We present an application of back-propagation networks to handwritten digit recognition. Minimal preprocessing of the data was required, but architecture of the network was highly constrained and specifically designed for the task. The input of the network consists of normalized images of isolated digits. The method has 1% error rate and about a 9% reject rate on zipcode digits provided by the U.S. Postal Service."
            },
            "slug": "Handwritten-Digit-Recognition-with-a-Network-LeCun-Boser",
            "title": {
                "fragments": [],
                "text": "Handwritten Digit Recognition with a Back-Propagation Network"
            },
            "tldr": {
                "abstractSimilarityScore": 62,
                "text": "Minimal preprocessing of the data was required, but architecture of the network was highly constrained and specifically designed for the task, and has 1% error rate and about a 9% reject rate on zipcode digits provided by the U.S. Postal Service."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1790646"
                        ],
                        "name": "P. Dayan",
                        "slug": "P.-Dayan",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Dayan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Dayan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1695689"
                        ],
                        "name": "Geoffrey E. Hinton",
                        "slug": "Geoffrey-E.-Hinton",
                        "structuredName": {
                            "firstName": "Geoffrey",
                            "lastName": "Hinton",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Geoffrey E. Hinton"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1764325"
                        ],
                        "name": "Radford M. Neal",
                        "slug": "Radford-M.-Neal",
                        "structuredName": {
                            "firstName": "Radford",
                            "lastName": "Neal",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Radford M. Neal"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1804104"
                        ],
                        "name": "R. Zemel",
                        "slug": "R.-Zemel",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Zemel",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Zemel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 65,
                                "start": 61
                            }
                        ],
                        "text": "However in an alternative interpretation of the EM algorithm [45], the EM algorithm can be viewed as maximizing a joint function, F (P ( ); ) of the distribution of the unobserved data and model parameters."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 1890561,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "605402e235bd62437baf3c9ebefe77fb4d92ee95",
            "isKey": false,
            "numCitedBy": 1173,
            "numCiting": 58,
            "paperAbstract": {
                "fragments": [],
                "text": "Discovering the structure inherent in a set of patterns is a fundamental aim of statistical inference or learning. One fruitful approach is to build a parameterized stochastic generative model, independent draws from which are likely to produce the patterns. For all but the simplest generative models, each pattern can be generated in exponentially many ways. It is thus intractable to adjust the parameters to maximize the probability of the observed patterns. We describe a way of finessing this combinatorial explosion by maximizing an easily computed lower bound on the probability of the observations. Our method can be viewed as a form of hierarchical self-supervised learning that may relate to the function of bottom-up and top-down cortical processing pathways."
            },
            "slug": "The-Helmholtz-Machine-Dayan-Hinton",
            "title": {
                "fragments": [],
                "text": "The Helmholtz Machine"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "A way of finessing this combinatorial explosion by maximizing an easily computed lower bound on the probability of the observations is described, viewed as a form of hierarchical self-supervised learning that may relate to the function of bottom-up and top-down cortical processing pathways."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1713795"
                        ],
                        "name": "C. Suen",
                        "slug": "C.-Suen",
                        "structuredName": {
                            "firstName": "Ching",
                            "lastName": "Suen",
                            "middleNames": [
                                "Yee"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Suen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2301906"
                        ],
                        "name": "M. Berthod",
                        "slug": "M.-Berthod",
                        "structuredName": {
                            "firstName": "Marc",
                            "lastName": "Berthod",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Berthod"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153312185"
                        ],
                        "name": "S. Mori",
                        "slug": "S.-Mori",
                        "structuredName": {
                            "firstName": "Shunji",
                            "lastName": "Mori",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Mori"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 184,
                                "start": 181
                            }
                        ],
                        "text": "Review of past work We will not attempt to review here the voluminous work on optical character recognition that has spanned more than three decades (useful reviews can be found in [2], [3], [4])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 23774011,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "cd6a2622ef81530dad7e4b53b48f41d0e07b1fba",
            "isKey": false,
            "numCitedBy": 335,
            "numCiting": 136,
            "paperAbstract": {
                "fragments": [],
                "text": "Based on a study of the extensive literature in handprint recognition, this paper presents a survey in this challenging field. Recognition algorithms, data bases, character models, and handprint standards are examined. Achievements in the recognition of handprinted numerals, alphanumerics, Fortran, and Katakana characters are analyzed and compared. Data quality and constraints, as well as human and machine factors are also described. Characteristics, problems, and actual results on on-line recognition of handprinted characters for different applications are discussed. New emphases and directions are suggested."
            },
            "slug": "Automatic-recognition-of-handprinted-state-of-the-Suen-Berthod",
            "title": {
                "fragments": [],
                "text": "Automatic recognition of handprinted characters&#8212;The state of the art"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "Recognition algorithms, data bases, character models, and handprint standards are examined and Achievements in the recognition of handprinted numerals, alphanumerics, Fortran, and Katakana characters are analyzed and compared."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the IEEE"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1784213"
                        ],
                        "name": "R. Bajcsy",
                        "slug": "R.-Bajcsy",
                        "structuredName": {
                            "firstName": "Ruzena",
                            "lastName": "Bajcsy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Bajcsy"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3931003"
                        ],
                        "name": "R. Lieberson",
                        "slug": "R.-Lieberson",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Lieberson",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Lieberson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4402076"
                        ],
                        "name": "M. Reivich",
                        "slug": "M.-Reivich",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Reivich",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Reivich"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 32,
                                "start": 28
                            }
                        ],
                        "text": "Bajcsy and co-workers [27], [28] integrate the notion of a trade-o between data t and deformation in their multiresolution elastic matching scheme for registering an image with respect to a template."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 42388945,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "a81dc1dec913629f3548fb5d9139c1a3101fbf84",
            "isKey": false,
            "numCitedBy": 294,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "A system of computer programs is described which, for the first time, is able to use computerized tomographic data to automatically locate, measure, and describe anatomical structures of interest with accuracy and consistency. Input to the system consists of any digitized radiographic data. Computer assisted tomographic (CAT) scans of the head were used in this first implementation. Using these data and a predefined atlas picture representing an idealized view of the average normal image, an individualized atlas was created. From the individualized atlas, structure size, density, location displacement, and distortion may be calculated. The individualized atlas created using high resolution data, such as the CAT scan, may then be directly superimposed on pictures obtained using lower resolution modalities, such as positron emission tomographic scan images. This allows the precise location of structures poorly visualized by the secondary imaging modality. This system is capable of using either two- or three-dimensional data."
            },
            "slug": "A-computerized-system-for-the-elastic-matching-of-Bajcsy-Lieberson",
            "title": {
                "fragments": [],
                "text": "A computerized system for the elastic matching of deformed radiographic images to idealized atlas images."
            },
            "tldr": {
                "abstractSimilarityScore": 91,
                "text": "A system of computer programs is described which is able to use computerized tomographic data to automatically locate, measure, and describe anatomical structures of interest with accuracy and consistency."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of computer assisted tomography"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2251336"
                        ],
                        "name": "D. Burr",
                        "slug": "D.-Burr",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Burr",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Burr"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 89,
                                "start": 85
                            }
                        ],
                        "text": "This term is similar to the \\support measure\" [32] or the symmetric matching used in [22] and [23]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 100,
                                "start": 96
                            }
                        ],
                        "text": "Burr presents an iterative framework for computing elastic matches in dot and grey-scale images [22] and line drawings [23]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 121016326,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "5c2a1a48cc37963ce148727d88f38f85c1edd104",
            "isKey": false,
            "numCitedBy": 173,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-dynamic-model-for-image-registration-Burr",
            "title": {
                "fragments": [],
                "text": "A dynamic model for image registration"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145715698"
                        ],
                        "name": "Christopher K. I. Williams",
                        "slug": "Christopher-K.-I.-Williams",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Williams",
                            "middleNames": [
                                "K.",
                                "I."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Christopher K. I. Williams"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2713302"
                        ],
                        "name": "M. Revow",
                        "slug": "M.-Revow",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Revow",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Revow"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1695689"
                        ],
                        "name": "Geoffrey E. Hinton",
                        "slug": "Geoffrey-E.-Hinton",
                        "structuredName": {
                            "firstName": "Geoffrey",
                            "lastName": "Hinton",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Geoffrey E. Hinton"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 236,
                                "start": 232
                            }
                        ],
                        "text": "Using the rich set of instantiation parameters supplied by the correct elastic model after it has been tted, we can train a conventional supervised multi-layer neural network to predict model instantiation parameters from the image [51]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 61,
                                "start": 57
                            }
                        ],
                        "text": "For example, a doubling of processing speed was achieved [51] using the multi-layered backpropagation network described below."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 5263450,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "18abbcafeda842a4d72e482771cb27f266894f14",
            "isKey": false,
            "numCitedBy": 9,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "Deformable models are an attractive approach to recognizing nonrigid objects which have considerable within class variability. However, there are severe search problems associated with fitting the models to data. We show that by using neural networks to provide better starting points, the search time can be significantly reduced. The method is demonstrated on a character recognition task."
            },
            "slug": "Using-a-neural-net-to-instantiate-a-deformable-Williams-Revow",
            "title": {
                "fragments": [],
                "text": "Using a neural net to instantiate a deformable model"
            },
            "tldr": {
                "abstractSimilarityScore": 37,
                "text": "It is shown that by using neural networks to provide better starting points, the search time can be significantly reduced on a character recognition task."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145852650"
                        ],
                        "name": "D. Mackay",
                        "slug": "D.-Mackay",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Mackay",
                            "middleNames": [
                                "J.",
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Mackay"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 184,
                                "start": 180
                            }
                        ],
                        "text": "Fitting a model to an image In this section, a Bayesian interpretation of the tting process is adopted and we demonstrate how using a maximum posterior framework (see, for example [38]) yields a practical algorithm."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 1762283,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8e68c54f39e87daf3a8bdc0ee005aece3c652d11",
            "isKey": false,
            "numCitedBy": 3960,
            "numCiting": 73,
            "paperAbstract": {
                "fragments": [],
                "text": "Although Bayesian analysis has been in use since Laplace, the Bayesian method of model-comparison has only recently been developed in depth. In this paper, the Bayesian approach to regularization and model-comparison is demonstrated by studying the inference problem of interpolating noisy data. The concepts and methods described are quite general and can be applied to many other data modeling problems. Regularizing constants are set by examining their posterior probability distribution. Alternative regularizers (priors) and alternative basis sets are objectively compared by evaluating the evidence for them. Occam's razor is automatically embodied by this process. The way in which Bayes infers the values of regularizing constants and noise levels has an elegant interpretation in terms of the effective number of parameters determined by the data set. This framework is due to Gull and Skilling."
            },
            "slug": "Bayesian-Interpolation-Mackay",
            "title": {
                "fragments": [],
                "text": "Bayesian Interpolation"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "The Bayesian approach to regularization and model-comparison is demonstrated by studying the inference problem of interpolating noisy data by examining the posterior probability distribution of regularizing constants and noise levels."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145492601"
                        ],
                        "name": "M. Shridhar",
                        "slug": "M.-Shridhar",
                        "structuredName": {
                            "firstName": "Malayappan",
                            "lastName": "Shridhar",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Shridhar"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143879066"
                        ],
                        "name": "A. Badreldin",
                        "slug": "A.-Badreldin",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Badreldin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Badreldin"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 39,
                                "start": 36
                            }
                        ],
                        "text": "For example, Shridhar and Badreldin [7] use features derived from the character pro les in the image."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 35,
                                "start": 13
                            }
                        ],
                        "text": "For example, Shridhar and Badreldin [7] use features derived fromthe character pro les in the image."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 32,
                                "start": 23
                            }
                        ],
                        "text": "[7] M. Shridhar and A. Badreldin, \\Recognition of isolated and simply connected handwrittennumerals\", Pattern Recognition, vol. 19, no. 1, pp. 1{12, 1986."
                    },
                    "intents": []
                }
            ],
            "corpusId": 11687116,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b9eb182fcaf3cb2b18540930509ff1ed3ad3c62a",
            "isKey": true,
            "numCitedBy": 151,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Recognition-of-isolated-and-simply-connected-Shridhar-Badreldin",
            "title": {
                "fragments": [],
                "text": "Recognition of isolated and simply connected handwritten numerals"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit."
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3300719"
                        ],
                        "name": "M. Moshfeghi",
                        "slug": "M.-Moshfeghi",
                        "structuredName": {
                            "firstName": "Mehran",
                            "lastName": "Moshfeghi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Moshfeghi"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 53,
                                "start": 49
                            }
                        ],
                        "text": "The method has been adapted to match tomographic [25] and thermographic images [26]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 41093710,
            "fieldsOfStudy": [
                "Medicine"
            ],
            "id": "24cbec98726a2f5c81e4d4685a843ac6adfad99d",
            "isKey": false,
            "numCitedBy": 83,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Elastic-matching-of-multimodality-medical-images-Moshfeghi",
            "title": {
                "fragments": [],
                "text": "Elastic matching of multimodality medical images"
            },
            "venue": {
                "fragments": [],
                "text": "CVGIP Graph. Model. Image Process."
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145852650"
                        ],
                        "name": "D. Mackay",
                        "slug": "D.-Mackay",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Mackay",
                            "middleNames": [
                                "J.",
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Mackay"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60835229,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9cb516690edbb1875dc3a5d4adc380cf5901f23e",
            "isKey": false,
            "numCitedBy": 263,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "Bayesian probability theory provides a unifying framework for data modeling. In this framework, the overall aims are to find models that are well matched to the data, and to use these models to make optimal predictions. Neural network learning is interpreted as an inference of the most probable parameters for the model, given the training data. The search in model space (i.e., the space of architectures, noise models, preprocessings, regularizers, and weight decay constants) also then can be treated as an inference problem, in which we infer the relative probability of alternative models, given the data. This provides powerful and practical methods for controlling, comparing, and using adaptive network models. This chapter describes numerical techniques based on Gaussian approximations for implementation of these methods."
            },
            "slug": "Bayesian-Methods-for-Backpropagation-Networks-Mackay",
            "title": {
                "fragments": [],
                "text": "Bayesian Methods for Backpropagation Networks"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "This chapter describes numerical techniques based on Gaussian approximations for implementation of powerful and practical methods for controlling, comparing, and using adaptive network models."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2251336"
                        ],
                        "name": "D. Burr",
                        "slug": "D.-Burr",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Burr",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Burr"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 98,
                                "start": 94
                            }
                        ],
                        "text": "This term is similar to the \\support measure\" [32] or the symmetric matching used in [22] and [23]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 123,
                                "start": 119
                            }
                        ],
                        "text": "Burr presents an iterative framework for computing elastic matches in dot and grey-scale images [22] and line drawings [23]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 17709775,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "60b3fe8fa86d3e8e6d74c917f38877e2e88bca07",
            "isKey": false,
            "numCitedBy": 233,
            "numCiting": 49,
            "paperAbstract": {
                "fragments": [],
                "text": "Recently a dynamic elastic model [1] was proposed for automatic image matching. Examples were shown applying the model to dot patterns and gray scale pictures. This paper extends the model to line drawings. Examples are shown on handprint and animation, suggesting the use of dynamic matching for shape recognition and for motion correspondence."
            },
            "slug": "Elastic-Matching-of-Line-Drawings-Burr",
            "title": {
                "fragments": [],
                "text": "Elastic Matching of Line Drawings"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "Examples are shown on handprint and animation, suggesting the use of dynamic matching for shape recognition and for motion correspondence, and extending the model to line drawings."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35191677"
                        ],
                        "name": "J. Hampshire",
                        "slug": "J.-Hampshire",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Hampshire",
                            "middleNames": [
                                "B."
                            ],
                            "suffix": "II"
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Hampshire"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1724972"
                        ],
                        "name": "A. Waibel",
                        "slug": "A.-Waibel",
                        "structuredName": {
                            "firstName": "Alexander",
                            "lastName": "Waibel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Waibel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 186,
                                "start": 182
                            }
                        ],
                        "text": "The maximummutual information criterion emphasizes correct discrimination rather than correct modeling of the image data, and it generally leads to better discriminative performance [40], although the advantage of discriminative learning vanishes if the generative model is correct and the tting process produces the true probability of the data given the model [41]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 1975998,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6b4081a0b5d775172269854c07dadb0c07977806",
            "isKey": false,
            "numCitedBy": 162,
            "numCiting": 27,
            "paperAbstract": {
                "fragments": [],
                "text": "The authors present single- and multispeaker recognition results for the voiced stop consonants /b, d, g/ using time-delay neural networks (TDNN), a new objective function for training these networks, and a simple arbitration scheme for improved classification accuracy. With these enhancements a median 24% reduction in the number of misclassifications made by TDNNs trained with the traditional backpropagation objective function is achieved. This redundant results in /b, d, g/ recognition rates that consistently exceed 98% for TDNNs trained with individual speakers; it yields a 98.1% recognition rate for a TDNN trained with three male speakers.<<ETX>>"
            },
            "slug": "A-novel-objective-function-for-improved-phoneme-Hampshire-Waibel",
            "title": {
                "fragments": [],
                "text": "A novel objective function for improved phoneme recognition using time delay neural networks"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "The authors present single- and multispeaker recognition results for the voiced stop consonants /b, d, g/ using time-delay neural networks (TDNN), a new objective function for training these networks, and a simple arbitration scheme for improved classification accuracy."
            },
            "venue": {
                "fragments": [],
                "text": "International 1989 Joint Conference on Neural Networks"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2053227062"
                        ],
                        "name": "Richard Durbin",
                        "slug": "Richard-Durbin",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Durbin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Richard Durbin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40227361"
                        ],
                        "name": "D. Willshaw",
                        "slug": "D.-Willshaw",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Willshaw",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Willshaw"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 77,
                                "start": 58
                            }
                        ],
                        "text": "The ttingtechnique resembles the elastic net algorithm of Durbin and Willshaw [36] except that ourelastic energy function is muchmore complex and we are also tting an a ne transformation."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 83,
                                "start": 79
                            }
                        ],
                        "text": "The tting technique resembles the elastic net algorithm of Durbin and Willshaw [36] except that our elastic energy function is muchmore complex and we are also tting an a ne transformation."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 30,
                                "start": 22
                            }
                        ],
                        "text": "[36] R. Durbin and D. Willshaw, \\An analogue approach to the travelling salesman problem\",Nature, vol. 326, pp. 689{691, 1987."
                    },
                    "intents": []
                }
            ],
            "corpusId": 4321691,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a94be030ccd68f3a5a3bf9245137fe114c549819",
            "isKey": true,
            "numCitedBy": 855,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "The travelling salesman problem1 is a classical problem in the field of combinatorial optimization, concerned with efficient methods for maximizing or minimizing a function of many independent variables. Given the positions of N cities, which in the simplest case lie in the plane, what is the shortest closed tour in which each city can be visited once? We describe how a parallel analogue algorithm, derived from a formal model2–3 for the establishment of topographically ordered projections in the brain4–10, can be applied to the travelling salesman problem1,11,12. Using an iterative procedure, a circular closed path is gradually elongated non-uniformly until it eventually passes sufficiently near to all the cities to define a tour. This produces shorter tour lengths than another recent parallel analogue algorithm13, scales well with the size of the problem, and is naturally extendable to a large class of optimization problems involving topographic mappings between geometrical structures14."
            },
            "slug": "An-analogue-approach-to-the-travelling-salesman-an-Durbin-Willshaw",
            "title": {
                "fragments": [],
                "text": "An analogue approach to the travelling salesman problem using an elastic net method"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This work describes how a parallel analogue algorithm, derived from a formal model for the establishment of topographically ordered projections in the brain, can be applied to the travelling salesman problem, and produces shorter tour lengths than another recent parallel analogue algorithms."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2251336"
                        ],
                        "name": "D. Burr",
                        "slug": "D.-Burr",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Burr",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Burr"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 23,
                                "start": 19
                            }
                        ],
                        "text": "In a later version [24], global size and rotation adjustments were included."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 124085699,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bc29fb93d96b639cf9ec7ac39489160561ef3dfc",
            "isKey": false,
            "numCitedBy": 16,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes a new efficient algorithm for elastic template matching. The algorithm is based on a coarse to fine matching strategy which iteratively improves the correspondence between images. The high cost of elastic matching is greatly reduced by incorporating efficient techniques for image representation and search. Recognition accuracy of 99% was achieved when using the elastic technique for handprinted character recognition."
            },
            "slug": "Matching-Elastic-Templates-Burr",
            "title": {
                "fragments": [],
                "text": "Matching Elastic Templates"
            },
            "tldr": {
                "abstractSimilarityScore": 81,
                "text": "A new efficient algorithm for elastic template matching is described, based on a coarse to fine matching strategy which iteratively improves the correspondence between images."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2204972"
                        ],
                        "name": "M. V. Rossum",
                        "slug": "M.-V.-Rossum",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Rossum",
                            "middleNames": [
                                "C.",
                                "W.",
                                "van"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. V. Rossum"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2281536,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "2d5af1ab6368f20a4a9bb2afae23663e5b08b9c6",
            "isKey": false,
            "numCitedBy": 1657,
            "numCiting": 99,
            "paperAbstract": {
                "fragments": [],
                "text": "Lecture Notes for the MSc/DTC module. The brain is a complex computing machine which has evolved to give the ttest output to a given input. Neural computation has as goal to describe the function of the nervous system in mathematical and computational terms. By analysing or simulating the resulting equations, one can better understand its function, research how changes in parameters would eect the function, and try to mimic the nervous system in hardware or software implementations. Neural Computation is a bit like physics, that has been successful in describing numerous physical phenomena. However, approaches developed in those elds not always work for neural computation, because: 1. Physical systems are best studied in reduced, simplied circumstances, but the nervous system is hard to study in isolation. Neurons require a narrow range of operating conditions (temperature, oxygen, presence of other neurons, ion concentrations, ...) under which they work as they should. These conditions are hard to reproduce outside the body. Secondly, the neurons form a highly interconnected network. The function of the nervous systems depends on this connectivity and interaction, by trying to isolate the components, you are likely to alter the function. 2. It is not clear how much detail one needs to describe the computations in the brain. In these lectures we shall see various description levels. 3. Neural signals and neural connectivity are hard to measure, especially, if disturbance and damage to the nervous system is to be kept minimal. Perhaps Neural Computation has more in common with trying to gure out how a complicated machine, such as a computer or car works. Knowledge of the basic physics helps, but is not sucient. Luckily there are factors which perhaps make understanding the brain easier than understanding an arbitrary complicated machine: 1. There is a high degree of conservation across species. This means that animal studies can be used to gain information about the human brain. Furthermore, study of, say, the visual system might help to understand the auditory system. 2. The nervous system is able to develop by combining on one hand a only limited amount of genetic information and, on the other hand, the input it receives. Therefore it might be possible to nd the organising principles and develop a brain from there. This would be easier than guring out the complete 'wiring diagram'. 3. The nervous system is exible and robust, neurons die everyday. This stands …"
            },
            "slug": "Neural-Computation-Rossum",
            "title": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The nervous system is able to develop by combining on one hand a only limited amount of genetic information and, on the other hand, the input it receives, and it might be possible to develop a brain from there."
            },
            "venue": {
                "fragments": [],
                "text": "Artificial Intelligence"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1687951"
                        ],
                        "name": "J. Mantas",
                        "slug": "J.-Mantas",
                        "structuredName": {
                            "firstName": "José",
                            "lastName": "Mantas",
                            "middleNames": [
                                "Miguel"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mantas"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 189,
                                "start": 186
                            }
                        ],
                        "text": "Review of past work We will not attempt to review here the voluminous work on optical character recognition that has spanned more than three decades (useful reviews can be found in [2], [3], [4])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 33154342,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "41b08adf1a58d466f9b14fa864ec916d27518a05",
            "isKey": false,
            "numCitedBy": 310,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "An-overview-of-character-recognition-methodologies-Mantas",
            "title": {
                "fragments": [],
                "text": "An overview of character recognition methodologies"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit."
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2465976"
                        ],
                        "name": "M. Fischler",
                        "slug": "M.-Fischler",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Fischler",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Fischler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3394928"
                        ],
                        "name": "R. Elschlager",
                        "slug": "R.-Elschlager",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Elschlager",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Elschlager"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 40,
                                "start": 30
                            }
                        ],
                        "text": "[29] M. A. Fischler and R. A. Elschlager, \\The representation and matching of pictorial structures\",IEEE Trans."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 37,
                                "start": 14
                            }
                        ],
                        "text": "Early work by Fischler and Elschlager [29] described a model with local (data t) and global(model deformation) energy terms."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 42,
                                "start": 38
                            }
                        ],
                        "text": "Early work by Fischler and Elschlager [29] described a model with local (data t) and global (model deformation) energy terms."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 14554383,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "719da2a0ddd38e78151e1cb2db31703ea8b2e490",
            "isKey": true,
            "numCitedBy": 1527,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "The primary problem dealt with in this paper is the following. Given some description of a visual object, find that object in an actual photograph. Part of the solution to this problem is the specification of a descriptive scheme, and a metric on which to base the decision of \"goodness\" of matching or detection."
            },
            "slug": "The-Representation-and-Matching-of-Pictorial-Fischler-Elschlager",
            "title": {
                "fragments": [],
                "text": "The Representation and Matching of Pictorial Structures"
            },
            "tldr": {
                "abstractSimilarityScore": 59,
                "text": "The primary problem dealt with in this paper is the specification of a descriptive scheme, and a metric on which to base the decision of \"goodness\" of matching or detection."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Computers"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2053227062"
                        ],
                        "name": "Richard Durbin",
                        "slug": "Richard-Durbin",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Durbin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Richard Durbin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1717841"
                        ],
                        "name": "R. Szeliski",
                        "slug": "R.-Szeliski",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Szeliski",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Szeliski"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145081362"
                        ],
                        "name": "A. Yuille",
                        "slug": "A.-Yuille",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Yuille",
                            "middleNames": [
                                "Loddon"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Yuille"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 106,
                                "start": 103
                            }
                        ],
                        "text": "The generative model is an elaboration of the probabilistic interpretation of the elastic net given in [1]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 13,
                                "start": 10
                            }
                        ],
                        "text": "Following [1] and [33] we de ne the deformation energy, Edef , to be the negative log probability of the deformation."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 116,
                                "start": 113
                            }
                        ],
                        "text": "We use the probabilistic interpretation of elastic models introduced in an analysis of the elastic net algorithm [1]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 9262827,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "477db9d84d8875da57664d39af140d884d858222",
            "isKey": false,
            "numCitedBy": 209,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper analyzes the elastic net approach (Durbin and Willshaw 1987) to the traveling salesman problem of finding the shortest path through a set of cities. The elastic net approach jointly minimizes the length of an arbitrary path in the plane and the distance between the path points and the cities. The tradeoff between these two requirements is controlled by a scale parameter K. A global minimum is found for large K, and is then tracked to a small value. In this paper, we show that (1) in the small K limit the elastic path passes arbitrarily close to all the cities, but that only one path point is attracted to each city, (2) in the large K limit the net lies at the center of the set of cities, and (3) at a critical value of K the energy function bifurcates. We also show that this method can be interpreted in terms of extremizing a probability distribution controlled by K. The minimum at a given K corresponds to the maximum a posteriori (MAP) Bayesian estimate of the tour under a natural statistical interpretation. The analysis presented in this paper gives us a better understanding of the behavior of the elastic net, allows us to better choose the parameters for the optimization, and suggests how to extend the underlying ideas to other domains."
            },
            "slug": "An-Analysis-of-the-Elastic-Net-Approach-to-the-Durbin-Szeliski",
            "title": {
                "fragments": [],
                "text": "An Analysis of the Elastic Net Approach to the Traveling Salesman Problem"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The analysis presented in this paper gives a better understanding of the behavior of the elastic net, allows us to better choose the parameters for the optimization, and suggests how to extend the underlying ideas to other domains."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1830709"
                        ],
                        "name": "A. Lanitis",
                        "slug": "A.-Lanitis",
                        "structuredName": {
                            "firstName": "Andreas",
                            "lastName": "Lanitis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Lanitis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144482985"
                        ],
                        "name": "C. Taylor",
                        "slug": "C.-Taylor",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Taylor",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Taylor"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7205190"
                        ],
                        "name": "Tim Cootes",
                        "slug": "Tim-Cootes",
                        "structuredName": {
                            "firstName": "Tim",
                            "lastName": "Cootes",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tim Cootes"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 50,
                                "start": 46
                            }
                        ],
                        "text": "This term is similar to the \\support measure\" [32] or the symmetric matching used in [22] and [23]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 30,
                                "start": 26
                            }
                        ],
                        "text": "Point distribution models [32], recognize the importance of doing both types of matching, i."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 9324621,
            "fieldsOfStudy": [
                "Business"
            ],
            "id": "e6f2a07dde029636090d03f1ceeee2bb7200e6db",
            "isKey": false,
            "numCitedBy": 32,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "A technique for classifying variable objects using flexible template models is described. : is recognised as the input, plant seeds, handprinted characters and human faces; quantitative results are presented."
            },
            "slug": "A-Generic-System-For-Classifying-Variable-Objects-Lanitis-Taylor",
            "title": {
                "fragments": [],
                "text": "A Generic System For Classifying Variable Objects Using Flexible Template Matching"
            },
            "tldr": {
                "abstractSimilarityScore": 98,
                "text": "A technique for classifying variable objects using flexible template models is described and is recognised as the input, plant seeds, handprinted characters and human faces."
            },
            "venue": {
                "fragments": [],
                "text": "BMVC"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "122132638"
                        ],
                        "name": "Amar Gupta",
                        "slug": "Amar-Gupta",
                        "structuredName": {
                            "firstName": "Amar",
                            "lastName": "Gupta",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Amar Gupta"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2040979"
                        ],
                        "name": "M. V. Nagendraprasad",
                        "slug": "M.-V.-Nagendraprasad",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Nagendraprasad",
                            "middleNames": [
                                "V."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. V. Nagendraprasad"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107393694"
                        ],
                        "name": "A. Liu",
                        "slug": "A.-Liu",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Liu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152702577"
                        ],
                        "name": "P. Wang",
                        "slug": "P.-Wang",
                        "structuredName": {
                            "firstName": "Patrick",
                            "lastName": "Wang",
                            "middleNames": [
                                "Shen-Pei"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Wang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39381524"
                        ],
                        "name": "S. Ayyadurai",
                        "slug": "S.-Ayyadurai",
                        "structuredName": {
                            "firstName": "S.",
                            "lastName": "Ayyadurai",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ayyadurai"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 133,
                                "start": 129
                            }
                        ],
                        "text": "We would expect this type of network to be less susceptible to over tting than conventional neural network recognizers [8], [9], [45]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 2131320,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "b2888584ec63e5efc0e7f4d9dcbe3d5b338e4496",
            "isKey": false,
            "numCitedBy": 16,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "Reprint. Reprinted from the International journal of pattern recognition and artificial intelligence. Vol. 7, no. 4 (1993) \"January 1993.\""
            },
            "slug": "An-Integrated-Architecture-for-Recognition-of-Gupta-Nagendraprasad",
            "title": {
                "fragments": [],
                "text": "An Integrated Architecture for Recognition of Totally Unconstrained Handwritten Numerals"
            },
            "tldr": {
                "abstractSimilarityScore": 37,
                "text": "This paper presents a meta-modelling system that automates the very labor-intensive and therefore time-heavy and expensive process of manually cataloging and cataloging individual neurons in the brain."
            },
            "venue": {
                "fragments": [],
                "text": "Int. J. Pattern Recognit. Artif. Intell."
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35043531"
                        ],
                        "name": "A. Dempster",
                        "slug": "A.-Dempster",
                        "structuredName": {
                            "firstName": "Arthur",
                            "lastName": "Dempster",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Dempster"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7890796"
                        ],
                        "name": "N. Laird",
                        "slug": "N.-Laird",
                        "structuredName": {
                            "firstName": "Nan",
                            "lastName": "Laird",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Laird"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2235217"
                        ],
                        "name": "D. Rubin",
                        "slug": "D.-Rubin",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "Rubin",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Rubin"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 83,
                                "start": 79
                            }
                        ],
                        "text": "Our preferred method is based upon the Expectation Maximization (EM) algorithm [37]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 4193919,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "d36efb9ad91e00faa334b549ce989bfae7e2907a",
            "isKey": false,
            "numCitedBy": 48406,
            "numCiting": 134,
            "paperAbstract": {
                "fragments": [],
                "text": "Vibratory power unit for vibrating conveyers and screens comprising an asynchronous polyphase motor, at least one pair of associated unbalanced masses disposed on the shaft of said motor, with the first mass of a pair of said unbalanced masses being rigidly fastened to said shaft and with said second mass of said pair being movably arranged relative to said first mass, means for controlling and regulating the conveying rate during conveyer operation by varying the rotational speed of said motor between predetermined minimum and maximum values, said second mass being movably outwardly by centrifugal force against the pressure of spring means, said spring means being prestressed in such a manner that said second mass is, at rotational motor speeds lower than said minimum speed, held in its initial position, and at motor speeds between said lower and upper values in positions which are radially offset with respect to the axis of said motor to an extent depending on the value of said rotational motor speed."
            },
            "slug": "Maximum-likelihood-from-incomplete-data-via-the-EM-Dempster-Laird",
            "title": {
                "fragments": [],
                "text": "Maximum likelihood from incomplete data via the EM - algorithm plus discussions on the paper"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144784290"
                        ],
                        "name": "T. Ertl",
                        "slug": "T.-Ertl",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Ertl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Ertl"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 60744504,
            "fieldsOfStudy": [
                "Education",
                "Art"
            ],
            "id": "459d0724afbcd591edde2dcc83e5e2750d878c0e",
            "isKey": false,
            "numCitedBy": 2423,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "These are the short notes for a two hour tutorial on principles and practice of computer graphics and scientific visualization. They are intended to summarize the contents of the tutorial transparencies and slides but they cannot completely replace them since restrictions in space and print quality do not permit the inclusion of figures and example images. For further reference the following standard text should be consulted: [3, 8, 5, 1, 6, 2, 9]"
            },
            "slug": "Computer-graphics—principles-and-practice-Ertl",
            "title": {
                "fragments": [],
                "text": "Computer graphics—principles and practice"
            },
            "tldr": {
                "abstractSimilarityScore": 82,
                "text": "These are the short notes for a two hour tutorial on principles and practice of computer graphics and scientific visualization and they cannot completely replace the contents of the tutorial transparencies and slides since restrictions in space and print quality do not permit the inclusion of figures and example images."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49393083"
                        ],
                        "name": "B. Everitt",
                        "slug": "B.-Everitt",
                        "structuredName": {
                            "firstName": "B.",
                            "lastName": "Everitt",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Everitt"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 117,
                                "start": 113
                            }
                        ],
                        "text": "What we have just described is an instantiation of the general framework of generative or latent variable models [32]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 122093866,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "345d4daa63202fedd6311ae295b298e216291af3",
            "isKey": false,
            "numCitedBy": 516,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "1 General introduction.- 1.1 Introduction.- 1.2 Latent variables and latent variable models.- 1.3 The role of models.- 1.4 The general latent model.- 1.5 A simple latent variable model.- 1.6 Estimation and goodness-of-fit.- 1.7 Path diagrams.- 1.8 Summary.- 2 Factor analysis.- 2.1 Introduction.- 2.2 Explanatory and confirmatory factor analysis.- 2.3 The factor analysis model.- 2.4 Identifiability of the factor analysis model.- 2.5 Estimating the parameters in the factor analysis model.- 2.6 Goodness-of-fit tests.- 2.7 Rotation of factors.- 2.8 Numerical examples.- 2.9 Confirmatory factor analysis.- 2.10 Summary.- 3 The LISREL model.- 3.1 Introduction.- 3.2 The LISREL model.- 3.3 Identification.- 3.4 Estimating the parameters in the LISREL model.- 3.5 Instrumental variables.- 3.6 Numerical examples.- 3.7 Assessing goodness-of-fit.- 3.8 Multigroup analysis.- 3.9 Summary.- 4 Latent variable models for categorical data.- 4.1 Introduction.- 4.2 Factor analysis of binary variables.- 4.3 Latent structure models.- 4.4 Summary.- 5 Some final comments.- 5.1 Introduction.- 5.2 Assessing the fit of latent variable models by cross-validation procedures.- 5.3 Latent variables - fact or fiction?.- 5.4 Summary.- Appendix A Estimating the parameters in latent variable models a brief account of computational procedures.- Appendix B Computer programs for latent variable models.- Exercises.- References."
            },
            "slug": "An-Introduction-to-Latent-Variable-Models-Everitt",
            "title": {
                "fragments": [],
                "text": "An Introduction to Latent Variable Models"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "Assessment of the fit of latent variable models by cross-validation procedures by estimating the parameters in latent variable model a brief account of computational procedures."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144886844"
                        ],
                        "name": "R. Lathe",
                        "slug": "R.-Lathe",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Lathe",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Lathe"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 238,
                                "start": 234
                            }
                        ],
                        "text": "Using the rich set of instantiation parameters supplied by the correct elastic model after it has been tted, we could train a conventional supervised multi-layer neural network to predict model instantiation parameters from the image [42]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 5063877,
            "fieldsOfStudy": [
                "Geography",
                "Environmental Science",
                "Geology"
            ],
            "id": "6ec27fba80de3b9c52ef6ac4eaa9f59821aefb4b",
            "isKey": false,
            "numCitedBy": 11671,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "Deposits of clastic carbonate-dominated (calciclastic) sedimentary slope systems in the rock record have been identified mostly as linearly-consistent carbonate apron deposits, even though most ancient clastic carbonate slope deposits fit the submarine fan systems better. Calciclastic submarine fans are consequently rarely described and are poorly understood. Subsequently, very little is known especially in mud-dominated calciclastic submarine fan systems. Presented in this study are a sedimentological core and petrographic characterisation of samples from eleven boreholes from the Lower Carboniferous of Bowland Basin (Northwest England) that reveals a >250 m thick calciturbidite complex deposited in a calciclastic submarine fan setting. Seven facies are recognised from core and thin section characterisation and are grouped into three carbonate turbidite sequences. They include: 1) Calciturbidites, comprising mostly of highto low-density, wavy-laminated bioclast-rich facies; 2) low-density densite mudstones which are characterised by planar laminated and unlaminated muddominated facies; and 3) Calcidebrites which are muddy or hyper-concentrated debrisflow deposits occurring as poorly-sorted, chaotic, mud-supported floatstones. These"
            },
            "slug": "Phd-by-thesis-Lathe",
            "title": {
                "fragments": [],
                "text": "Phd by thesis"
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1784682"
                        ],
                        "name": "T. Hastie",
                        "slug": "T.-Hastie",
                        "structuredName": {
                            "firstName": "Trevor",
                            "lastName": "Hastie",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Hastie"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1761784"
                        ],
                        "name": "R. Tibshirani",
                        "slug": "R.-Tibshirani",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Tibshirani",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Tibshirani"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 79,
                                "start": 75
                            }
                        ],
                        "text": "For example, a digit recognition system developed by Hastie and Tibshirani [39] suggested that discrimination would be much better if the net was totally connected so that the output unit that represents one digit receives detailed information about the way in which other digit models t the data."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 175,
                                "start": 165
                            }
                        ],
                        "text": "AcknowledgmentsThis research was funded by Apple and by the Ontario Information Technology Research Centre.32\nWe thank Allan Jepson, Richard Durbin, Rich Zemel, Rob Tibshirani and Yann Le Cun for help-ful discussions."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 73,
                                "start": 52
                            }
                        ],
                        "text": "For example, a digitrecognition system developed by Hastie and Tibshirani [39] suggested that discriminationwould be much better if the net was totally connected so that the output unit that representsone digit receives detailed information about the way in which other digit models t the data."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 32,
                                "start": 22
                            }
                        ],
                        "text": "[39] T. Hastie and R. Tibshirani, Handwritten digit recognition via deformable prototypes, TechnicalReport, Department of Statistics, University of Toronto, 1992."
                    },
                    "intents": []
                }
            ],
            "corpusId": 59734498,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ee812dc4453cf0751f36217af15a4aadd2c48510",
            "isKey": true,
            "numCitedBy": 25,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Handwritten-Digit-Recognition-via-Deformable-Hastie-Tibshirani",
            "title": {
                "fragments": [],
                "text": "Handwritten Digit Recognition via Deformable Prototypes"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1994
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 91,
                                "start": 87
                            }
                        ],
                        "text": "While its classi cation performance is comparable to other state-of-the-art classi ers [10], [50] it is signi cantly more computationally intensive."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 21,
                                "start": 17
                            }
                        ],
                        "text": "Some researchers [10], [3], [11] have boosted performance using combinations of classi ers."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 29,
                                "start": 22
                            }
                        ],
                        "text": "[11] D. Lee and S. N. Srihari, \\Handprinted digit recognition: A comparison of algorithms\", inThird international workshop on frontiers in handwriting recognition, Bu alo, NY, May 1993,pp. 153{162."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 41,
                                "start": 37
                            }
                        ],
                        "text": "An in depth study by Lee and Srihari [10]17 evaluated 8 algorithms and 5 combination schemes on the bs test set."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 22,
                                "start": 18
                            }
                        ],
                        "text": "Lee and Srihari's [10] curves indicate that they have to reject 2."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Handprinted digit recognition: A comparison of algorithms\", in  Third international workshop on frontiers in handwriting recognition, pp. 153{162"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1769645503"
                        ],
                        "name": "M. Carter",
                        "slug": "M.-Carter",
                        "structuredName": {
                            "firstName": "Matthew",
                            "lastName": "Carter",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Carter"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122687088,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "319bef16b09502a4c6d374a947ad74006cc1cda2",
            "isKey": false,
            "numCitedBy": 3354,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Computer-graphics:-Principles-and-practice-Carter",
            "title": {
                "fragments": [],
                "text": "Computer graphics: Principles and practice"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2070811111"
                        ],
                        "name": "Jon C. Geist",
                        "slug": "Jon-C.-Geist",
                        "structuredName": {
                            "firstName": "Jon",
                            "lastName": "Geist",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jon C. Geist"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145662615"
                        ],
                        "name": "R. A. Wilkinson",
                        "slug": "R.-A.-Wilkinson",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Wilkinson",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. A. Wilkinson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2123720"
                        ],
                        "name": "S. Janet",
                        "slug": "S.-Janet",
                        "structuredName": {
                            "firstName": "Stanley",
                            "lastName": "Janet",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Janet"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2136478"
                        ],
                        "name": "P. Grother",
                        "slug": "P.-Grother",
                        "structuredName": {
                            "firstName": "Patrick",
                            "lastName": "Grother",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Grother"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2057890920"
                        ],
                        "name": "Bob Hammond",
                        "slug": "Bob-Hammond",
                        "structuredName": {
                            "firstName": "Bob",
                            "lastName": "Hammond",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Bob Hammond"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69051435"
                        ],
                        "name": "N. W. Larsen",
                        "slug": "N.-W.-Larsen",
                        "structuredName": {
                            "firstName": "Norman",
                            "lastName": "Larsen",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. W. Larsen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "75115665"
                        ],
                        "name": "R. Klear",
                        "slug": "R.-Klear",
                        "structuredName": {
                            "firstName": "Randy",
                            "lastName": "Klear",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Klear"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "75089502"
                        ],
                        "name": "M. J. Matsko",
                        "slug": "M.-J.-Matsko",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Matsko",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. J. Matsko"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2676309"
                        ],
                        "name": "C. Burges",
                        "slug": "C.-Burges",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Burges",
                            "middleNames": [
                                "J.",
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Burges"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40199624"
                        ],
                        "name": "R. Creecy",
                        "slug": "R.-Creecy",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Creecy",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Creecy"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1694191"
                        ],
                        "name": "J. Hull",
                        "slug": "J.-Hull",
                        "structuredName": {
                            "firstName": "Jonathan",
                            "lastName": "Hull",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Hull"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47327848"
                        ],
                        "name": "T. P. Vogl",
                        "slug": "T.-P.-Vogl",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Vogl",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. P. Vogl"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144286385"
                        ],
                        "name": "Charles L. Wilson",
                        "slug": "Charles-L.-Wilson",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Wilson",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Charles L. Wilson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 69821341,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c06f6ee9cc628c8ceefc10e5df0b12db443bef8c",
            "isKey": false,
            "numCitedBy": 62,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-Second-Census-Optical-Character-Recognition-Geist-Wilkinson",
            "title": {
                "fragments": [],
                "text": "The Second Census Optical Character Recognition Systems Conference"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1994
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 186,
                                "start": 182
                            }
                        ],
                        "text": "The maximummutual information criterion emphasizes correct discrimination rather than correct modeling of the image data, and it generally leads to better discriminative performance [40], although the advantage of discriminative learning vanishes if the generative model is correct and the tting process produces the true probability of the data given the model [41]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 61724906,
            "fieldsOfStudy": [],
            "id": "73aa78f62329c01e60af4cf438645845aa9a803a",
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A novel objective function for improved phoneme recognition using time delay neural networks"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1764325"
                        ],
                        "name": "Radford M. Neal",
                        "slug": "Radford-M.-Neal",
                        "structuredName": {
                            "firstName": "Radford",
                            "lastName": "Neal",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Radford M. Neal"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 71,
                                "start": 67
                            }
                        ],
                        "text": "However in a recent alternative interpretation of the EM algorithm [43], Neal and Hinton present the EM algorithm as maximizing a joint function, F (P ( ); ) of the distribution of the unobserved data and model parameters."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 62562212,
            "fieldsOfStudy": [
                "Philosophy"
            ],
            "id": "418cc44768ff9d0ed8cf4cef79869f90ab672f7b",
            "isKey": false,
            "numCitedBy": 215,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-new-view-of-the-EM-algorithm-that-justifies-and-Neal",
            "title": {
                "fragments": [],
                "text": "A new view of the EM algorithm that justifies incremental and other variants"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "\\Matching elastic templates\", in Physical and biological processing of images: proceedings of an international symposium organized by the Rank Prize Funds"
            },
            "venue": {
                "fragments": [],
                "text": "\\Matching elastic templates\", in Physical and biological processing of images: proceedings of an international symposium organized by the Rank Prize Funds"
            },
            "year": 1983
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 12,
                                "start": 8
                            }
                        ],
                        "text": "Ullmann [20] discusses the idea of nding a distortion mapping from a test image to a stored template such that there is correspondence between like features rather than exact matches."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Correspondence in character recognition"
            },
            "venue": {
                "fragments": [],
                "text": "Machine Perception of Patterns  and Pictures. Institute of Physics, London, U.K."
            },
            "year": 1972
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 82,
                                "start": 78
                            }
                        ],
                        "text": "Since all control 8This is an example of Expectation/Conditional Maximization [41] 9More precisely, the pixel forces on the beads can be transferred onto the control points and at equilibrium there is a balance between these forces and those pulling the control points towards their home locations."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Recent extensions to the EM algorithm"
            },
            "venue": {
                "fragments": [],
                "text": "Bayesian Statistics  4, J.M. Bernardo, J. O. Berger, A. P. Dawid, and A. F. M. Smith, Eds., pp. 307{320. Oxford  University Press"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "\\Thèrubber-mask' technique{I. Pattern Measurement and Analysis"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognition"
            },
            "year": 1973
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Rubin, \\Recent extensions to the EM algorithm"
            },
            "venue": {
                "fragments": [],
                "text": "Rubin, \\Recent extensions to the EM algorithm"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 138,
                                "start": 134
                            }
                        ],
                        "text": "If we assume a uniform prior over all digits, then the posterior probability, P (mjI), for each model is proportional to the evidence [35], P (Ijm): P (Ijm) = Z P (Ij ;m)P ( jm)d (3) where is the vector of instantiation parameters for the model."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Bayesian methods for backpropagation networks\", in Models of Neural  Networks"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 17,
                                "start": 13
                            }
                        ],
                        "text": "Ha and Bunke [49] report error rates of 0:9 2:3% on the goodbs data set using 5 schemes."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Handwritten numeral recognition by perturbation method\", in  Proceedings"
            },
            "venue": {
                "fragments": [],
                "text": "Fourth International Workshop on Handwriting Recognition,"
            },
            "year": 1994
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Yuille, \\An analysis of the elastic net approach to the travelling salesman problem"
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1989
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 58,
                                "start": 54
                            }
                        ],
                        "text": "The output units compete using the \\softmax\" function [38] which guarantees that the 10 output values form a probability distribution."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Probabilistic interpretation of feedforward classi cation network outputs"
            },
            "venue": {
                "fragments": [],
                "text": "with  relationships to statistical pattern recognition.\", in Neuro-computing: algorithms, architectures  and applications, F. Fougelman-Soulie and J. H erault, Eds. NATO ASI series on systems and  computer science. Springer-Verlag"
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "\\Handprinted digit recognition: A comparison of algorithms"
            },
            "venue": {
                "fragments": [],
                "text": "Third international workshop on frontiers in handwriting recognition"
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "\\Probabilistic interpretation of feedforward classiication network outputs, with relationships to statistical pattern recognition.\", in Neuro-computing: algorithms, architectures and applications"
            },
            "venue": {
                "fragments": [],
                "text": "NATO ASI series on systems and computer science"
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 11,
                                "start": 7
                            }
                        ],
                        "text": "Widrow [21], also suggests the idea of using rubber templates to achieve fuzzy matches to a variety of natural objects and waveforms."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The `rubber-mask' technique{I"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Measurement and Analysis\", Pattern  Recognition, vol. 5, pp. 175{197"
            },
            "year": 1973
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 21,
                                "start": 17
                            }
                        ],
                        "text": "Some researchers [11], [4], [12] have boosted performance using combinations of classi ers."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Handprinted digit recognition: A comparison of algorithms\", in  Third international workshop on frontiers in handwriting recognition, Bu alo"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Yuille, \\Deformable templates for face recognition"
            },
            "venue": {
                "fragments": [],
                "text": "Journal of Cognitive Neuroscience"
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "\\Handwritten digit recognition using k-nearest-neighbor, radial-basis function, and backpropogation neural networks"
            },
            "venue": {
                "fragments": [],
                "text": "Neural computation"
            },
            "year": 1991
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 32,
            "methodology": 22,
            "result": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 70,
        "totalPages": 7
    },
    "page_url": "https://www.semanticscholar.org/paper/Using-Generative-Models-for-Handwritten-Digit-Revow-Williams/56efc84e0858f1e0a7cf052e5c4275d4c46c21c2?sort=total-citations"
}