{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "17154640"
                        ],
                        "name": "R. J. Korsan",
                        "slug": "R.-J.-Korsan",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Korsan",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. J. Korsan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1843259"
                        ],
                        "name": "J. Matheson",
                        "slug": "J.-Matheson",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Matheson",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Matheson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60267864,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "88cd5425230bbe92e8738f13523ad92c7c8c7def",
            "isKey": false,
            "numCitedBy": 1,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : Influence diagrams were originally conceived as a way of visually representing dependencies among random variables. It was recognized that they provide an effective means of communicating probabilistic information in complex, uncertain situations. They were soon generalized to include decision as well as chance variables. An earlier SRI report, Development of Automated Aids for Decision Analysis (Miller, et al., May 1976), describing influence diagrams and showed that they are a more fundamental way of capturing uncertain decision situations than the commonly used decision tree methods. This recognition held the promise that they might provide a basis for more efficient modeling and solution of decision problems. The report reviews the fundamentals of influence diagrams (adapted from Miller et al.) It illustrates with an example of toxic chemical testing how an analyst might use an automated influence diagram system. A first such system was implemented on the IBM 5110 mini-computer. This work allowed the development of computational algorithms in the APL language. Small decision problems are within the capabilities of this system. This development established the feasibility of implementing a comprehensive influence diagram system on a larger machine. Such a system could greatly assist decision makers and decision analysts. The final sections of this report explore questions which arose out of our work. (Author)"
            },
            "slug": "Pilot-Automated-Influence-Diagram-Decision-Aid.-Korsan-Matheson",
            "title": {
                "fragments": [],
                "text": "Pilot Automated Influence Diagram Decision Aid."
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The report reviews the fundamentals of influence diagrams and illustrates with an example of toxic chemical testing how an analyst might use an automated influence diagrams system, which established the feasibility of implementing a comprehensive influence diagram system on a larger machine."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1848965"
                        ],
                        "name": "M. Merkhofer",
                        "slug": "M.-Merkhofer",
                        "structuredName": {
                            "firstName": "Miley",
                            "lastName": "Merkhofer",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Merkhofer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69460546"
                        ],
                        "name": "Ellen B. Leaf",
                        "slug": "Ellen-B.-Leaf",
                        "structuredName": {
                            "firstName": "Ellen",
                            "lastName": "Leaf",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Ellen B. Leaf"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61083319,
            "fieldsOfStudy": [
                "Business"
            ],
            "id": "7fee3d3e29dbac2543ca7d5a2a1a50a3042967a1",
            "isKey": false,
            "numCitedBy": 8,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : As a result of a multiyear research effort conducted for the Operational Decision Aids Program of the Office of Naval Research, SRI International has developed a computer-assisted, step-by-step procedure for establishing the structure of a decision problem. The structuring process consists of three phases: preliminary structuring. modeling, and expansion. Steps in the preliminary structuring phase elicit the basic factors on which the decision will be based, including decision objectives, alternatives, and critical uncertainties. The modeling phase organizes these factors into a formal decision model whose analysis provides insights and assistance in the identification of a tentative decision strategy. The expansion phase refines the analysis of those areas of the model to which the decision is most sensitive. Aids for implementing the process, including an interactive computer program with graphics, have been developed and subjected to preliminary testing. (Author)"
            },
            "slug": "A-Computer-Aided-Decision-Structuring-Process.-Merkhofer-Leaf",
            "title": {
                "fragments": [],
                "text": "A Computer-Aided Decision Structuring Process."
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "SRI International has developed a computer-assisted, step-by-step procedure for establishing the structure of a decision problem, which consists of three phases: preliminary structuring, modeling, and expansion."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1848965"
                        ],
                        "name": "M. Merkhofer",
                        "slug": "M.-Merkhofer",
                        "structuredName": {
                            "firstName": "Miley",
                            "lastName": "Merkhofer",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Merkhofer"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": ") When we evaluate value of information on an influence diagram, we must explicitly specify which information and when it will become available (Merkhofer 1977)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 33970789,
            "fieldsOfStudy": [
                "Business"
            ],
            "id": "9b8caa2ce24e9412e802b8a7afadec739df066d0",
            "isKey": false,
            "numCitedBy": 80,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper explores the effect of decision flexibility on the value of information. The usefulness of calculating the value of information under various assumptions concerning decision flexibility is illustrated with a simple economic example. An upper limit to the value of information given some level of flexibility is the expected value of perfect information given undiminished flexibility EVPIGUF. By approximating an arbitrary smooth value function with a quadratic equation, first order characteristics of the EVPIGUF are identified. Finally, it is shown that sensitivity analysis can be used as a basis for obtaining simplified approximations for EVPIGUF's."
            },
            "slug": "The-Value-of-Information-Given-Decision-Flexibility-Merkhofer",
            "title": {
                "fragments": [],
                "text": "The Value of Information Given Decision Flexibility"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145102066"
                        ],
                        "name": "A. C. Miller",
                        "slug": "A.-C.-Miller",
                        "structuredName": {
                            "firstName": "Allen",
                            "lastName": "Miller",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. C. Miller"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1848965"
                        ],
                        "name": "M. Merkhofer",
                        "slug": "M.-Merkhofer",
                        "structuredName": {
                            "firstName": "Miley",
                            "lastName": "Merkhofer",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Merkhofer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "27581584"
                        ],
                        "name": "R. Howard",
                        "slug": "R.-Howard",
                        "structuredName": {
                            "firstName": "Ronald",
                            "lastName": "Howard",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Howard"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1843259"
                        ],
                        "name": "J. Matheson",
                        "slug": "J.-Matheson",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Matheson",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Matheson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34394424"
                        ],
                        "name": "T. R. Rice",
                        "slug": "T.-R.-Rice",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Rice",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. R. Rice"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60682317,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "99bf0a37914c95293f56076d2463daeda65985bd",
            "isKey": false,
            "numCitedBy": 72,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : This report summarizes research undertaken to initiate development of a system of automated decision aids. The purpose of these aids is to facilitate the application of decision analysis to major decisions within the Department of Defense. The report contains: (1) a characterization of the spectrum of decision situations that are encountered in practice and an exploration of the implications of these characteristics for automated decision aids; (2) a description of the types of decision models available for analyzing various decision situations; (3) a description of the process by which decision models are constructed; and (4) an identification of several modeling concepts that provide a basis for designing and constructing a pilot-level system of automated decision aids."
            },
            "slug": "Development-of-Automated-Aids-for-Decision-Analysis-Miller-Merkhofer",
            "title": {
                "fragments": [],
                "text": "Development of Automated Aids for Decision Analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 83,
                "text": "This report summarizes research undertaken to initiate development of a system of automated decision aids to facilitate the application of decision analysis to major decisions within the Department of Defense."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144873562"
                        ],
                        "name": "R. Bellman",
                        "slug": "R.-Bellman",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Bellman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Bellman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "The chance and decision node removal transformations are based on results by Olmsted, but are really just the basic steps in evaluating a stochastic dynamic program (Bellman 1957)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 24158615,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "7a6b8a2f80436acdcb201144238c7a49735eb1e9",
            "isKey": false,
            "numCitedBy": 7712,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Little has been done in the study of these intriguing questions, and I do not wish to give the impression that any extensive set of ideas exists that could be called a \"theory.\" What is quite surprising, as far as the histories of science and philosophy are concerned, is that the major impetus for the fantastic growth of interest in brain processes, both psychological and physiological, has come from a device, a machine, the digital computer. In dealing with a human being and a human society, we enjoy the luxury of being irrational, illogical, inconsistent, and incomplete, and yet of coping. In operating a computer, we must meet the rigorous requirements for detailed instructions and absolute precision. If we understood the ability of the human mind to make effective decisions when confronted by complexity, uncertainty, and irrationality then we could use computers a million times more effectively than we do. Recognition of this fact has been a motivation for the spurt of research in the field of neurophysiology. The more we study the information processing aspects of the mind, the more perplexed and impressed we become. It will be a very long time before we understand these processes sufficiently to reproduce them. In any case, the mathematician sees hundreds and thousands of formidable new problems in dozens of blossoming areas, puzzles galore, and challenges to his heart's content. He may never resolve some of these, but he will never be bored. What more can he ask?"
            },
            "slug": "Dynamic-Programming-Bellman",
            "title": {
                "fragments": [],
                "text": "Dynamic programming."
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The more the authors study the information processing aspects of the mind, the more perplexed and impressed they become, and it will be a very long time before they understand these processes sufficiently to reproduce them."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1966
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "68984513"
                        ],
                        "name": "Scott M. Olmsted",
                        "slug": "Scott-M.-Olmsted",
                        "structuredName": {
                            "firstName": "Scott",
                            "lastName": "Olmsted",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Scott M. Olmsted"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 59682188,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "365d4a85981f5b9d1bd297baa6e9f5b139f304bb",
            "isKey": false,
            "numCitedBy": 272,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "On-representing-and-solving-decision-problems-Olmsted",
            "title": {
                "fragments": [],
                "text": "On representing and solving decision problems"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "It is easy to determine whether an influence diagram is regular by invoking the following well-known result from a graph theory (Lawler 1976)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Combinatorial optimization : networks and matroids"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1976
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 1,
            "methodology": 2
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 7,
        "totalPages": 1
    },
    "page_url": "https://www.semanticscholar.org/paper/Evaluating-Influence-Diagrams-Shachter/9e0daca0acc6ee3baf7573fe2e2b3cc94276e7f4?sort=total-citations"
}