{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145482214"
                        ],
                        "name": "A. Korn",
                        "slug": "A.-Korn",
                        "structuredName": {
                            "firstName": "Axel",
                            "lastName": "Korn",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Korn"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122374928,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "a921ba1acb72480f85d31defae2a6493248a9d97",
            "isKey": false,
            "numCitedBy": 7,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "A simple criterion is proposed for the selection of contour points from a hierarchy of filter responses. The operators are the first derivatives of 2-dimensional Gaussians with different widths whose positive and negative parts are separately normalized to +1 and -1, respectively. The responses of the convolution of this 2-dimensional gradient operator with a gray value picture are vectors whose magnitudes and phases give useful information about differences of mean gray values across contours, and about the exact direction of the maximal intensity changes. Closed chains of contour points define regions whose gray values can be reconstructed approximately from the attributes of contour points. The regions of the segmented pictures are appropriate features which facilitate the matching process with scene models."
            },
            "slug": "Combination-Of-Different-Space-Frequency-Filters-In-Korn",
            "title": {
                "fragments": [],
                "text": "Combination Of Different Space Frequency Filters For Modeling Edges And Surfaces In Gray-Value Pictures"
            },
            "venue": {
                "fragments": [],
                "text": "Other Conferences"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31857045"
                        ],
                        "name": "E. Hildreth",
                        "slug": "E.-Hildreth",
                        "structuredName": {
                            "firstName": "Ellen",
                            "lastName": "Hildreth",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Hildreth"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 33421355,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "82082c783bfbab54681976473bb9e95a95c0b0a4",
            "isKey": false,
            "numCitedBy": 202,
            "numCiting": 42,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-detection-of-intensity-changes-by-computer-and-Hildreth",
            "title": {
                "fragments": [],
                "text": "The detection of intensity changes by computer and biological vision systems"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Vis. Graph. Image Process."
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31857045"
                        ],
                        "name": "E. Hildreth",
                        "slug": "E.-Hildreth",
                        "structuredName": {
                            "firstName": "Ellen",
                            "lastName": "Hildreth",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Hildreth"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2150419,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "9009c9685754346deb93f316144a9da1f70ffcd8",
            "isKey": false,
            "numCitedBy": 7031,
            "numCiting": 62,
            "paperAbstract": {
                "fragments": [],
                "text": "A theory of edge detection is presented. The analysis proceeds in two parts. (1) Intensity changes, which occur in a natural image over a wide range of scales, are detected separately at different scales. An appropriate filter for this purpose at a given scale is found to be the second derivative of a Gaussian, and it is shown that, provided some simple conditions are satisfied, these primary filters need not be orientation-dependent. Thus, intensity changes at a given scale are best detected by finding the zero values of ∇2G(x, y)* I(x, y) for image I, where G(x, y) is a two-dimensional Gaussian distribution and ∇2 is the Laplacian. The intensity changes thus discovered in each of the channels are then represented by oriented primitives called zero-crossing segments, and evidence is given that this representation is complete. (2) Intensity changes in images arise from surface discontinuities or from reflectance or illumination boundaries, and these all have the property that they are spatially localized. Because of this, the zero-crossing segments from the different channels are not independent, and rules are deduced for combining them into a description of the image. This description is called the raw primal sketch. The theory explains several basic psychophysical findings, and the operation of forming oriented zero-crossing segments from the output of centre-surround ∇2G filters acting on the image forms the basis for a physiological model of simple cells (see Marr & Ullman 1979)."
            },
            "slug": "Theory-of-edge-detection-Marr-Hildreth",
            "title": {
                "fragments": [],
                "text": "Theory of edge detection"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The theory of edge detection explains several basic psychophysical findings, and the operation of forming oriented zero-crossing segments from the output of centre-surround ∇2G filters acting on the image forms the basis for a physiological model of simple cells."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2076198688"
                        ],
                        "name": "Y. G. Leclerc",
                        "slug": "Y.-G.-Leclerc",
                        "structuredName": {
                            "firstName": "Yvan",
                            "lastName": "Leclerc",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. G. Leclerc"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1698824"
                        ],
                        "name": "S. Zucker",
                        "slug": "S.-Zucker",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Zucker",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Zucker"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 15718126,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "533ff5690375943d542ed59ad7f072a8407ee91a",
            "isKey": false,
            "numCitedBy": 98,
            "numCiting": 50,
            "paperAbstract": {
                "fragments": [],
                "text": "The detailed structure of intensities in the local neighborhood of an edge can often indicate the nature of the physical event givinig rise to that edge. We argue that the limit, as we approach arbitrarily close to either side of an edge, of such image parameters as type of texture, texture gradient, color, appropriate directional derivatives of intensity, etc., is a key aspect of this structure. However, the general problem of capturing this local structure is surprisingly complex. Thus, we restrict ourselves in this paper to a relatively simple domain¿one-dimensional cuts through idealized images modeled by piecewise smooth (C1) functions corrupted by Gaussian noise. Within this domain, we define local structure to be the limit of the uncorrupted intensity and of its derivatives as we approach arbitrarily close to either side of a discontinuity. We develop a technique that captures this local structure while simultaneously locating the discontinuities, and demonstrate that these tasks are in fact inseparable. The technique is an extension, using estimation theory, of the classical definition of discontinuity. It handles, in a consistent fashion, both jump discontinuities in the function and jump discontinuities in its first derivative (so-called step-edges are a special case of the former and roof-edges of the latter). It also integrates, again in a consistent fashion, information derived from a number of different neighborhood sizes."
            },
            "slug": "The-Local-Structure-of-Image-Discontinuities-in-One-Leclerc-Zucker",
            "title": {
                "fragments": [],
                "text": "The Local Structure of Image Discontinuities in One Dimension"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "A technique is developed that captures this local structure while simultaneously locating the discontinuities, and it is demonstrated that these tasks are in fact inseparable."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144721252"
                        ],
                        "name": "H. Nagel",
                        "slug": "H.-Nagel",
                        "structuredName": {
                            "firstName": "Hans-Hellmut",
                            "lastName": "Nagel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Nagel"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 28394904,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "f52207ea03f4e7ce52e9fbbdfc3c909f6c17e9c1",
            "isKey": false,
            "numCitedBy": 521,
            "numCiting": 49,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Displacement-vectors-derived-from-second-order-in-Nagel",
            "title": {
                "fragments": [],
                "text": "Displacement vectors derived from second-order intensity variations in image sequences"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Vis. Graph. Image Process."
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1729041"
                        ],
                        "name": "J. Canny",
                        "slug": "J.-Canny",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Canny",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Canny"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 119706616,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9cbd5a66c1198d5a14f13e03483b69321024444b",
            "isKey": false,
            "numCitedBy": 1030,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : The problem of detecting intensity changes in images is canonical in vision. Edge detection operators are typically designed to optimally estimate first or second derivative over some (usually small) support. Other criteria such as output signal to noise ratio or bandwidth have also been been argued for. This thesis is an attempt to formulate a set of edge detection criteria that capture as directly as possible the desirable properties of an edge operator. Variational techniques are used to find a solution over the space of all linear shift invariant operators. The first criterion is that the detector have low probability of error i.e. failing to mark edges or falsely marking non-edges. The second is that the marked points should b The third criterion is that there should be low probability of more than one response to a single edge. The technique is used to find optimal operators for step edges and for extended impulse profiles (ridges or valleys in two dimensions). The extension of the one dimensional operators to two dimensions is then discussed. The result is a set of operators of varying width, length and orientation. The problem of combining these outputs into a single description is discussed, and a set of heuristics for the integration are given. (Author)"
            },
            "slug": "Finding-Edges-and-Lines-in-Images-Canny",
            "title": {
                "fragments": [],
                "text": "Finding Edges and Lines in Images"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This thesis is an attempt to formulate a set of edge detection criteria that capture as directly as possible the desirable properties of an edge operator."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2122867"
                        ],
                        "name": "Raul Machuca",
                        "slug": "Raul-Machuca",
                        "structuredName": {
                            "firstName": "Raul",
                            "lastName": "Machuca",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Raul Machuca"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "98448059"
                        ],
                        "name": "K. Phillips",
                        "slug": "K.-Phillips",
                        "structuredName": {
                            "firstName": "Keith",
                            "lastName": "Phillips",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Phillips"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 10139235,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "d367a7305b26d0f6fbe45e85a8ffe8ab4afec718",
            "isKey": false,
            "numCitedBy": 102,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "We use rotational and curvature properties of vector fields to identify critical features of an image. Using vector analysis and dif-ferential geometry, we establish the properties needed, and then use these properties in three ways. First, our results make it theoretically possible to identify extremal edges of an intensity function f(x, y) of two variables by considering the gradient vector field V = ¿f. There is also enough information in ¿f to find regions of high curvature (i.e., high curvature of the level paths of f). For color images, we use the vector field V = (I, Q). In application, the image is partitioned into a grid of squares. On the boundary of each square, V/|V| is sampled, and these unit vectors are used as the tangents of a curve ¿. The rotation number (or topological degree) ¿(¿) and the average curvature f|¿¿| are computed for each square. Analysis of these numbers yields infor-mation on edges and curvature. Experimental results from both simu-lated and real data are described."
            },
            "slug": "Applications-of-Vector-Fields-to-Image-Processing-Machuca-Phillips",
            "title": {
                "fragments": [],
                "text": "Applications of Vector Fields to Image Processing"
            },
            "tldr": {
                "abstractSimilarityScore": 61,
                "text": "The results make it theoretically possible to identify extremal edges of an intensity function f(x, y) of two variables by considering the gradient vector field V = ¿f, and establish the properties needed, and then use these properties in three ways."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145730992"
                        ],
                        "name": "V. Torre",
                        "slug": "V.-Torre",
                        "structuredName": {
                            "firstName": "Vincent",
                            "lastName": "Torre",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Torre"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1065794,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "a8059c598e4f9643eb040685af0d6e7055391048",
            "isKey": false,
            "numCitedBy": 1214,
            "numCiting": 59,
            "paperAbstract": {
                "fragments": [],
                "text": "Edge detection is the process that attempts to characterize the intensity changes in the image in terms of the physical processes that have originated them. A critical, intermediate goal of edge detection is the detection and characterization of significant intensity changes. This paper discusses this part of the edge detection problem. To characterize the types of intensity changes derivatives of different types, and possibly different scales, are needed. Thus, we consider this part of edge detection as a problem in numerical differentiation. We show that numerical differentiation of images is an ill-posed problem in the sense of Hadamard. Differentiation needs to be regularized by a regularizing filtering operation before differentiation. This shows that this part of edge detection consists of two steps, a filtering step and a differentiation step. Following this perspective, the paper discusses in detail the following theoretical aspects of edge detection. 1) The properties of different types of filters-with minimal uncertainty, with a bandpass spectrum, and with limited support-are derived. Minimal uncertainty filters optimize a tradeoff between computational efficiency and regularizing properties. 2) Relationships among several 2-D differential operators are established. In particular, we characterize the relation between the Laplacian and the second directional derivative along the gradient. Zero crossings of the Laplacian are not the only features computed in early vision. 3) Geometrical and topological properties of the zero crossings of differential operators are studied in terms of transversality and Morse theory."
            },
            "slug": "On-Edge-Detection-Torre-Poggio",
            "title": {
                "fragments": [],
                "text": "On Edge Detection"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is shown that numerical differentiation of images is an ill-posed problem in the sense of Hadamard, and that this part of edge detection consists of two steps, a filtering step and a differentiation step."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1710238"
                        ],
                        "name": "R. Haralick",
                        "slug": "R.-Haralick",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Haralick",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Haralick"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 3358665,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "3b5cff5f874b7c7056d4ac58fc976458c2ab95a7",
            "isKey": false,
            "numCitedBy": 933,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "We use the facet model to accomplish step edge detection. The essence of the facet model is that any analysis made on the basis of the pixel values in some neighborhood has its final authoritative interpretation relative to the underlying gray tone intensity surface of which the neighborhood pixel values are observed noisy samples. With regard to edge detection, we define an edge to occur in a pixel if and only if there is some point in the pixel's area having a negatively sloped zero crossing of the second directional derivative taken in the direction of a nonzero gradient at the pixel's center. Thus, to determine whether or not a pixel should be marked as a step edge pixel, its underlying gray tone intensity surface must be estimated on the basis of the pixels in its neighborhood. For this, we use a functional form consisting of a linear combination of the tensor products of discrete orthogonal polynomials of up to degree three. The appropriate directional derivatives are easily computed from this kind of a function. Upon comparing the performance of this zero crossing of second directional derivative operator with the Prewitt gradient operator and the Marr-Hildreth zero crossing of the Laplacian operator, we find that it is the best performer; next is the Prewitt gradient operator. The Marr-Hildreth zero crossing of the Laplacian operator performs the worst."
            },
            "slug": "Digital-Step-Edges-from-Zero-Crossing-of-Second-Haralick",
            "title": {
                "fragments": [],
                "text": "Digital Step Edges from Zero Crossing of Second Directional Derivatives"
            },
            "tldr": {
                "abstractSimilarityScore": 56,
                "text": "The facet model is used to accomplish step edge detection and the Marr-Hildreth zero crossing of the Laplacian operator is found that it is the best performer; next is the Prewitt gradient operator."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32376492"
                        ],
                        "name": "A. Korn",
                        "slug": "A.-Korn",
                        "structuredName": {
                            "firstName": "Axel",
                            "lastName": "Korn",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Korn"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 58791725,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "e3d1f6452a8e2c6623613b9b099190a2daa391ef",
            "isKey": false,
            "numCitedBy": 4,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "The visual system is considered as an information processing system where the information processing task may consist in the localization and recognition of objects in the 3-dimensional physical world. After some definitions concerning terms like physical world and its projection, image,feature, and segmentation the processing in the first stages of the visual system (low-level vision) is discussed. A computational theory of retinal filtering is presented and related to the anatomy and physiology of the retina as well as to psychophysical results suggesting that a spatial-frequency filtering is performed in the human visual system. Furthermore neurophysiological and psycho-physical data suggest that the segmentation is the next stage after retinal processing. Here surface elements are extracted which follow from motion, texture, or the depth of objects (Stereopsis) relative to the observer. Some results of our simulation of low-level vision (retina, primary visual cortex) are presented for natural images. Particularly these results are related to the extraction of contour points, and edges for the reconstruction of the original gray values and the description of forms, and to the evaluation of statistical parameters for the description of textures in different spatial-frequency domains."
            },
            "slug": "Das-visuelle-System-als-Merkmalfilter-Korn",
            "title": {
                "fragments": [],
                "text": "Das visuelle System als Merkmalfilter"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "A computational theory of retinal filtering is presented and results suggest that a spatial-frequency filtering is performed in the human visual system and neurophysiological and psycho-physical data suggest that the segmentation is the next stage after retinal processing."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143766793"
                        ],
                        "name": "A. Rosenfeld",
                        "slug": "A.-Rosenfeld",
                        "structuredName": {
                            "firstName": "Azriel",
                            "lastName": "Rosenfeld",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rosenfeld"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60494655,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "36067c830559173fc667cdf88ebc096500ebb9b9",
            "isKey": false,
            "numCitedBy": 627,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "I Image Pyramids and Their Uses.- 1. Some Useful Properties of Pyramids.- 2. The Pyramid as a Structure for Efficient Computation.- II Architectures and Systems.- 3. Multiprocessor Pyramid Architectures for Bottom-Up Image Analysis.- 4. Visual and Conceptual Hierarchy - A Paradigm for Studies of Automated Generation of Recognition Strategies.- 5. Multiresolution Processing.- 6. The Several Steps from Icon to Symbol Using Structured Cone/ Pyramids.- III Modelling, Processing, and Segmentation.- 7. Time Series Models for Multiresolution Images.- 8. Node Linking Strategies in Pyramids for Image Segmentation.- 9. Multilevel Image Reconstruction.- 10. Sorting, Histogramming, and Other Statistical Operations on a Pyramid Machine.- IV Features and Shape Analysis.- 11. A Hierarchical Image Analysis System Based Upon Oriented Zero Crossings of Bandpassed Images.- 12. A Multiresolution Representation for Shape.- 13. Multiresolution Feature Encodings.- 14. Multiple-Size Operators and Optimal Curve Finding.- V Region Representation and Surface Interpolation.- 15. A Tutorial on Quadtree Research.- 16. Multiresolution 3-d Image Processing and Graphics.- 17. Multilevel Reconstruction of Visual Surfaces: Variational Principles and Finite-Element Representations.- VI Time-Varying Analysis.- 18. Multilevel Relaxation in Low-Level Computer Vision.- 19. Region Matching in Pyramids for Dynamic Scene Analysis.- 20. Hierarchical Estimation of Spatial Properties from Motion.- VII Applications.- 21. Multiresolution Microscopy.- 22. Two-Resolution Detection of Lung Tumors in Chest Radiographs.- Index of Contributors."
            },
            "slug": "Multiresolution-image-processing-and-analysis-Rosenfeld",
            "title": {
                "fragments": [],
                "text": "Multiresolution image processing and analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "A Hierarchical Image Analysis System Based Upon Oriented Zero Crossings of Bandpassed Images and a Tutorial on Quadtree Research."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145687022"
                        ],
                        "name": "J. Crowley",
                        "slug": "J.-Crowley",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Crowley",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Crowley"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1739829"
                        ],
                        "name": "A. Sanderson",
                        "slug": "A.-Sanderson",
                        "structuredName": {
                            "firstName": "Arthur",
                            "lastName": "Sanderson",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Sanderson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14999508,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "543c68ff39001f9056cf970016c6c6ead3ac6e50",
            "isKey": false,
            "numCitedBy": 100,
            "numCiting": 39,
            "paperAbstract": {
                "fragments": [],
                "text": "One approach to pattern classification is to match a structural description of a pattern to models which describe the structural properties of pattern classes. The central problem in structural pattern matching is to determine the correspondence between the symbols which comprise a model and symbols which describe a pattern. The difficulty of determining this correspondence depends critically on the representation that is used to describe patterns. This correspondence presents a probabilistic representation for structural models of pattern classes. Both pattern descriptions and models for pattern classes are based on symbols which represent grayscale information at multiple resolutions. A pattern description is given by a tree of symbols with attribute values. Structural models are represented by a tree of symbols with probabilistic attributes. The position and scale (resolution) of the symbols, as well as other ``features,'' are represented by these attributes. An algorithm is presented for determining the correspondence between symbols in a description of a pattern and symbols in a model of a pattern class. This algorithm uses the connectivity between symbols at different scales to constrain the search for correspondence. An interactive training program for learning models of pattern classes is described, and some conclusions from the work are presented."
            },
            "slug": "Multiple-Resolution-Representation-and-Matching-of-Crowley-Sanderson",
            "title": {
                "fragments": [],
                "text": "Multiple Resolution Representation and Probabilistic Matching of 2-D Gray-Scale Shape"
            },
            "tldr": {
                "abstractSimilarityScore": 50,
                "text": "An algorithm is presented for determining the correspondence between symbols in a description of a pattern and symbols in the model of apattern class, which uses the connectivity between symbols at different scales to constrain the search for correspondence."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1710238"
                        ],
                        "name": "R. Haralick",
                        "slug": "R.-Haralick",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Haralick",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Haralick"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143631704"
                        ],
                        "name": "L. Watson",
                        "slug": "L.-Watson",
                        "structuredName": {
                            "firstName": "Layne",
                            "lastName": "Watson",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Watson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1821867"
                        ],
                        "name": "T. Laffey",
                        "slug": "T.-Laffey",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Laffey",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Laffey"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 119602828,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "841106fba2b291a4cc995ee3deb8cf08e2783d88",
            "isKey": false,
            "numCitedBy": 301,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "A complete mathematical treatment is given for describing the topographic primal sketch of the underlying gray tone intensity surface of a digital image. Each picture element is independently classified and assigned a unique descriptive label, invariant under monotonically increasing gray tone transformations from the set (peak, pit, ridge, ravine, saddle, flat, and hillside), with hillside having subcategories (inflection point, slope, convex hill, concave hill, and saddle hill). The topographic classification is based on the first and second directional derivatives of the estimated image- intensity surface. A local, facet model, two-dimensional, cubic polynomial fit is done to estimate the image-intensity surface. Zero-crossings of the first directional derivative are identified as locations of interest in the image."
            },
            "slug": "The-Topographic-Primal-Sketch-Haralick-Watson",
            "title": {
                "fragments": [],
                "text": "The Topographic Primal Sketch"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1809905"
                        ],
                        "name": "A. Witkin",
                        "slug": "A.-Witkin",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Witkin",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Witkin"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7096897,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a26f893c224ed6e3df1f37479de0e774a4cae237",
            "isKey": false,
            "numCitedBy": 2873,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Scale-Space-Filtering-Witkin",
            "title": {
                "fragments": [],
                "text": "Scale-Space Filtering"
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1809905"
                        ],
                        "name": "A. Witkin",
                        "slug": "A.-Witkin",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Witkin",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Witkin"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11755124,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f58b22395f9585c3da65bbc948c67eed3377f701",
            "isKey": false,
            "numCitedBy": 1126,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "The extrema in a signal and its first few derivatives provide a useful general purpose qualitative description for many kinds of signals. A fundamental problem in computing such descriptions is scale: a derivative must be taken over some neighborhood, but there is seldom a principled basis for choosing its size. Scale-space filtering is a method that describes signals qualitatively, managing the ambiguity of scale in an organized and natural way. The signal is first expanded by convolution with gaussian masks over a continuum of sizes. This \"scale-space\" image is then collapsed, using its qualitative structure, into a tree providing a concise but complete qualitative description covering all scales of observation. The description is further refined by applying a stability criterion, to identify events that persist of large changes in scale."
            },
            "slug": "Scale-space-filtering:-A-new-approach-to-Witkin",
            "title": {
                "fragments": [],
                "text": "Scale-space filtering: A new approach to multi-scale description"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "Scale-space filtering is a method that describes signals qualitatively, managing the ambiguity of scale in an organized and natural way."
            },
            "venue": {
                "fragments": [],
                "text": "ICASSP"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145680634"
                        ],
                        "name": "V. Berzins",
                        "slug": "V.-Berzins",
                        "structuredName": {
                            "firstName": "Valdis",
                            "lastName": "Berzins",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Berzins"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 121976461,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "f6b1b73aed54a52bd92990ea87ec9092c1aec8d8",
            "isKey": false,
            "numCitedBy": 194,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Accuracy-of-laplacian-edge-detectors-Berzins",
            "title": {
                "fragments": [],
                "text": "Accuracy of laplacian edge detectors"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1733113"
                        ],
                        "name": "T. Kanade",
                        "slug": "T.-Kanade",
                        "structuredName": {
                            "firstName": "Takeo",
                            "lastName": "Kanade",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Kanade"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62150888,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6224f11cdc12d1506676e108934691c15cccddd2",
            "isKey": false,
            "numCitedBy": 106,
            "numCiting": 43,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Region-segmentation:-Signal-vs-semantics-Kanade",
            "title": {
                "fragments": [],
                "text": "Region segmentation: Signal vs semantics"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145730991"
                        ],
                        "name": "V. Torre",
                        "slug": "V.-Torre",
                        "structuredName": {
                            "firstName": "Vincent",
                            "lastName": "Torre",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Torre"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 34584324,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "8cb81e1bc0f16c6a757163b962268d63a32c3a31",
            "isKey": false,
            "numCitedBy": 155,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "While in classical optics the problem is to determine the images of physical objects, vision is confronted with the inverse problem of recovering three-dimensional shape from the light distribution in the image. Most processes of early vision such as stereomatching, computation of motion and all the ``structure from\" processes can be regarded as solutions to inverse problems. This common characteristic of early vision can be formalized---{\\it most early vision problems are ``ill-posed problems\" in the sense of Hadamard}. We will show that a mathematical theory developed for regularizing ill-posed problems leads in a natural way to the solution of early vision problems in terms of variational principles of a certain class. This is a new theoretical framework for some of the variational solutions already obtained in the analysis of early vision processes. It also shows how several other problems in early vision can be approached and solved."
            },
            "slug": "Ill-Posed-Problems-and-Regularization-Analysis-in-Poggio-Torre",
            "title": {
                "fragments": [],
                "text": "Ill-Posed Problems and Regularization Analysis in Early Vision"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1716904"
                        ],
                        "name": "J. Koenderink",
                        "slug": "J.-Koenderink",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Koenderink",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Koenderink"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2585959"
                        ],
                        "name": "A. V. van Doorn",
                        "slug": "A.-V.-van-Doorn",
                        "structuredName": {
                            "firstName": "Andrea",
                            "lastName": "van Doorn",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. V. van Doorn"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 39009922,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "8718bdea2c3aedc550f09d2709d2d75b25cbfab9",
            "isKey": false,
            "numCitedBy": 256,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "It is shown, by elementary mathematical reasoning, that visual contours can only be concave at their endpoints. This simple natural fact is contrasted with general mannerisms of draftsmen: in the great majority of cases contours are drawn to have convex ends. It is argued that this results from our general concept of solid shapes: a general shape is conceived of as a conglomerate of convex (‘ovoid’) elementary shapes, these shapes act as ‘figure’ and the way they are glued together is treated as the—relatively unimportant—‘ground’. The hypothesis is supported through citations from academic-art literature. An attempt is made to give a geometrical specification of just what draftsmen draw if they disregard the contour."
            },
            "slug": "The-Shape-of-Smooth-Objects-and-the-Way-Contours-Koenderink-Doorn",
            "title": {
                "fragments": [],
                "text": "The Shape of Smooth Objects and the Way Contours End"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "It is argued that a general shape is conceived of as a conglomerate of convex (‘ovoid’) elementary shapes, these shapes act as ‘figure’ and the way they are glued together is treated as the—relatively unimportant—‘ground’."
            },
            "venue": {
                "fragments": [],
                "text": "Perception"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143750010"
                        ],
                        "name": "R. Hartley",
                        "slug": "R.-Hartley",
                        "structuredName": {
                            "firstName": "Ralph",
                            "lastName": "Hartley",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Hartley"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 28707466,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "93bf3804db027644bf1ecede9aed0379d3b237e9",
            "isKey": false,
            "numCitedBy": 29,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-Gaussian-weighted-multiresolution-edge-detector-Hartley",
            "title": {
                "fragments": [],
                "text": "A Gaussian-weighted multiresolution edge detector"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Vis. Graph. Image Process."
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2544594"
                        ],
                        "name": "J. Frisby",
                        "slug": "J.-Frisby",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Frisby",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Frisby"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 143520256,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "ce3bdb7cea0935025e541e56c3f6ebacb9cf29ae",
            "isKey": false,
            "numCitedBy": 280,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Seeing:-Illusion,-Brain-and-Mind-Frisby",
            "title": {
                "fragments": [],
                "text": "Seeing: Illusion, Brain and Mind"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144721252"
                        ],
                        "name": "H. Nagel",
                        "slug": "H.-Nagel",
                        "structuredName": {
                            "firstName": "Hans-Hellmut",
                            "lastName": "Nagel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Nagel"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60574369,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "72825790592f015e9471105c8123b547f153a154",
            "isKey": false,
            "numCitedBy": 21,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Principles-of-(low-level)-computer-vision-Nagel",
            "title": {
                "fragments": [],
                "text": "Principles of (low-level) computer vision"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1691804"
                        ],
                        "name": "D. Ballard",
                        "slug": "D.-Ballard",
                        "structuredName": {
                            "firstName": "Dana",
                            "lastName": "Ballard",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Ballard"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48726084"
                        ],
                        "name": "Christopher M. Brown",
                        "slug": "Christopher-M.-Brown",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Brown",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Christopher M. Brown"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 195995446,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1e26162d70f04da2091d1aa011f6999b76cbddff",
            "isKey": false,
            "numCitedBy": 4640,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Computer-Vision-Ballard-Brown",
            "title": {
                "fragments": [],
                "text": "Computer Vision"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1982
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Author’s reply to Grimson and Hildreth,"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Ar7ul. Much. Intell., vol"
            },
            "year": 1985
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 24,
        "totalPages": 3
    },
    "page_url": "https://www.semanticscholar.org/paper/Toward-a-Symbolic-Representation-of-Intensity-in-Korn/45d353aec60b2ce725761e8847b81222633da6c9?sort=total-citations"
}