{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31857045"
                        ],
                        "name": "E. Hildreth",
                        "slug": "E.-Hildreth",
                        "structuredName": {
                            "firstName": "Ellen",
                            "lastName": "Hildreth",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Hildreth"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 62198913,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "c416a885cc36515740ef8dfa9220366fa2a379f8",
            "isKey": false,
            "numCitedBy": 660,
            "numCiting": 56,
            "paperAbstract": {
                "fragments": [],
                "text": "From the Publisher: \nComputer scientists designing machine vision systems, psychologists working in visual perception, visual neurophysiologists, and theoretical biologists will derive a deeper understanding of visual function - in particular the computations that the human visual system uses to analyze motion-from the important research reported in this book. \nThe organization of movement in the changing image that reaches the eye provides our visual system with a valuable source of information for analyzing the structure of our surroundings. This book examines the measurement of this movement and the use of relative movement to locate the boundaries of physical objects in the environment. It investigates the nature of the computations that are necessary to perform this analysis by any vision system, biological or artificial. \nThe author first defines the goals of these visual tasks, reveals the properties of the physical world that a vision system can rely upon to achieve such goals, and suggests general methods that can be used to carry out the tasks. From the general methods, she designs algorithms specifying a particular sequence of computations that a vision system can execute to perform these visual tasks. These algorithms are implemented on a computer system under a variety of circumstances. Combined with the traditional approaches of psychology and neurophysiology, this computational approach provides an exciting analysis of visual function, raising many new questions about the human vision system for further investigation. \nEllen Catherine Hildreth received her doctorate from MIT. She is a Research Scientist in the MIT Artificial Intelligence Laboratory and associate director of theCenter for Biological Information Processing at the Whitaker College of Health Sciences, Technology, and Management. The Measurement of Visual Motion is an ACM Distinguished Dissertation."
            },
            "slug": "Measurement-of-Visual-Motion-Hildreth",
            "title": {
                "fragments": [],
                "text": "Measurement of Visual Motion"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "Combined with the traditional approaches of psychology and neurophysiology, this computational approach provides an exciting analysis of visual function, raising many new questions about the human vision system for further investigation."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743045"
                        ],
                        "name": "S. Ullman",
                        "slug": "S.-Ullman",
                        "structuredName": {
                            "firstName": "Shimon",
                            "lastName": "Ullman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ullman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11995230,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "b81afd190adcd52190fa31af0841dd7b9695380e",
            "isKey": false,
            "numCitedBy": 876,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "The interpretation of structure from motion is examined from a computional point of view. The question addressed is how the three dimensional structure and motion of objects can be inferred from the two dimensional transformations of their projected images when no three dimensional information is conveyed by the individual projections. The following scheme is proposed: (i) divide the image into groups of four elements each; (ii) test each group for a rigid interpretation; (iii) combine the results obtained in (ii). It is shown that this scheme will correctly decompose scenes containing arbitrary rigid objects in motion, recovering their three dimensional structure and motion. The analysis is based primarily on the ʻstructure from motion’ theorem which states that the structure of four non-coplanar points is recoverable from three orthographic projections. The interpretation scheme is extended to cover perspective projections, and its psychological relevance is discussed."
            },
            "slug": "The-interpretation-of-structure-from-motion-Ullman",
            "title": {
                "fragments": [],
                "text": "The interpretation of structure from motion"
            },
            "tldr": {
                "abstractSimilarityScore": 55,
                "text": "It is shown that this scheme will correctly decompose scenes containing arbitrary rigid objects in motion, recovering their three dimensional structure and motion."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3219867"
                        ],
                        "name": "J. Hopfield",
                        "slug": "J.-Hopfield",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Hopfield",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Hopfield"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2537503,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "24b9eebe49cf7e00cf50cf7b7d9243386a23fe7c",
            "isKey": false,
            "numCitedBy": 6274,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "A model for a large network of \"neurons\" with a graded response (or sigmoid input-output relation) is studied. This deterministic system has collective properties in very close correspondence with the earlier stochastic model based on McCulloch - Pitts neurons. The content- addressable memory and other emergent collective properties of the original model also are present in the graded response model. The idea that such collective properties are used in biological systems is given added credence by the continued presence of such properties for more nearly biological \"neurons.\" Collective analog electrical circuits of the kind described will certainly function. The collective states of the two models have a simple correspondence. The original model will continue to be useful for simulations, because its connection to graded response systems is established. Equations that include the effect of action potentials in the graded response system are also developed."
            },
            "slug": "Neurons-with-graded-response-have-collective-like-Hopfield",
            "title": {
                "fragments": [],
                "text": "Neurons with graded response have collective computational properties like those of two-state neurons."
            },
            "tldr": {
                "abstractSimilarityScore": 88,
                "text": "A model for a large network of \"neurons\" with a graded response (or sigmoid input-output relation) is studied and collective properties in very close correspondence with the earlier stochastic model based on McCulloch - Pitts neurons are studied."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the National Academy of Sciences of the United States of America"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145397726"
                        ],
                        "name": "E. Jones",
                        "slug": "E.-Jones",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Jones",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Jones"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 5178266,
            "fieldsOfStudy": [
                "Biology",
                "Psychology"
            ],
            "id": "ffbb929d82800aaa23dd3d7b3b2e27265c63f702",
            "isKey": false,
            "numCitedBy": 2286,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "Cerebral Cortex publishes papers on the development, organization, plasticity, and function of the cerebral cortex, including the hippocampus. Studies with clear relevance to the cerebral cortex , such as the thalmacortical relationship or cortico-subcortical interactions, are also included. the journal is multidisciplinary and covers a large variety of modern neurobiological and neuropsychological techniques, including anatomy, biochemistry, molecular neurobiology, electrophysiology, behavior, artificial intelligence, and theoretical modeling. In addition to research articles, special features such as brief reviews, book reviews, and commentaries are included. Cerebral Cortex is publishes 8 times yearly."
            },
            "slug": "Cerebral-Cortex-Jones",
            "title": {
                "fragments": [],
                "text": "Cerebral Cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 63,
                "text": "Cerebral Cortex publishes papers on the development, organization, plasticity, and function of the cerebral cortex, including the hippocampus, and a large variety of modern neurobiological and neuropsychological techniques, including anatomy, biochemistry, molecular neurobiology, electrophysiology, behavior, artificial intelligence, and theoretical modeling."
            },
            "venue": {
                "fragments": [],
                "text": "Cerebral Cortex"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8028300"
                        ],
                        "name": "E. Grimson",
                        "slug": "E.-Grimson",
                        "structuredName": {
                            "firstName": "Eric",
                            "lastName": "Grimson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Grimson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61610981,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "b6c7a051ce690a913bac9c447500e035138c333e",
            "isKey": false,
            "numCitedBy": 439,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Based on the author's thesis (Ph.D.--Massachusetts Institute of Technology) Includes indexes."
            },
            "slug": "From-Images-to-Surfaces:-A-Computational-Study-of-Grimson",
            "title": {
                "fragments": [],
                "text": "From Images to Surfaces: A Computational Study of the Human Early Visual System"
            },
            "tldr": {
                "abstractSimilarityScore": 61,
                "text": "Based on the author's thesis (Ph.D.--Massachusetts Institute of Technology), this list of major indexes for the period of May 21 to 29, 1991 is based on the data available at the time of that date."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2058365460"
                        ],
                        "name": "J. Austin",
                        "slug": "J.-Austin",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Austin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Austin"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 7355029,
            "fieldsOfStudy": [
                "Psychology",
                "Computer Science",
                "Biology"
            ],
            "id": "386db34312f780b8c1b01f43cbe6d2a19f8c97aa",
            "isKey": false,
            "numCitedBy": 242,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "This section considers how neural networks can be used as associative memory devices. It first describes what an associative memory is, and then moves on to describe associative memories based on feedforward neural networks and associative memories based on recurrent networks. The section also describes associative memory systems based on cognitive models. It also highlights the ability of neural-network-based systems to deal with uncertain data as compared with conventional associative memory systems."
            },
            "slug": "Associative-memory-Austin",
            "title": {
                "fragments": [],
                "text": "Associative memory"
            },
            "tldr": {
                "abstractSimilarityScore": 77,
                "text": "This section considers how neural networks can be used as associative memory devices and describes associative remembering systems based on feedforward neural networks and associative memories based on recurrent networks."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46539326"
                        ],
                        "name": "R. K. Brown",
                        "slug": "R.-K.-Brown",
                        "structuredName": {
                            "firstName": "R",
                            "lastName": "Brown",
                            "middleNames": [
                                "K"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. K. Brown"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 220177650,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "6befaec0c9f1c7879b2b13bde6ee2432a260e796",
            "isKey": false,
            "numCitedBy": 366,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Research interests in the Department cover experimental and computational, molecular and cellular structure, function, and biology, membrane biology, and biomolecular energetics. The teaching and research activities of the faculty bring its students in contact with biophysical scientists throughout the university. Regardless of their choice of research area, students are exposed to a wide range of problems of biological interest. For more information, and for the most up-to-date list of course offerings and requirements, consult the department web page at biophysics.jhu.edu (http://biophysics.jhu.edu/)."
            },
            "slug": "BIOPHYSICS-Brown",
            "title": {
                "fragments": [],
                "text": "BIOPHYSICS"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1931
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143731352"
                        ],
                        "name": "W. Hillis",
                        "slug": "W.-Hillis",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Hillis",
                            "middleNames": [
                                "Daniel"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Hillis"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2923128,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d2d85364acaa8b32ee4b0e4c838ecd60ce47a0d0",
            "isKey": false,
            "numCitedBy": 2211,
            "numCiting": 66,
            "paperAbstract": {
                "fragments": [],
                "text": "The Connection Machine describes a fundamentally different kind of computer. It offers a preview of a parallel processing computer that Daniel Hillis and others are now developing to perform tasks that no conventional, sequential machine can solve in a reasonable time."
            },
            "slug": "The-connection-machine-Hillis",
            "title": {
                "fragments": [],
                "text": "The connection machine"
            },
            "tldr": {
                "abstractSimilarityScore": 75,
                "text": "The Connection Machine describes a fundamentally different kind of computer that Daniel Hillis and others are now developing to perform tasks that no conventional, sequential machine can solve in a reasonable time."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145067266"
                        ],
                        "name": "L. S. Baumann",
                        "slug": "L.-S.-Baumann",
                        "structuredName": {
                            "firstName": "L.",
                            "lastName": "Baumann",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. S. Baumann"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 66922493,
            "fieldsOfStudy": [
                "Environmental Science"
            ],
            "id": "dbcb0645675f8a9a32b8bd48bafdb6c930b98e23",
            "isKey": false,
            "numCitedBy": 4,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Proceedings-of-the-Image-Understanding-Workshop,-at-Baumann",
            "title": {
                "fragments": [],
                "text": "Proceedings of the Image Understanding Workshop, Held at Los Angeles, California November 7-8, 1979"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1774384"
                        ],
                        "name": "G. Palm",
                        "slug": "G.-Palm",
                        "structuredName": {
                            "firstName": "Günther",
                            "lastName": "Palm",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Palm"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 35166876,
            "fieldsOfStudy": [],
            "id": "98c1b4d2dab9774a6911698d8fd2f726ed9599e3",
            "isKey": false,
            "numCitedBy": 78,
            "numCiting": 134,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Neural-Assemblies-Palm",
            "title": {
                "fragments": [],
                "text": "Neural Assemblies"
            },
            "venue": {
                "fragments": [],
                "text": "Studies of Brain Function"
            },
            "year": 1982
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Dissertation (California Institute of Technology"
            },
            "venue": {
                "fragments": [],
                "text": "Dissertation (California Institute of Technology"
            },
            "year": 1986
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Comput. Surv"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Surv"
            },
            "year": 1982
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Proc. R. Soc. London, Ser. B"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. R. Soc. London, Ser. B"
            },
            "year": 1979
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Artificial Intelligence Laboratory Memo"
            },
            "venue": {
                "fragments": [],
                "text": "Massachusetts Institute of Technology"
            },
            "year": 1984
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Comp. Graph. Image Proc"
            },
            "venue": {
                "fragments": [],
                "text": "Comp. Graph. Image Proc"
            },
            "year": 1983
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Artificial Intelligence Laboratory Memo (Massachusetts Institute of Technology"
            },
            "venue": {
                "fragments": [],
                "text": "Artificial Intelligence Laboratory Memo (Massachusetts Institute of Technology"
            },
            "year": 1985
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Proc. NatI. Acad. Sci. USA 81"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. NatI. Acad. Sci. USA 81"
            },
            "year": 1984
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Artificial Intelligence Laboratory Memo (Massachusetts Institute of Technology"
            },
            "venue": {
                "fragments": [],
                "text": "Artificial Intelligence Laboratory Memo (Massachusetts Institute of Technology"
            },
            "year": 1985
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Biol. Cybern"
            },
            "venue": {
                "fragments": [],
                "text": "Biol. Cybern"
            },
            "year": 1985
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Artificial Intelligence Laboratory MemoMassachusetts Institute of Technology"
            },
            "venue": {
                "fragments": [],
                "text": "Artificial Intelligence Laboratory MemoMassachusetts Institute of Technology"
            },
            "year": 1986
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "J. Chem. Phys"
            },
            "venue": {
                "fragments": [],
                "text": "J. Chem. Phys"
            },
            "year": 1953
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Comput. Graph. Image Proc"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Graph. Image Proc"
            },
            "year": 1979
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Artificial Intelligence Laboratory Memo (Massachusetts Institute of Technology"
            },
            "venue": {
                "fragments": [],
                "text": "Artificial Intelligence Laboratory Memo (Massachusetts Institute of Technology"
            },
            "year": 1985
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Pattern Recognition Lett"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognition Lett"
            },
            "year": 1983
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Stable URL: http://links.jstor.org/sici?sici=0027-8424%2819840515%2981%3A10%3C3088%3ANWGRHC%3E2.0"
            },
            "venue": {
                "fragments": [],
                "text": "CO%3B2-W 27 Optimization by Simulated Annealing"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Philos. Trans. R. Soc. London, Ser. B"
            },
            "venue": {
                "fragments": [],
                "text": "Philos. Trans. R. Soc. London, Ser. B"
            },
            "year": 1982
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Proc. R. Soc. London, Ser. B"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. R. Soc. London, Ser. B"
            },
            "year": 1985
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The Interpretation ofStructure from Motion"
            },
            "venue": {
                "fragments": [],
                "text": "The Interpretation ofStructure from Motion"
            },
            "year": 1979
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "SIAM J. Appl. Math"
            },
            "venue": {
                "fragments": [],
                "text": "SIAM J. Appl. Math"
            },
            "year": 1968
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Artif. Intell"
            },
            "venue": {
                "fragments": [],
                "text": "Artif. Intell"
            },
            "year": 1981
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Stable URL: http://links.jstor.org/sici?sici=0036-8075%2819830513%293%3A220%3A4598%3C671%3AOBSA%3E2.0"
            },
            "venue": {
                "fragments": [],
                "text": "Stable URL: http://links.jstor.org/sici?sici=0036-8075%2819830513%293%3A220%3A4598%3C671%3AOBSA%3E2.0"
            }
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 31,
        "totalPages": 4
    },
    "page_url": "https://www.semanticscholar.org/paper/Analog-\"neuronal\"-networks-in-early-vision.-Koch-Marroquín/6c0f7d514a38f64a9022b392b9f460dff3aeaa00?sort=total-citations"
}