{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143766793"
                        ],
                        "name": "A. Rosenfeld",
                        "slug": "A.-Rosenfeld",
                        "structuredName": {
                            "firstName": "Azriel",
                            "lastName": "Rosenfeld",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rosenfeld"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 1811975,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a2af0d367f13565cb5676aa70f49b1ee68fb69e3",
            "isKey": false,
            "numCitedBy": 731,
            "numCiting": 584,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : The field of picture processing by computer is reviewed from a technique-oriented standpoint. Only the processing of given pictures (as opposed to computer-synthesized pictures) is considered. Specific areas covered include: (a) Pictures as information sources and their efficient encoding; (b) Approximation of pictures - sampling and quantization techniques; (c) Position-invariant operations on pictures and their implementation (digital, electro-optical, optical); applications to matched filtering (template matching), spatial frequency filtering and image restoration, measurement of image quality, and image enhancement ('smoothing' and 'sharpening'); (d) Picture properties (linear; local and 'textural'; random) useful for pictorial pattern recognition; (e) 'Figure extraction' from pictures; figure properties (topology, size, shape); (f) Picture description and 'picture languages.' (Author)"
            },
            "slug": "Picture-Processing-by-Computer-Rosenfeld",
            "title": {
                "fragments": [],
                "text": "Picture Processing by Computer"
            },
            "tldr": {
                "abstractSimilarityScore": 93,
                "text": "The field of picture processing by computer is reviewed from a technique-oriented standpoint and the processing of given pictures (as opposed to computer-synthesized pictures) is considered."
            },
            "venue": {
                "fragments": [],
                "text": "CSUR"
            },
            "year": 1969
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1887705"
                        ],
                        "name": "R. Kirsch",
                        "slug": "R.-Kirsch",
                        "structuredName": {
                            "firstName": "Russell",
                            "lastName": "Kirsch",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Kirsch"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16101360,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a68886c4fa0fa4500832b3a9fcb4c0e44b2301f8",
            "isKey": false,
            "numCitedBy": 198,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper considers a class of information sources consisting of text and pictures. The text is English language text appearing in scientific and technical documents. The picture sources are the largely schematic pictures that occur in the same class of documents. However, the discussion is broadened slightly to include other picture sources. For a tiny fragment of English, the paper shows how the syntactic structure of text may be described, and then goes on to suggest that a similar analysis may be performed on the class of pictures under study. The description of these two kinds of information sources with a single class of descriptive techniques is suggested as an alternative to the synthetic approach in which artificial languages are specified and then learned and used. The major reason for doing syntactical analysis of such sources discussed here is that several information processing operations, amounting to the interpretation of the information sources looked upon as languages, can be done by the technique of syntax direction which uses the results of syntactic analysis to mediate subsequent processes for manipulating the information tokens. The paper concludes with an illustration of an algorithm for matching the sentences given by a simple grammar against the class of simple pictures which these sentences purport to describe."
            },
            "slug": "Computer-Interpretation-of-English-Text-and-Picture-Kirsch",
            "title": {
                "fragments": [],
                "text": "Computer Interpretation of English Text and Picture Patterns"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The paper shows how the syntactic structure of text may be described, and then goes on to suggest that a similar analysis may be performed on the class of pictures under study, to suggest as an alternative to the synthetic approach in which artificial languages are specified and then learned and used."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Electron. Comput."
            },
            "year": 1964
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 2,
        "totalPages": 1
    },
    "page_url": "https://www.semanticscholar.org/paper/Computer-analysis-and-classification-of-photographs-Sakai/0fb70e696256866e3a28598bcd640ef1be9db500?sort=total-citations"
}