{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107518012"
                        ],
                        "name": "C. Brown",
                        "slug": "C.-Brown",
                        "structuredName": {
                            "firstName": "C.",
                            "lastName": "Brown",
                            "middleNames": [
                                "Marlin"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Brown"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 2050668,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "06da45710eca435c0ed46710dc3da14e26dfae5d",
            "isKey": false,
            "numCitedBy": 45,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "Computer vision, the automatic construction of scene descriptions from image input data, has just entered its second decade. Approaches have varied widely, especially in the amounts of symbolic, domain-dependent knowledge and inference that are incorporated into the vision process. Much current research addresses the extraction of physical properties of the scene (depth, surface orientation, reflectance) from images by using only a few general assumptions about the scene domain. Extraction of physical parameters is part of a hierarchy of operations needed to transform image input data to symbolic descriptions. Two other processes that serve as examples are stereo fusion and the partitioning of image phenomena into related groups. Computer vision research is influencing theories of animal perception as well as the design of computing architectures for artificial intelligence."
            },
            "slug": "Computer-Vision-and-Natural-Constraints-Brown",
            "title": {
                "fragments": [],
                "text": "Computer Vision and Natural Constraints"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "Computer vision research is influencing theories of animal perception as well as the design of computing architectures for artificial intelligence."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1719838"
                        ],
                        "name": "W. Grimson",
                        "slug": "W.-Grimson",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Grimson",
                            "middleNames": [
                                "Eric",
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Grimson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 46108912,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "d27b1205d722be5ec477c476770b7e2753d26b17",
            "isKey": false,
            "numCitedBy": 151,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": "Computational theories of structure-from-motion and stereo vision only specify the computation of three-dimensional surface information at special points in the image. Yet the visual perception is clearly of complete surfaces. To account for this a computational theory of the interpolation of surfaces from visual information is presented. The problem is constrained by the fact that the surface must agree with the information from stereo or motion correspondence, and not vary radically between these points. Using the image irradiance equation, an explicit form of this surface consistency constraint can be derived. To determine which of two possible surfaces is more consistent with the surface consistency constraint, one must be able to compare the two surfaces. To do this, a functional from the space of possible functions to the real numbers is required. In this way, the surface most consistent with the visual information will be that which minimizes the functional. To ensure that the functional has a unique minimal surface, conditions on the form of the functional are derived. In particular, if the functional is a complete semi-norm that satisfies the parallelogram law, or the space of functions is a semi-Hilbert space and the functional is a semi-inner product, then there is a unique (to within possibly an element of the null space of the functional) surface that is most consistent with the visual information. It can be shown, based on the above conditions plus a condition of rotational symmetry, that there is a vector space of possible functionals that measure surface consistency, this vector space being spanned by the functional of quadratic variation and the functional of square Laplacian. Arguments based on the null spaces of the respective functionals are used to justify the choice of the quadratic variation as the optimal functional. Possible refinements to the theory, concerning the role of discontinuities in depth and the effects of applying the interpolation process to scenes containing more than one object, are discussed."
            },
            "slug": "A-computational-theory-of-visual-surface-Grimson",
            "title": {
                "fragments": [],
                "text": "A computational theory of visual surface interpolation."
            },
            "tldr": {
                "abstractSimilarityScore": 50,
                "text": "A computational theory of the interpolation of surfaces from visual information is presented, and it is shown that there is a vector space of possible functionals that measure surface consistency, this vector space being spanned by thefunctional of quadratic variation and the functional of square Laplacian."
            },
            "venue": {
                "fragments": [],
                "text": "Philosophical transactions of the Royal Society of London. Series B, Biological sciences"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1750924"
                        ],
                        "name": "Demetri Terzopoulos",
                        "slug": "Demetri-Terzopoulos",
                        "structuredName": {
                            "firstName": "Demetri",
                            "lastName": "Terzopoulos",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Demetri Terzopoulos"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 630502,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a931f49f06fdc0c5b339de9fb8e9e496ac98a300",
            "isKey": false,
            "numCitedBy": 337,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Multilevel-computational-processes-for-visual-Terzopoulos",
            "title": {
                "fragments": [],
                "text": "Multilevel computational processes for visual surface reconstruction"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Vis. Graph. Image Process."
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1691804"
                        ],
                        "name": "D. Ballard",
                        "slug": "D.-Ballard",
                        "structuredName": {
                            "firstName": "Dana",
                            "lastName": "Ballard",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Ballard"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1695689"
                        ],
                        "name": "Geoffrey E. Hinton",
                        "slug": "Geoffrey-E.-Hinton",
                        "structuredName": {
                            "firstName": "Geoffrey",
                            "lastName": "Hinton",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Geoffrey E. Hinton"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1714528"
                        ],
                        "name": "T. Sejnowski",
                        "slug": "T.-Sejnowski",
                        "structuredName": {
                            "firstName": "Terrence",
                            "lastName": "Sejnowski",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Sejnowski"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 4318006,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "badb0516cf0ca095c4370a41795323e40e43372c",
            "isKey": false,
            "numCitedBy": 344,
            "numCiting": 36,
            "paperAbstract": {
                "fragments": [],
                "text": "The functional abilities and parallel architecture of the human visual system are a rich source of ideas about visual processing. Any visual task that we can perform quickly and effortlessly is likely to have a computational solution using a parallel algorithm. Recently, several such parallel algorithms have been found that exploit information implicit in an image to compute intrinsic properties of surfaces, such as surface orientation, reflectance and depth. These algorithms require a computational architecture that has similarities to that of visual cortex in primates."
            },
            "slug": "Parallel-visual-computation-Ballard-Hinton",
            "title": {
                "fragments": [],
                "text": "Parallel visual computation"
            },
            "tldr": {
                "abstractSimilarityScore": 66,
                "text": "The functional abilities and parallel architecture of the human visual system are a rich source of ideas about visual processing and several parallel algorithms have been found that exploit information implicit in an image to compute intrinsic properties of surfaces, such as surface orientation, reflectance and depth."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31857045"
                        ],
                        "name": "E. Hildreth",
                        "slug": "E.-Hildreth",
                        "structuredName": {
                            "firstName": "Ellen",
                            "lastName": "Hildreth",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Hildreth"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 62198913,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "c416a885cc36515740ef8dfa9220366fa2a379f8",
            "isKey": false,
            "numCitedBy": 660,
            "numCiting": 56,
            "paperAbstract": {
                "fragments": [],
                "text": "From the Publisher: \nComputer scientists designing machine vision systems, psychologists working in visual perception, visual neurophysiologists, and theoretical biologists will derive a deeper understanding of visual function - in particular the computations that the human visual system uses to analyze motion-from the important research reported in this book. \nThe organization of movement in the changing image that reaches the eye provides our visual system with a valuable source of information for analyzing the structure of our surroundings. This book examines the measurement of this movement and the use of relative movement to locate the boundaries of physical objects in the environment. It investigates the nature of the computations that are necessary to perform this analysis by any vision system, biological or artificial. \nThe author first defines the goals of these visual tasks, reveals the properties of the physical world that a vision system can rely upon to achieve such goals, and suggests general methods that can be used to carry out the tasks. From the general methods, she designs algorithms specifying a particular sequence of computations that a vision system can execute to perform these visual tasks. These algorithms are implemented on a computer system under a variety of circumstances. Combined with the traditional approaches of psychology and neurophysiology, this computational approach provides an exciting analysis of visual function, raising many new questions about the human vision system for further investigation. \nEllen Catherine Hildreth received her doctorate from MIT. She is a Research Scientist in the MIT Artificial Intelligence Laboratory and associate director of theCenter for Biological Information Processing at the Whitaker College of Health Sciences, Technology, and Management. The Measurement of Visual Motion is an ACM Distinguished Dissertation."
            },
            "slug": "Measurement-of-Visual-Motion-Hildreth",
            "title": {
                "fragments": [],
                "text": "Measurement of Visual Motion"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "Combined with the traditional approaches of psychology and neurophysiology, this computational approach provides an exciting analysis of visual function, raising many new questions about the human vision system for further investigation."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "118988170"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "Dale",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 120306234,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "ab46fdac0a3b484cd58978ba71dc71631b49f70a",
            "isKey": false,
            "numCitedBy": 989,
            "numCiting": 57,
            "paperAbstract": {
                "fragments": [],
                "text": "An algorithm is proposed for solving the stereoscopic matching problem. The algorithm consists of five steps: (1) Each image is filtered at different orientations with bar masks of four sizes that increase with eccentricity; the equivalent filters are one or two octaves wide. (2) Zero-crossings in the filtered images, which roughly correspond to edges, are localized. Positions of the ends of lines and edges are also found. (3) For each mask orientation and size, matching takes place between pairs of zero-crossings or terminations of the same sign in the two images, for a range of disparities up to about the width of the mask’s central region. (4) Wide masks can control vergence movements, thus causing small masks to come into correspondence. (5) When a correspondence is achieved, it is stored in a dynamic buffer, called the 2½-D sketch. It is shown that this proposal provides a theoretical framework for most existing psychophysical and neurophysiological data about stereopsis. Several critical experimental predictions are also made, for instance about the size of Panum’s area under various conditions. The results of such experiments would tell us whether, for example, co-operativity is necessary for the matching process."
            },
            "slug": "A-computational-theory-of-human-stereo-vision-Marr-Poggio",
            "title": {
                "fragments": [],
                "text": "A computational theory of human stereo vision"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31857045"
                        ],
                        "name": "E. Hildreth",
                        "slug": "E.-Hildreth",
                        "structuredName": {
                            "firstName": "Ellen",
                            "lastName": "Hildreth",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Hildreth"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2150419,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "9009c9685754346deb93f316144a9da1f70ffcd8",
            "isKey": false,
            "numCitedBy": 7031,
            "numCiting": 62,
            "paperAbstract": {
                "fragments": [],
                "text": "A theory of edge detection is presented. The analysis proceeds in two parts. (1) Intensity changes, which occur in a natural image over a wide range of scales, are detected separately at different scales. An appropriate filter for this purpose at a given scale is found to be the second derivative of a Gaussian, and it is shown that, provided some simple conditions are satisfied, these primary filters need not be orientation-dependent. Thus, intensity changes at a given scale are best detected by finding the zero values of ∇2G(x, y)* I(x, y) for image I, where G(x, y) is a two-dimensional Gaussian distribution and ∇2 is the Laplacian. The intensity changes thus discovered in each of the channels are then represented by oriented primitives called zero-crossing segments, and evidence is given that this representation is complete. (2) Intensity changes in images arise from surface discontinuities or from reflectance or illumination boundaries, and these all have the property that they are spatially localized. Because of this, the zero-crossing segments from the different channels are not independent, and rules are deduced for combining them into a description of the image. This description is called the raw primal sketch. The theory explains several basic psychophysical findings, and the operation of forming oriented zero-crossing segments from the output of centre-surround ∇2G filters acting on the image forms the basis for a physiological model of simple cells (see Marr & Ullman 1979)."
            },
            "slug": "Theory-of-edge-detection-Marr-Hildreth",
            "title": {
                "fragments": [],
                "text": "Theory of edge detection"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The theory of edge detection explains several basic psychophysical findings, and the operation of forming oriented zero-crossing segments from the output of centre-surround ∇2G filters acting on the image forms the basis for a physiological model of simple cells."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743045"
                        ],
                        "name": "S. Ullman",
                        "slug": "S.-Ullman",
                        "structuredName": {
                            "firstName": "Shimon",
                            "lastName": "Ullman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ullman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 9630018,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "2dcffe8606e9fd3fb611be6f1c9571f49664b263",
            "isKey": false,
            "numCitedBy": 713,
            "numCiting": 127,
            "paperAbstract": {
                "fragments": [],
                "text": "The construction of directionally selective units, and their use in the processing of visual motion, are considered. The zero crossings of ∇2G(x, y) ∗ I(x, y) are located, as in Marr & Hildreth (1980). That is, the image is filtered through centre-surround receptive fields, and the zero values in the output are found. In addition, the time derivative ∂[∇2G(x, y) ∗ l(x, y)]/∂t is measured at the zero crossings, and serves to constrain the local direction of motion to within 180°. The direction of motion can be determined in a second stage, for example by combining the local constraints. The second part of the paper suggests a specific model of the information processing by the X and Y cells of the retina and lateral geniculate nucleus, and certain classes of cortical simple cells. A number of psychophysical and neurophysiological predictions are derived from the theory."
            },
            "slug": "Directional-selectivity-and-its-use-in-early-visual-Marr-Ullman",
            "title": {
                "fragments": [],
                "text": "Directional selectivity and its use in early visual processing"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The second part of the paper suggests a specific model of the information processing by the X and Y cells of the retina and lateral geniculate nucleus, and certain classes of cortical simple cells."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4688361"
                        ],
                        "name": "E. Land",
                        "slug": "E.-Land",
                        "structuredName": {
                            "firstName": "Edwin",
                            "lastName": "Land",
                            "middleNames": [
                                "Herbert"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Land"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 1550216,
            "fieldsOfStudy": [
                "Education"
            ],
            "id": "0a0985f3db38f116fa24b7090490fd62353d50d0",
            "isKey": false,
            "numCitedBy": 538,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "In the Color Vision Symposium at the Academy in April 1958, we showed a series of experiments which demonstrated that \"4whereas in color-mixing theory the wavelengths of the stimuli and the energy content at each wavelength are significant in determining the sense of color . . . in images neither the wavelength of the stimulus nor the energy at each wavelength determines the color. This departure from what we expect on the basis of colorimetry is not a small effect, but is complete . .. .' (1, 2). The initial and most engaging experiment comprised taking two black-and-white photographs of the same scene, one through a red filter and one through a green filter, and projecting these two black-and-white pictures in superposition on the screen to yield a single black-and-white panchromatic image of the scene. When a red filter was placed in the path of the light from the projector that contained the picture taken through a red filter, the whole scene became dramatically colored as if in many respects it were a standard full-color photograph. The first paradox was that the radiation coming to the eye of the observer consisted only of various ratios of red light to white light which should have yielded only a variety of pinks. The second paradox was that the overall ratio of light from the one projector to light from the other projector could be changed markedly without changing the color names of the objects in the colored picture: the colors of the individual objects must be determined by the ratio of red light to white light, but a change in the overall ratio of red light to white light did not change the colors. In light of the understanding which we now have, this simple experiment, which was a shock to the intuitive understanding of all of us, turns out to be the most sophisticated experiment we could have undertaken. For the flavor of the many experiments described at the Symposium, I refer you to the two papers (1, 2) at that time. Here, I want to turn to the quantitative procedures which we now use. We prepared a laboratory display which we dubbed a \"Mondrian\" (although it actually is closer to a van Doesburg), utilizing about 100 colored papers. A paper of a given color would appear many times in different parts of the display, each time having a different size and shape and each time being surrounded by a different set of other colored papers. One reason for the design was to prohibit the superposition of afterimages of areas onto other areas (3), and another reason for the design was to obviate explanations of results in terms of the size or shape or surrounding of any given paper. The Mondrian is illuminated by using three 35-mm slide projectors with no slides in the slide holder. The output of each projector/illuminator is controlled independently. An interference filter passing long waves is placed in the path of one projector, a middle wave filter, in the path of the second, and a short-wave filter, in the path of the third (Fig. 1). One may think of these as relating roughly to the three visual pigments. A telescopic photometer (Spectra Pritchard photometer, model 1980A), placed roughly where the observers will be, receives and measures radiation from about 1/16th of a square inch on each chosen area of the Mondrian when it is pointed at that area. The instrument is calibrated so that at any wavelength it reports directly in watts per steradian per square meter. Let me call your attention to these four papers: yellow, white, green, and blue. The telescope is pointed at a yellow paper. The short-wave and middle-wave illuminators are turned off, and the whole Mondrian is illuminated with the long-wave illuminator. The output of this projector is then changed until the meter reads exactly \"one\" (0.1 W per Sr2 per m2). The longwave illuminator is turned off and the middle-wave illuminator is turned on. Its output is adjusted until the meter reads one. This ensures that the amount of middle-wave energy now reaching the meter from that small patch is equal to the amount of long-wave energy. Finally, after the middle-wave illuminator is turned off, the short-wave illuminator is turned on, and its output is set so that the meter (which we must remember is reading the radiation to our eyes) reads one. All three illuminators are now turned on. While looking at the Mondrian as a whole, we note that the yellow paper looks yellow. We now turn our attention to the white paper, pointing the telephotometer at it. We go through the same procedure of illuminating with one illuminator at a time and of setting each illuminator so that the light coming this time from the white paper to the meter, and hence to our eyes, measures one for the long wave and one for the middle wave and one for the short wave. Thus, we have arranged to have coming to our eye from the piece of white paper exactly the same flux-the same wavelength composition, the same energy composition-which a moment earlier we had arranged to have coming to our eye from the piece of yellow paper. The somewhat indigestible question is \"what color will the piece of paper be which was white in the Mondrian previously?\" Keep in mind that the information now coming to our eye from that piece of paper dictates classically that, if one, one, and one coming to our eye gave yellow, then one, one, and one must again be yellow. This conviction dates back to Newton's proposition V (4):"
            },
            "slug": "Recent-advances-in-retinex-theory-and-some-for-and-Land",
            "title": {
                "fragments": [],
                "text": "Recent advances in retinex theory and some implications for cortical computations: color vision and the natural image."
            },
            "tldr": {
                "abstractSimilarityScore": 52,
                "text": "A series of experiments demonstrated that in images neither the wavelength of the stimulus nor the energy at each wavelength determines the color, and this departure from what the authors expect on the basis of colorimetry is complete."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the National Academy of Sciences of the United States of America"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49314602"
                        ],
                        "name": "H. Wallach",
                        "slug": "H.-Wallach",
                        "structuredName": {
                            "firstName": "Hans",
                            "lastName": "Wallach",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Wallach"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1444543493"
                        ],
                        "name": "D. O'connell",
                        "slug": "D.-O'connell",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "O'connell",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. O'connell"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11979303,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "6cf482e76ce91934c9069fd3768e2c4ccdf9fb38",
            "isKey": false,
            "numCitedBy": 691,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "The problem of how three-dimensional form is perceived in spite of the fact that pertinent stimulation consists only in two-dimensional retinal images has been only partly solved. Much is known about the impressive effectiveness of binocular disparity. However, the excellent perception of threedimensional form in monocular vision has remained essentially unexplained. It has been proposed that some patterns of stimulation on the retina give rise to three-dimensional experiences, because visual processes differ in the spontaneous organization that results from certain properties of the retinal pattern. Rules of organization are supposed to exist according to which most retinal projections of three-dimensional forms happen to produce three-dimensional percepts and most retinal images of flat forms lead to flat forms in experience also. This view has been held mainly by gestalt psychologists. Another approach to this problem maintains that the projected stimulus patterns are interpreted on the basis of previous experience, either visual"
            },
            "slug": "The-kinetic-depth-effect.-Wallach-O'connell",
            "title": {
                "fragments": [],
                "text": "The kinetic depth effect."
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "The problem of how three-dimensional form is perceived in spite of the fact that pertinent stimulation consists only in two-dimensional retinal images has been only partly solved."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of experimental psychology"
            },
            "year": 1953
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31857045"
                        ],
                        "name": "E. Hildreth",
                        "slug": "E.-Hildreth",
                        "structuredName": {
                            "firstName": "Ellen",
                            "lastName": "Hildreth",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Hildreth"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8933331,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "90e94ccdab8437acc190a1d3f59f331150c6ccc7",
            "isKey": false,
            "numCitedBy": 160,
            "numCiting": 53,
            "paperAbstract": {
                "fragments": [],
                "text": "The organization of movement in the changing retinal image provides a valuable source of information for analysing the environment in terms of objects, their motion in space, and their three-dimensional structure. A description of this movement is not provided to our visual system directly, however; it must be inferred from the pattern of changing intensity that reaches the eye. This paper examines the problem of motion measurement, which we formulate as the computation of an instantaneous two-dimensional velocity field from the changing image. Initial measurements of motion take place at the location of significant intensity changes. These measurements provide only one component of local velocity, and must be integrated to compute the two-dimensional velocity field. A fundamental problem for this integration stage is that the velocity field is not determined uniquely from information available in the changing image. We formulate an additional constraint of smoothness of the velocity field, based on the physical assumption that surfaces are generally smooth, which allows the computation of a unique velocity field. A theoretical analysis of the conditions under which this computation yields the correct velocity field suggests that the solution is physically plausible. Empirical studies show the predictions of this computation to be consistent with human motion perception."
            },
            "slug": "The-computation-of-the-velocity-field-Hildreth",
            "title": {
                "fragments": [],
                "text": "The computation of the velocity field"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "Empirical studies show the predictions of this computation of an instantaneous two-dimensional velocity field from the changing image to be consistent with human motion perception, and an additional constraint of smoothness of the velocity field is formulated, based on the physical assumption that surfaces are generally smooth."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143814637"
                        ],
                        "name": "Berthold K. P. Horn",
                        "slug": "Berthold-K.-P.-Horn",
                        "structuredName": {
                            "firstName": "Berthold",
                            "lastName": "Horn",
                            "middleNames": [
                                "K.",
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Berthold K. P. Horn"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1717435"
                        ],
                        "name": "B. G. Schunck",
                        "slug": "B.-G.-Schunck",
                        "structuredName": {
                            "firstName": "Brian",
                            "lastName": "Schunck",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. G. Schunck"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1371968,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "a3229dc33ecb80c59a75b906c46b586dd059b781",
            "isKey": false,
            "numCitedBy": 11343,
            "numCiting": 54,
            "paperAbstract": {
                "fragments": [],
                "text": "Optical flow cannot be computed locally, since only one independent measurement is available from the image sequence at a point, while the flow velocity has two components. A second constraint is needed. A method for finding the optical flow pattern is presented which assumes that the apparent velocity of the brightness pattern varies smoothly almost everywhere in the image. An iterative implementation is shown which successfully computes the optical flow for a number of synthetic image sequences. The algorithm is robust in that it can handle image sequences that are quantized rather coarsely in space and time. It is also insensitive to quantization of brightness levels and additive noise. Examples are included where the assumption of smoothness is violated at singular points or along lines in the image."
            },
            "slug": "Determining-Optical-Flow-Horn-Schunck",
            "title": {
                "fragments": [],
                "text": "Determining Optical Flow"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "An iterative implementation is shown which successfully computes the optical flow for a number of synthetic image sequences and is robust in that it can handle image sequences that are quantified rather coarsely in space and time."
            },
            "venue": {
                "fragments": [],
                "text": "Other Conferences"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145162067"
                        ],
                        "name": "A. Blake",
                        "slug": "A.-Blake",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Blake",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Blake"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 14471644,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1821de90c72c557f5bd874a4f7420c07d6220363",
            "isKey": false,
            "numCitedBy": 79,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-least-disturbance-principle-and-weak-Blake",
            "title": {
                "fragments": [],
                "text": "The least-disturbance principle and weak constraints"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit. Lett."
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143814637"
                        ],
                        "name": "Berthold K. P. Horn",
                        "slug": "Berthold-K.-P.-Horn",
                        "structuredName": {
                            "firstName": "Berthold",
                            "lastName": "Horn",
                            "middleNames": [
                                "K.",
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Berthold K. P. Horn"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 34995520,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "a0d00264c3f5616a9c8f00ca70d0864a31a38cf2",
            "isKey": false,
            "numCitedBy": 2258,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "From the Publisher: \nThis book presents a coherent approach to the fast-moving field of computer vision, using a consistent notation based on a detailed understanding of the image formation process. It covers even the most recent research and will provide a useful and current reference for professionals working in the fields of machine vision, image processing, and pattern recognition. \nAn outgrowth of the author's course at MIT, Robot Vision presents a solid framework for understanding existing work and planning future research. Its coverage includes a great deal of material that is important to engineers applying machine vision methods in the real world. The chapters on binary image processing, for example, help explain and suggest how to improve the many commercial devices now available. And the material on photometric stereo and the extended Gaussian image points the way to what may be the next thrust in commercialization of the results in this area. \nChapters in the first part of the book emphasize the development of simple symbolic descriptions from images, while the remaining chapters deal with methods that exploit these descriptions. The final chapter offers a detailed description of how to integrate a vision system into an overall robotics system, in this case one designed to pick parts out of a bin. \nThe many exercises complement and extend the material in the text, and an extensive bibliography will serve as a useful guide to current research. \nErrata (164k PDF)"
            },
            "slug": "Robot-vision-Horn",
            "title": {
                "fragments": [],
                "text": "Robot vision"
            },
            "tldr": {
                "abstractSimilarityScore": 82,
                "text": "This book presents a coherent approach to the fast-moving field of computer vision, using a consistent notation based on a detailed understanding of the image formation process, and will provide a useful and current reference for professionals working in the fields of machine vision, image processing, and pattern recognition."
            },
            "venue": {
                "fragments": [],
                "text": "MIT electrical engineering and computer science series"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143814637"
                        ],
                        "name": "Berthold K. P. Horn",
                        "slug": "Berthold-K.-P.-Horn",
                        "structuredName": {
                            "firstName": "Berthold",
                            "lastName": "Horn",
                            "middleNames": [
                                "K.",
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Berthold K. P. Horn"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8154601,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "23384ac18d7edea7a6c6145fd605912e506dd671",
            "isKey": false,
            "numCitedBy": 422,
            "numCiting": 37,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Determining-lightness-from-an-image-Horn",
            "title": {
                "fragments": [],
                "text": "Determining lightness from an image"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Graph. Image Process."
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "120971205"
                        ],
                        "name": "M. Brady",
                        "slug": "M.-Brady",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Brady",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Brady"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16050917,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f7f2d4a7a7c2b0332583773c5fa737b65392a399",
            "isKey": false,
            "numCitedBy": 201,
            "numCiting": 193,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : Recent theoretical developments in Image Understanding are surveyed. Among the issues discussed are: edge finding, region finding, texture, shape from shading, shape from texture, shape from contour, and the representations of surfaces and objects."
            },
            "slug": "Computational-Approaches-to-Image-Understanding-Brady",
            "title": {
                "fragments": [],
                "text": "Computational Approaches to Image Understanding"
            },
            "tldr": {
                "abstractSimilarityScore": 96,
                "text": "Current theoretical developments in Image Understanding are surveyed, among the issues discussed are: edge finding, region finding, texture,shape from shading, shape from texture, shapeFrom contour, and the representations of surfaces and objects."
            },
            "venue": {
                "fragments": [],
                "text": "CSUR"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3194361"
                        ],
                        "name": "S. Geman",
                        "slug": "S.-Geman",
                        "structuredName": {
                            "firstName": "Stuart",
                            "lastName": "Geman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Geman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1707642"
                        ],
                        "name": "D. Geman",
                        "slug": "D.-Geman",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "Geman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Geman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 5837272,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "459b30a9a960080f3b313e41886b1aa0e51e882c",
            "isKey": false,
            "numCitedBy": 18704,
            "numCiting": 60,
            "paperAbstract": {
                "fragments": [],
                "text": "We make an analogy between images and statistical mechanics systems. Pixel gray levels and the presence and orientation of edges are viewed as states of atoms or molecules in a lattice-like physical system. The assignment of an energy function in the physical system determines its Gibbs distribution. Because of the Gibbs distribution, Markov random field (MRF) equivalence, this assignment also determines an MRF image model. The energy function is a more convenient and natural mechanism for embodying picture attributes than are the local characteristics of the MRF. For a range of degradation mechanisms, including blurring, nonlinear deformations, and multiplicative or additive noise, the posterior distribution is an MRF with a structure akin to the image model. By the analogy, the posterior distribution defines another (imaginary) physical system. Gradual temperature reduction in the physical system isolates low energy states (``annealing''), or what is the same thing, the most probable states under the Gibbs distribution. The analogous operation under the posterior distribution yields the maximum a posteriori (MAP) estimate of the image given the degraded observations. The result is a highly parallel ``relaxation'' algorithm for MAP estimation. We establish convergence properties of the algorithm and we experiment with some simple pictures, for which good restorations are obtained at low signal-to-noise ratios."
            },
            "slug": "Stochastic-Relaxation,-Gibbs-Distributions,-and-the-Geman-Geman",
            "title": {
                "fragments": [],
                "text": "Stochastic Relaxation, Gibbs Distributions, and the Bayesian Restoration of Images"
            },
            "tldr": {
                "abstractSimilarityScore": 52,
                "text": "The analogy between images and statistical mechanics systems is made and the analogous operation under the posterior distribution yields the maximum a posteriori (MAP) estimate of the image given the degraded observations, creating a highly parallel ``relaxation'' algorithm for MAP estimation."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1739452"
                        ],
                        "name": "K. Ikeuchi",
                        "slug": "K.-Ikeuchi",
                        "structuredName": {
                            "firstName": "Katsushi",
                            "lastName": "Ikeuchi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Ikeuchi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143814637"
                        ],
                        "name": "Berthold K. P. Horn",
                        "slug": "Berthold-K.-P.-Horn",
                        "structuredName": {
                            "firstName": "Berthold",
                            "lastName": "Horn",
                            "middleNames": [
                                "K.",
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Berthold K. P. Horn"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 5738968,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1f9a9153f15655ea8a07186d42307d6d43032d7d",
            "isKey": false,
            "numCitedBy": 803,
            "numCiting": 91,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Numerical-Shape-from-Shading-and-Occluding-Ikeuchi-Horn",
            "title": {
                "fragments": [],
                "text": "Numerical Shape from Shading and Occluding Boundaries"
            },
            "venue": {
                "fragments": [],
                "text": "Artif. Intell."
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743045"
                        ],
                        "name": "S. Ullman",
                        "slug": "S.-Ullman",
                        "structuredName": {
                            "firstName": "Shimon",
                            "lastName": "Ullman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ullman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62159701,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6649cbded0fb4b89ff72c22ba97b6576b9c6bbd9",
            "isKey": false,
            "numCitedBy": 122,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Relaxation-and-constrained-optimization-by-local-Ullman",
            "title": {
                "fragments": [],
                "text": "Relaxation and constrained optimization by local processes"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1696931"
                        ],
                        "name": "H. Barrow",
                        "slug": "H.-Barrow",
                        "structuredName": {
                            "firstName": "Harry",
                            "lastName": "Barrow",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barrow"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144592244"
                        ],
                        "name": "J. Tenenbaum",
                        "slug": "J.-Tenenbaum",
                        "structuredName": {
                            "firstName": "Jay",
                            "lastName": "Tenenbaum",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Tenenbaum"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 52817639,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "2643759cac24ceb45470e731e808d7ecf0b85bce",
            "isKey": false,
            "numCitedBy": 381,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Interpreting-Line-Drawings-as-Three-Dimensional-Barrow-Tenenbaum",
            "title": {
                "fragments": [],
                "text": "Interpreting Line Drawings as Three-Dimensional Surfaces"
            },
            "venue": {
                "fragments": [],
                "text": "Artif. Intell."
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145766525"
                        ],
                        "name": "M. Fahle",
                        "slug": "M.-Fahle",
                        "structuredName": {
                            "firstName": "Manfred",
                            "lastName": "Fahle",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Fahle"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 9739908,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "033c0aadfe15b48c1c5a2a15e616ec16b10a1565",
            "isKey": false,
            "numCitedBy": 218,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "Stroboscopic presentation of a moving object can be interpolated by our visual system into the perception of continuous motion. The precision of this interpolation process has been explored by measuring the vernier discrimination threshold for targets displayed stroboscopically at a sequence of stations. The vernier targets, moving at constant velocity, were presented either with a spatial offset or with a temporal offset or with both. The main results are: (1) vernier acuity for spatial offset is rather invariant over a wide range of velocities and separations between the stations (see Westheimer & McKee 1975); (2) vernier acuity for temporal offset depends on spatial separation and velocity. At each separation there is an optimal velocity such that the strobe interval is roughly constant at about 30 ms; optimal acuity decreases with increasing separation; (3) blur of the vernier pattern decreases acuity for spatial offsets, but improves acuity for temporal offsets (at high velocities and large separations); (4) a temporal offset exactly compensates the equivalent (at the given velocity) spatial offset only for a small separation and optimal velocity; otherwise the spatial offset dominates. A theoretical analysis of the interpolation problem suggests a computational scheme based on the assumption of constant velocity motion. This assumption reflects a constraint satisfied in normal vision over the short times and small distances normally relevant for the interpolation process. A reasonable implementation of this scheme only requires a set of independent, direction selective spatiotemporal channels, that is receptive fields with the different sizes and temporal properties revealed by psychophysical experiments. It is concluded that sophisticated mechanisms are not required to account for the main properties of vernier acuity with moving targets. It is furthermore suggested that the spatiotemporal channels of human vision may be the interpolation filters themselves. Possible neurophysiological implications are briefly discussed."
            },
            "slug": "Visual-hyperacuity:-spatiotemporal-interpolation-in-Fahle-Poggio",
            "title": {
                "fragments": [],
                "text": "Visual hyperacuity: spatiotemporal interpolation in human vision"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "It is concluded that sophisticated mechanisms are not required to account for the main properties of vernier acuity with moving targets, and it is furthermore suggested that the spatiotemporal channels of human vision may be the interpolation filters themselves."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145624227"
                        ],
                        "name": "C. Koch",
                        "slug": "C.-Koch",
                        "structuredName": {
                            "firstName": "Christof",
                            "lastName": "Koch",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Koch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145730991"
                        ],
                        "name": "V. Torre",
                        "slug": "V.-Torre",
                        "structuredName": {
                            "firstName": "Vincent",
                            "lastName": "Torre",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Torre"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 30484411,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6ab46ba6f58e3f37c3ac62b5f1b0b33c322979fe",
            "isKey": false,
            "numCitedBy": 397,
            "numCiting": 41,
            "paperAbstract": {
                "fragments": [],
                "text": "The electrical properties of the different anatomical types of retinal ganglion cells in the cat were calculated on the basis of passive cable theory from measurements made on histological material. Standard values for the electrical parameters were assumed (R $\\_i$ = 70 $\\Omega$ cm, C $\\_m$ = 2 $\\mu$ F cm $^{-2}$ , R $\\_m$ = 2500 $\\Omega$ cm $^2$ ). We conclude that these neurons need not be equipotential despite their small dimensions, mainly because of their extensive branching. The interactions between excitation and inhibition when the inhibitory battery is near the resting potential can be strongly nonlinear in these cells. To characterize the different types of ganglion cells in terms of this property we introduce F, the factor by which the soma depolarization induced by a given excitatory input is reduced by inhibition. In this framework we analyse some of the integrative properties of an arbitrary passive dendritic tree and we then derive the functional properties that are characteristic for the various types of ganglion cells. Our main results are: (i) Nonlinear saturation at the synapses may be made effectively smaller by spreading the same (conductance) input among several subunits on the dendritic field. Subunits are defined as regions of the dendritic field that are somewhat isolated from each other and roughly equipotential within. (ii) Shunting inhibition can specifically veto an excitatory input, if it is located on the direct path to the soma. The F values can then be very high even when the excitatory inputs are much larger than the inhibitory, as long as the absolute value of inhibition is not too small. Inhibition more distal than excitation is much less effective. (iii) Specific branching patterns coupled with suitable distribution of synapses are potentially able to support complex information processing operations on the incoming excitatory and inhibitory signals. The quantitative analysis of the morphology of cat retinal ganglion cells leads to the following specific conclusions: (i) None of the cells examined satisfies Rall's equivalent cylinder condition. The dendritic tree cannot be satisfactorily approximated by a non-tapering cylinder. (ii) Under the assumption of a passive membrane, the dendritic architecture of the different types of retinal ganglion cells reflects characteristically different electrical properties, which are likely to be relevant for their physiological function and their information processing role: (a) $\\alpha$ cells have spatially inhomogeneous electrical properties, with many subunits. Within each subunit nonlinear effects may take place; between subunits good linear summation is expected. F values are relatively low. (b) $\\beta$ cells at small eccentricities have rather homogeneous electrical properties. Even distal inputs are weighted rather uniformly. Electrical inhomogeneities of the $\\alpha$ type appear for $\\beta$ cells at larger eccentricities. F values are low. (c) $\\gamma$ -like cells have few subunits, each with high input resistance underlying nonlinear saturation effects possibly related to a sluggish character. F values are high: inhibition of the shunting type can interact in a strongly nonlinear way with excitatory conductance inputs. (d) $\\delta$ -like cells show many subunits with a high input resistance, covering well the dendritic area. Within each subunit inhibition on the direct path to the soma can specifically veto a more distal excitation. It is conjectured that such a synaptic organization superimposed on the $\\delta$ cell morphology underlies directional selectivity to motion. (iii) Most of our data refer to steady-state properties. They probably apply, however, to all light evoked signals, since transient inputs with time to peak of 30 ms or more can be treated in terms of steady-state properties of the ganglion cells studied. (iv) All our results are affected only slightly by varying the parameter values within reasonable ranges. If, however, the membrane resistance were very high, all ganglion cells would approach equipotentiality. For R $\\_m$ = 8000 $\\Omega$ cm $^2$ subunits essentially disappear in all types of ganglion cells (for steady state inputs). Our results concerning nonlinear interaction of excitation and inhibition (F values) would, however, remain valid even for much larger values of R $\\_m$ and for any value of R $\\_i$ larger than 30-50 $\\Omega$ cm. The critical requirement is that peak inhibitory conductance changes must be sufficiently large (around 5 x 10 $^{-8}$ S) with an equilibrium potential close to the resting potential. Underestimation of the diameters of the dendritic branches may affect these conclusions (F could be significantly lower)."
            },
            "slug": "Retinal-ganglion-cells:-a-functional-interpretation-Koch-Poggio",
            "title": {
                "fragments": [],
                "text": "Retinal ganglion cells: a functional interpretation of dendritic morphology."
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The quantitative analysis of the morphology of cat retinal ganglion cells leads to the following specific conclusions: None of the cells examined satisfies Rall's equivalent cylinder condition, which means that these neurons need not be equipotential despite their small dimensions."
            },
            "venue": {
                "fragments": [],
                "text": "Philosophical transactions of the Royal Society of London. Series B, Biological sciences"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8028300"
                        ],
                        "name": "E. Grimson",
                        "slug": "E.-Grimson",
                        "structuredName": {
                            "firstName": "Eric",
                            "lastName": "Grimson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Grimson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61610981,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "b6c7a051ce690a913bac9c447500e035138c333e",
            "isKey": false,
            "numCitedBy": 439,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Based on the author's thesis (Ph.D.--Massachusetts Institute of Technology) Includes indexes."
            },
            "slug": "From-Images-to-Surfaces:-A-Computational-Study-of-Grimson",
            "title": {
                "fragments": [],
                "text": "From Images to Surfaces: A Computational Study of the Human Early Visual System"
            },
            "tldr": {
                "abstractSimilarityScore": 61,
                "text": "Based on the author's thesis (Ph.D.--Massachusetts Institute of Technology), this list of major indexes for the period of May 21 to 29, 1991 is based on the data available at the time of that date."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6270661"
                        ],
                        "name": "S. W. Kuffler",
                        "slug": "S.-W.-Kuffler",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Kuffler",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. W. Kuffler"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18591943,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "b446e3fb01026b4e5ad978812540f172405fff6f",
            "isKey": false,
            "numCitedBy": 2575,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": "THE DISCHARGES carried in the optic nerve fibers contain all the information which the central nervous system receives from the retina. A correct interpretation of discharge patterns therefore constitutes an important step in the analysis of visual events. Further, investigations of nervous activity arising in the eye reveal many aspects of the functional organization of the neural elements within the retina itself. Following studies of discharges in the optic nerve of the eel’s eye by Adrian and Matthews (2,3), Hartline and his colleagues described the discharge pattern in the eye of the Limulus in a series of important and lucid papers (for a summary see 20). In the Limulus the relationship between the stimulus to the primary receptor cell and the nerve discharges proved relatively simple, apparently because the connection between sense cell and nerve fiber was a direct one. Thus, when stimulation is confined to one receptor the discharge in a single Limulus nerve fiber will provide a good indication of excitatory events which take place as a result of photochemical processes. Discharges last for the duration of illumination and their frequency is a measure of stimulus strength. Lately, however, it was shown by Hartline et al. (22) that inhibitory interactions may be revealed when several receptors are excited. On the whole, the Limulus preparation shows many features which are similar to other simple sense organs, for instance, stretch receptors. In the latter, however, instead of photochemical events, stretch-deformation acts as the adequate stimulus on sensory terminals and is translated into a characteristic discharge pattern. The discharge from the cold-blooded vertebrate retina (mainly frogs) proved much more complex. Hartline found three main types when recording from single optic nerve fibers: (i) “on” discharges, similar to those in the Limulus, firing for the duration of the light stimulus, (ii) “off” discharges appearing when a light stimulus was withdrawn, and (iii) ‘con-off” discharges, a combination of the former two, with activity confined mainly to onset and cessation of illumination. The mammalian discharge patterns were studied in a number of species by Granit and his co-workers in the course of their extensive work on the physiology of the visual system (summaries in 13, 15). On the whole, they did not observe any fundamental differences between frog and mammalian discharge types (see later)."
            },
            "slug": "Discharge-patterns-and-functional-organization-of-Kuffler",
            "title": {
                "fragments": [],
                "text": "Discharge patterns and functional organization of mammalian retina."
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The Limulus preparation shows many features which are similar to other simple sense organs, for instance, stretch receptors, however, instead of photochemical events, stretch-deformation acts as the adequate stimulus on sensory terminals and is translated into a characteristic discharge pattern."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1953
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145847131"
                        ],
                        "name": "S. Kirkpatrick",
                        "slug": "S.-Kirkpatrick",
                        "structuredName": {
                            "firstName": "Scott",
                            "lastName": "Kirkpatrick",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Kirkpatrick"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5882723"
                        ],
                        "name": "C. D. Gelatt",
                        "slug": "C.-D.-Gelatt",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Gelatt",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. D. Gelatt"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "88645967"
                        ],
                        "name": "M. Vecchi",
                        "slug": "M.-Vecchi",
                        "structuredName": {
                            "firstName": "Michelle",
                            "lastName": "Vecchi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Vecchi"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 205939,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "dd5061631a4d11fa394f4421700ebf7e78dcbc59",
            "isKey": false,
            "numCitedBy": 39636,
            "numCiting": 79,
            "paperAbstract": {
                "fragments": [],
                "text": "There is a deep and useful connection between statistical mechanics (the behavior of systems with many degrees of freedom in thermal equilibrium at a finite temperature) and multivariate or combinatorial optimization (finding the minimum of a given function depending on many parameters). A detailed analogy with annealing in solids provides a framework for optimization of the properties of very large and complex systems. This connection to statistical mechanics exposes new information and provides an unfamiliar perspective on traditional optimization problems and methods."
            },
            "slug": "Optimization-by-Simulated-Annealing-Kirkpatrick-Gelatt",
            "title": {
                "fragments": [],
                "text": "Optimization by Simulated Annealing"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "A detailed analogy with annealing in solids provides a framework for optimization of the properties of very large and complex systems."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "94351389"
                        ],
                        "name": "R. O. Schmitt",
                        "slug": "R.-O.-Schmitt",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Schmitt",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. O. Schmitt"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2074507392"
                        ],
                        "name": "P. Dev",
                        "slug": "P.-Dev",
                        "structuredName": {
                            "firstName": "Parvati",
                            "lastName": "Dev",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Dev"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2157123139"
                        ],
                        "name": "B. H. Smith",
                        "slug": "B.-H.-Smith",
                        "structuredName": {
                            "firstName": "B",
                            "lastName": "Smith",
                            "middleNames": [
                                "H"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. H. Smith"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 41120842,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "45d7769983ef1d0f80396df05158781e67c6b5ed",
            "isKey": false,
            "numCitedBy": 332,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "In contrast to well-studied through-protection neurons that propagate information from one region to another in the central nervous system, short-axon or axonless neurons form local circuits, transmitting signals through synapses and electrical junctions between their dendrites. Interaction in this dendritic network proceeds without spike action potentials. Interaction is mediated by graded electrotonic changes of potential and is transmitted through high sensitivity (submillivolt threshold) synapses rather than by lower sensitivity (20 to 100-mv threshold) synapses typical of projection neurons. A crucial feature of local circuits is their high degree of interaction both through specialized junctional structures and through the extracellular fields generated by local and more distant brain regions. The anatomical evidence for the nature and distribution of neuronal local circuits in the nervous system is surveyed. Bioelectric mechanisms are discussed in relation to the special properties of local circuits, including dendrodendritic synapses, synaptic sensitivity, electrotonic coupling, and field effects. Intraneuronal and interneuronal transport of various types of substances suggests that the biochemical and the bioelectrical parameters are functionally interwoven. Through such interactions neuronal local circuits, with their distinctive properties, may play an essential role in higher brain function."
            },
            "slug": "Electrotonic-processing-of-information-by-brain-Schmitt-Dev",
            "title": {
                "fragments": [],
                "text": "Electrotonic processing of information by brain cells."
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "Intraneuronal and interneuronal transport of various types of substances suggests that the biochemical and the bioelectrical parameters are functionally interwoven, and neuronal local circuits, with their distinctive properties, may play an essential role in higher brain function."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "82184417"
                        ],
                        "name": "F. Plum",
                        "slug": "F.-Plum",
                        "structuredName": {
                            "firstName": "Fred",
                            "lastName": "Plum",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Plum"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 145434781,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "62b5ac92ebd1c7340684614426836ee66152cce8",
            "isKey": false,
            "numCitedBy": 10283,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This is the first volume of the proposed many-sectioned \"Handbook\" in which the American Physiological Society intends to present comprehensively the entire field of physiology. The scope and depth of the work may be estimated by realizing that the Section on Neurophysiology alone will comprise three volumes. The present work covers the following principal topics, all but the first of which are divided into several chapters: History of Neurophysiology (M. A. B. Brazier), Neuron Physiology (Introduction, J. C. Eccles), Brain Potentials and Rhythms (Introduction, A. Fessard), Sensory Mechanisms (Introduction, Lord Adrian), and Vision (Introduction, H. K. Hartline). To a large degree, the individual contributors have overcome the difficult task of presenting both the fundamentals and the most recent advances pertaining to their subjects. The historical development of knowledge and hypotheses about most of the particular topics is given detailed consideration, and this aspect alone should help to prevent the material"
            },
            "slug": "Handbook-of-Physiology.-Plum",
            "title": {
                "fragments": [],
                "text": "Handbook of Physiology."
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "This is the first volume of the proposed many-sectioned \"Handbook\" in which the American Physiological Society intends to present comprehensively the entire field of physiology."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1960
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3219867"
                        ],
                        "name": "J. Hopfield",
                        "slug": "J.-Hopfield",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Hopfield",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Hopfield"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2537503,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "24b9eebe49cf7e00cf50cf7b7d9243386a23fe7c",
            "isKey": false,
            "numCitedBy": 6274,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "A model for a large network of \"neurons\" with a graded response (or sigmoid input-output relation) is studied. This deterministic system has collective properties in very close correspondence with the earlier stochastic model based on McCulloch - Pitts neurons. The content- addressable memory and other emergent collective properties of the original model also are present in the graded response model. The idea that such collective properties are used in biological systems is given added credence by the continued presence of such properties for more nearly biological \"neurons.\" Collective analog electrical circuits of the kind described will certainly function. The collective states of the two models have a simple correspondence. The original model will continue to be useful for simulations, because its connection to graded response systems is established. Equations that include the effect of action potentials in the graded response system are also developed."
            },
            "slug": "Neurons-with-graded-response-have-collective-like-Hopfield",
            "title": {
                "fragments": [],
                "text": "Neurons with graded response have collective computational properties like those of two-state neurons."
            },
            "tldr": {
                "abstractSimilarityScore": 88,
                "text": "A model for a large network of \"neurons\" with a graded response (or sigmoid input-output relation) is studied and collective properties in very close correspondence with the earlier stochastic model based on McCulloch - Pitts neurons are studied."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the National Academy of Sciences of the United States of America"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145624227"
                        ],
                        "name": "C. Koch",
                        "slug": "C.-Koch",
                        "structuredName": {
                            "firstName": "Christof",
                            "lastName": "Koch",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Koch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 43596524,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "a1a61cd5b7f87f46447c1637c35f2adfb916fbc7",
            "isKey": false,
            "numCitedBy": 174,
            "numCiting": 73,
            "paperAbstract": {
                "fragments": [],
                "text": "The electrical properties of a cortical (spiny) pyramidal cell were analysed on the basis of passive cable theory from measurements made on histological material (C. Koch, T. Poggio & V. Torre, Phil. Trans. R. Soc. Lond. B 298, 227-264 (1982)). The basis of this analysis is the solution of the cable equation for an arbitrary branched dendritic tree. The conclusions, however, hold within a wide range of values of electrical parameters, provided that the membrane is passive. We determined the potential at the soma as a function of the synaptic input (transient conductance changes) and as a function of the spine neck dimensions, following a suggestion by W. Rall (Brain Inf. Serv. Res. Rep. 3, 13-21 (1974); Studies in neurophysiology (ed. R. Porter), pp. 203–209 (Cambridge University Press, 1978)) that the spine neck might be an important determinant in regulating the efficiency of synapses on spines. From our investigation four major points emerge. (i) Spines may effectively compress the effect of each single excitatory synapse on the soma, mapping a wide range of inputs onto a limited range of outputs (nonlinear saturation). This is also true for very fast transient inputs, in sharp contrast with the case of a synapse on a dendrite. (ii) The somatic depolarization due to an excitatory synapse on a spine is a very sensitive function of the spine neck length and diameter. Thus the spine can effectively control the attenuation of its input via the dimensions of the neck, thereby setting the shape of the resulting saturation curve. There is an optimal neck diameter for which variations of the neck are most effective in controlling the weight of the excitatory spine synapse. For reasonable parameter values this optimal value is consistent with anatomical data. This might be the basic mechanism underlying ultra-short memory, long-term potentiation in the hippo campus or learning in the cerebellum. (iii) Spines with shunting inhibitory synapses on them are ineffective in reducing the somatic depolarization due to excitatory inputs on the dendritic shaft or on other spines. Thus isolated inhibitory synapses on a spine are not expected to occur. (iv) The conjunction of an excitatory synapse with a shunting inhibitory synapse on the same spine may result in a time-discrimination circuit with a temporal resolution of around 100 μs."
            },
            "slug": "A-theoretical-analysis-of-electrical-properties-of-Koch-Poggio",
            "title": {
                "fragments": [],
                "text": "A theoretical analysis of electrical properties of spines"
            },
            "tldr": {
                "abstractSimilarityScore": 72,
                "text": "The electrical properties of a cortical (spiny) pyramidal cell were analysed on the basis of passive cable theory from measurements made on histological material and the conclusions hold within a wide range of values of electrical parameters, provided that the membrane is passive."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32922277"
                        ],
                        "name": "N. Metropolis",
                        "slug": "N.-Metropolis",
                        "structuredName": {
                            "firstName": "N.",
                            "lastName": "Metropolis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Metropolis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "91743329"
                        ],
                        "name": "A. W. Rosenbluth",
                        "slug": "A.-W.-Rosenbluth",
                        "structuredName": {
                            "firstName": "Arianna",
                            "lastName": "Rosenbluth",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. W. Rosenbluth"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2991661"
                        ],
                        "name": "M. Rosenbluth",
                        "slug": "M.-Rosenbluth",
                        "structuredName": {
                            "firstName": "Marshall",
                            "lastName": "Rosenbluth",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Rosenbluth"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46516796"
                        ],
                        "name": "A. H. Teller",
                        "slug": "A.-H.-Teller",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Teller",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. H. Teller"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3840350"
                        ],
                        "name": "E. Teller",
                        "slug": "E.-Teller",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Teller",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Teller"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1046577,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "f6a13f116e270dde9d67848495f801cdb8efa25d",
            "isKey": false,
            "numCitedBy": 32412,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "A general method, suitable for fast computing machines, for investigating such properties as equations of state for substances consisting of interacting individual molecules is described. The method consists of a modified Monte Carlo integration over configuration space. Results for the two‐dimensional rigid‐sphere system have been obtained on the Los Alamos MANIAC and are presented here. These results are compared to the free volume equation of state and to a four‐term virial coefficient expansion."
            },
            "slug": "Equation-of-state-calculations-by-fast-computing-Metropolis-Rosenbluth",
            "title": {
                "fragments": [],
                "text": "Equation of state calculations by fast computing machines"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1953
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33751355"
                        ],
                        "name": "F. O. Schmitt",
                        "slug": "F.-O.-Schmitt",
                        "structuredName": {
                            "firstName": "Francis",
                            "lastName": "Schmitt",
                            "middleNames": [
                                "Otto"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. O. Schmitt"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 9998044,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "9b8a992ca2321195c5eb260f78b5dc25674e6754",
            "isKey": false,
            "numCitedBy": 184,
            "numCiting": 62,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Molecular-regulators-of-brain-function:-A-new-view-Schmitt",
            "title": {
                "fragments": [],
                "text": "Molecular regulators of brain function: A new view"
            },
            "venue": {
                "fragments": [],
                "text": "Neuroscience"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143731352"
                        ],
                        "name": "W. Hillis",
                        "slug": "W.-Hillis",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Hillis",
                            "middleNames": [
                                "Daniel"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Hillis"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2923128,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d2d85364acaa8b32ee4b0e4c838ecd60ce47a0d0",
            "isKey": false,
            "numCitedBy": 2211,
            "numCiting": 66,
            "paperAbstract": {
                "fragments": [],
                "text": "The Connection Machine describes a fundamentally different kind of computer. It offers a preview of a parallel processing computer that Daniel Hillis and others are now developing to perform tasks that no conventional, sequential machine can solve in a reasonable time."
            },
            "slug": "The-connection-machine-Hillis",
            "title": {
                "fragments": [],
                "text": "The connection machine"
            },
            "tldr": {
                "abstractSimilarityScore": 75,
                "text": "The Connection Machine describes a fundamentally different kind of computer that Daniel Hillis and others are now developing to perform tasks that no conventional, sequential machine can solve in a reasonable time."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38751698"
                        ],
                        "name": "V. Morozov",
                        "slug": "V.-Morozov",
                        "structuredName": {
                            "firstName": "Vitali",
                            "lastName": "Morozov",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Morozov"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 118764354,
            "fieldsOfStudy": [
                "Education"
            ],
            "id": "b65f5f60618304c2cfa8431488f481888e1cc10c",
            "isKey": false,
            "numCitedBy": 967,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Spend your time even for only few minutes to read a book. Reading a book will never reduce and waste your time to be useless. Reading, for some people become a need that is to do every day such as spending time for eating. Now, what about you? Do you like to read a book? Now, we will show you a new book enPDFd methods for solving incorrectly posed problems that can be a new way to explore the knowledge. When reading this book, you can get one thing to always remember in every reading time, even step by step."
            },
            "slug": "Methods-for-Solving-Incorrectly-Posed-Problems-Morozov",
            "title": {
                "fragments": [],
                "text": "Methods for Solving Incorrectly Posed Problems"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "A new book enPDFd methods for solving incorrectly posed problems that can be a new way to explore the knowledge and get one thing to always remember in every reading time, even step by step is shown."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2801096"
                        ],
                        "name": "E. Marder",
                        "slug": "E.-Marder",
                        "structuredName": {
                            "firstName": "Eve",
                            "lastName": "Marder",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Marder"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 54429813,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "a998b338caea91d24670a8b50b8f82bdb8c7c01d",
            "isKey": false,
            "numCitedBy": 46,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Mechanisms-underlying-neurotransmitter-modulation-a-Marder",
            "title": {
                "fragments": [],
                "text": "Mechanisms underlying neurotransmitter modulation of a neuronal circuit"
            },
            "venue": {
                "fragments": [],
                "text": "Trends in Neurosciences"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2068869102"
                        ],
                        "name": "J. Jack",
                        "slug": "J.-Jack",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Jack",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Jack"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2067426146"
                        ],
                        "name": "D. Noble",
                        "slug": "D.-Noble",
                        "structuredName": {
                            "firstName": "Denis",
                            "lastName": "Noble",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Noble"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2529335"
                        ],
                        "name": "R. Tsien",
                        "slug": "R.-Tsien",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Tsien",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Tsien"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 135596366,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "7e9139be61faf63e41790aa811a8fe26e669473d",
            "isKey": false,
            "numCitedBy": 1176,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Conduction of Electrical Current to and Through the Human February 6th, 2017 PART A BASICS OF ELECTRICITY AND HOW IT INTERACTS WITH THE HUMAN BODY Electric shock is defined as a sudden violent response to electric current flow through any part of a person s body Electrocution is death caused by electric shock Primary electrical injury is tissue damage produced directly by electrical current or voltage Secondary injuries such as falls are common"
            },
            "slug": "Electric-current-flow-in-excitable-cells-Jack-Noble",
            "title": {
                "fragments": [],
                "text": "Electric current flow in excitable cells"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143639508"
                        ],
                        "name": "A. Tikhonov",
                        "slug": "A.-Tikhonov",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Tikhonov",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Tikhonov"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102992139"
                        ],
                        "name": "Vasiliy Yakovlevich Arsenin",
                        "slug": "Vasiliy-Yakovlevich-Arsenin",
                        "structuredName": {
                            "firstName": "Vasiliy",
                            "lastName": "Arsenin",
                            "middleNames": [
                                "Yakovlevich"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Vasiliy Yakovlevich Arsenin"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122072756,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "bc14819e745cd7af37efd09ea29773dc0065119e",
            "isKey": false,
            "numCitedBy": 7884,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Solutions-of-ill-posed-problems-Tikhonov-Arsenin",
            "title": {
                "fragments": [],
                "text": "Solutions of ill-posed problems"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48270890"
                        ],
                        "name": "J. Hadamard",
                        "slug": "J.-Hadamard",
                        "structuredName": {
                            "firstName": "Jacques",
                            "lastName": "Hadamard",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Hadamard"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34540075"
                        ],
                        "name": "P. Morse",
                        "slug": "P.-Morse",
                        "structuredName": {
                            "firstName": "Philip",
                            "lastName": "Morse",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Morse"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 121693976,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "a1bd5979fc091456a2da2c24bf21fa34ce888c0f",
            "isKey": false,
            "numCitedBy": 1893,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Lectures-on-Cauchy's-Problem-in-Linear-Partial-Hadamard-Morse",
            "title": {
                "fragments": [],
                "text": "Lectures on Cauchy's Problem in Linear Partial Differential Equations"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1924
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152512161"
                        ],
                        "name": "JOHN W. Moore",
                        "slug": "JOHN-W.-Moore",
                        "structuredName": {
                            "firstName": "JOHN W.",
                            "lastName": "Moore",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "JOHN W. Moore"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 92696468,
            "fieldsOfStudy": [
                "Chemistry"
            ],
            "id": "8f252cfc29386d15ceb8f893574e8a63ccef76b1",
            "isKey": false,
            "numCitedBy": 669,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Membranes,-ions,-and-impulses-Moore",
            "title": {
                "fragments": [],
                "text": "Membranes, ions, and impulses"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40041644"
                        ],
                        "name": "C. Chagas",
                        "slug": "C.-Chagas",
                        "structuredName": {
                            "firstName": "Carlos",
                            "lastName": "Chagas",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Chagas"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3202245"
                        ],
                        "name": "R. Gattass",
                        "slug": "R.-Gattass",
                        "structuredName": {
                            "firstName": "Ricardo",
                            "lastName": "Gattass",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Gattass"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2385092"
                        ],
                        "name": "C. Gross",
                        "slug": "C.-Gross",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Gross",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Gross"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "67142978"
                        ],
                        "name": "Pontificia Accademia Delle Scienze",
                        "slug": "Pontificia-Accademia-Delle-Scienze",
                        "structuredName": {
                            "firstName": "Pontificia",
                            "lastName": "Scienze",
                            "middleNames": [
                                "Accademia",
                                "Delle"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Pontificia Accademia Delle Scienze"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 82458937,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3fb4f645e84e65f472fa6865222f6c082fb54d5d",
            "isKey": false,
            "numCitedBy": 248,
            "numCiting": 40,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Pattern-recognition-mechanisms-Chagas-Gattass",
            "title": {
                "fragments": [],
                "text": "Pattern recognition mechanisms"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1824520"
                        ],
                        "name": "G. Shepherd",
                        "slug": "G.-Shepherd",
                        "structuredName": {
                            "firstName": "Gordon",
                            "lastName": "Shepherd",
                            "middleNames": [
                                "M.",
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Shepherd"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1737060"
                        ],
                        "name": "R. Brayton",
                        "slug": "R.-Brayton",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Brayton",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Brayton"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 45948274,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "b2148a056b96b612a9cb614b9463878b3b47b75d",
            "isKey": false,
            "numCitedBy": 88,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Computer-simulation-of-a-dendrodendritic-synaptic-Shepherd-Brayton",
            "title": {
                "fragments": [],
                "text": "Computer simulation of a dendrodendritic synaptic circuit for self- and lateral-inhibition in the olfactory bulb"
            },
            "venue": {
                "fragments": [],
                "text": "Brain Research"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 3240988,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "5d977ee72fd0aaf8c2ac2808c9dd522cdef8b4b7",
            "isKey": false,
            "numCitedBy": 839,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Summation-and-inhibition-in-the-frog's-retina-Barlow",
            "title": {
                "fragments": [],
                "text": "Summation and inhibition in the frog's retina"
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1953
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 41,
        "totalPages": 5
    },
    "page_url": "https://www.semanticscholar.org/paper/Computational-vision-and-regularization-theory-Poggio-Torre/4c6bd3b8d35c4fc14360160efc9c66727abac9df?sort=total-citations"
}