{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145430701"
                        ],
                        "name": "J. Pearl",
                        "slug": "J.-Pearl",
                        "structuredName": {
                            "firstName": "Judea",
                            "lastName": "Pearl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Pearl"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14936636,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "99485775cce4c1afa7361a7fcbd3c9d362309554",
            "isKey": false,
            "numCitedBy": 886,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents generalizations of Bayes likelihood-ratio updating rule which facilitate an asynchronous propagation of the impacts of new beliefs and/or new evidence in hierarchically organized inference structures with multi-hypotheses variables. The computational scheme proposed specifies a set of belief parameters, communication messages and updating rules which guarantee that the diffusion of updated beliefs is accomplished in a single pass and complies with the tenets of Bayes calculus."
            },
            "slug": "Reverend-Bayes-on-Inference-Engines:-A-Distributed-Pearl",
            "title": {
                "fragments": [],
                "text": "Reverend Bayes on Inference Engines: A Distributed Hierarchical Approach"
            },
            "tldr": {
                "abstractSimilarityScore": 92,
                "text": "Generalizations of Bayes likelihood-ratio updating rule are presented which facilitate an asynchronous propagation of the impacts of new beliefs and/or new evidence in hierarchically organized inference structures with multi-hypotheses variables."
            },
            "venue": {
                "fragments": [],
                "text": "AAAI"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2064181"
                        ],
                        "name": "A. Tversky",
                        "slug": "A.-Tversky",
                        "structuredName": {
                            "firstName": "Amos",
                            "lastName": "Tversky",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Tversky"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3683465"
                        ],
                        "name": "D. Kahneman",
                        "slug": "D.-Kahneman",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Kahneman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Kahneman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 201311423,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "95a0c7fcb2516044f88cc2a14942953fa71786eb",
            "isKey": false,
            "numCitedBy": 638,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : In contrast to the normative theory of evidence, where the impact of data is determined solely by their informativeness, this paper develops the thesis that the impact of evidence on intuitive judgements of probabilities depends critically on whether it is perceived as causal, diagnostic or incidental. The first part of the paper shows that people assign greater impact to causal data than to diagnostic data of equal informativeness. When the same datum has both causal and diagnostic implications, the former dominate the latter. The ease with which people explain unexpected facts and the reluctance to revise old conceptions in the light of new facts are related to the dominance of causal over diagnostic reasoning. The second part of the paper analyzes the use and neglect of base-rate data in terms of the role of these data in causal schemata. It is shown that base-rate information which is given a causal interpretation affects judgments, while base-rate information which cannot be interpreted in this manner is given little or no weight."
            },
            "slug": "Causal-Schemata-in-Judgments-under-Uncertainty-Tversky-Kahneman",
            "title": {
                "fragments": [],
                "text": "Causal Schemata in Judgments under Uncertainty"
            },
            "tldr": {
                "abstractSimilarityScore": 56,
                "text": "This paper develops the thesis that the impact of evidence on intuitive judgements of probabilities depends critically on whether it is perceived as causal, diagnostic or incidental, and shows that people assign greater impact to causal data than to diagnostic data of equal informativeness."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145500409"
                        ],
                        "name": "G. Shafer",
                        "slug": "G.-Shafer",
                        "structuredName": {
                            "firstName": "Glenn",
                            "lastName": "Shafer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Shafer"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 195,
                                "start": 184
                            }
                        ],
                        "text": "For t h i s case, the combining formula is\nNote that t h i s formula resembles the Dempster's ru l e of combination known as \"orthogonal sum\" devised f o r the treatment of ignoranoe (Shafer 1976) ."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 127,
                                "start": 116
                            }
                        ],
                        "text": "However, one may re lax t h i s cons t ra in t to represent the degree of ignoranoe such as Dempster-Shafer system (Shafer 1976).\nwhere a is a normal izat ion constant."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 27862354,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "4cd91c51098783ec972f6a0ab430cacdd634a5b2",
            "isKey": false,
            "numCitedBy": 14561,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "Both in science and in practical affairs we reason by combining facts only inconclusively supported by evidence. Building on an abstract understanding of this process of combination, this book constructs a new theory of epistemic probability. The theory draws on the work of A. P. Dempster but diverges from Depster's viewpoint by identifying his \"lower probabilities\" as epistemic probabilities and taking his rule for combining \"upper and lower probabilities\" as fundamental. The book opens with a critique of the well-known Bayesian theory of epistemic probability. It then proceeds to develop an alternative to the additive set functions and the rule of conditioning of the Bayesian theory: set functions that need only be what Choquet called \"monotone of order of infinity.\" and Dempster's rule for combining such set functions. This rule, together with the idea of \"weights of evidence,\" leads to both an extensive new theory and a better understanding of the Bayesian theory. The book concludes with a brief treatment of statistical inference and a discussion of the limitations of epistemic probability. Appendices contain mathematical proofs, which are relatively elementary and seldom depend on mathematics more advanced that the binomial theorem."
            },
            "slug": "A-Mathematical-Theory-of-Evidence-Shafer",
            "title": {
                "fragments": [],
                "text": "A Mathematical Theory of Evidence"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "This book develops an alternative to the additive set functions and the rule of conditioning of the Bayesian theory: set functions that need only be what Choquet called \"monotone of order of infinity.\" and Dempster's rule for combining such set functions."
            },
            "venue": {
                "fragments": [],
                "text": "A Mathematical Theory of Evidence"
            },
            "year": 2020
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2052784108"
                        ],
                        "name": "Michael J. Burns",
                        "slug": "Michael-J.-Burns",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Burns",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michael J. Burns"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145430701"
                        ],
                        "name": "J. Pearl",
                        "slug": "J.-Pearl",
                        "structuredName": {
                            "firstName": "Judea",
                            "lastName": "Pearl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Pearl"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 260,
                                "start": 237
                            }
                        ],
                        "text": "The reason is that usually the probability P(manifestation!cause) is psychologically more available (Tversky and Kahneman, 1979), and therefore, can be elicited with greater ease and validity than its counterpart, P(cause[manifestation) (Burns and Pearl, 1981)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 121548107,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "7ab7ae534033e443205f61d8184c166a36e52838",
            "isKey": false,
            "numCitedBy": 26,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Causal-and-diagnostic-inferences:-A-comparison-of-Burns-Pearl",
            "title": {
                "fragments": [],
                "text": "Causal and diagnostic inferences: A comparison of validity"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34886242"
                        ],
                        "name": "R. Patil",
                        "slug": "R.-Patil",
                        "structuredName": {
                            "firstName": "Ramesh",
                            "lastName": "Patil",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Patil"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1679873"
                        ],
                        "name": "Peter Szolovits",
                        "slug": "Peter-Szolovits",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Szolovits",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Peter Szolovits"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2022507"
                        ],
                        "name": "W. Schwartz",
                        "slug": "W.-Schwartz",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Schwartz",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Schwartz"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 228572,
            "fieldsOfStudy": [
                "Medicine"
            ],
            "id": "fc79391e2d08c6265fa30669a21b8b3cc08ac147",
            "isKey": false,
            "numCitedBy": 248,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "First generation AI in Medicine programs have clearly demonstrated the usefulness of AI techniques However, il has also been recognized that the use. of notions such as causal relationships, temporal patterns, and aggregate disease categories in these programs has been too weak From our study of clinician's behavior we realized that a diagnostic or therapeutic program must consider a case at various levels of detail to integrate overall understanding with detailed knowledge, To explore these issues, we have undertaken a study of the problem of providing expert consultation for electrolyte and acid-base disturbances We have partly completed an implementation of ABEL, the diagnostic component of the overall effort. In this paper we concentrate on ABLL.s mechanism for describing a patient. Called the patient-specific model, this description includes data about the patient as well as the program's hypothetical interpretations of these data in a multilevel causal network. The lowest level of this description consists of pathophysiological knowledge about the patient, which is successively aggregated into higher level concepts and relations, gradually shifting the content from pathophysiological to syndromic knowledge The aggregate level of this description summarizes the patient data providing a global perspective for efficient exploration of the diagnostic possibilities The pathophysiological level description provides the ability to handle complex clinical situations arising in illnesses with multiple etiologies, to evaluate the physiological validity of diagnostic possibilities being explored, and to organize large amounts of seemingly unrelated facts into coherent causal descriptions."
            },
            "slug": "Causal-Understanding-of-Patient-Illness-in-Medical-Patil-Szolovits",
            "title": {
                "fragments": [],
                "text": "Causal Understanding of Patient Illness in Medical Diagnosis"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "A mechanism for describing a patient with the ability to handle complex clinical situations arising in illnesses with multiple etiologies, to evaluate the physiological validity of diagnostic possibilities being explored, and to organize large amounts of seemingly unrelated facts into coherent causal descriptions is presented."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102636025"
                        ],
                        "name": "C. Chow",
                        "slug": "C.-Chow",
                        "structuredName": {
                            "firstName": "C.",
                            "lastName": "Chow",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Chow"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2119394814"
                        ],
                        "name": "C. N. Liu",
                        "slug": "C.-N.-Liu",
                        "structuredName": {
                            "firstName": "C.",
                            "lastName": "Liu",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. N. Liu"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 27127853,
            "fieldsOfStudy": [
                "Mathematics",
                "Computer Science"
            ],
            "id": "683fe3bbf2b2e628cf40d90e35fb39effc63b7e9",
            "isKey": false,
            "numCitedBy": 2729,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "A method is presented to approximate optimally an n -dimensional discrete probability distribution by a product of second-order distributions, or the distribution of the first-order tree dependence. The problem is to find an optimum set of n - 1 first order dependence relationship among the n variables. It is shown that the procedure derived in this paper yields an approximation of a minimum difference in information. It is further shown that when this procedure is applied to empirical observations from an unknown distribution of tree dependence, the procedure is the maximum-likelihood estimate of the distribution."
            },
            "slug": "Approximating-discrete-probability-distributions-Chow-Liu",
            "title": {
                "fragments": [],
                "text": "Approximating discrete probability distributions with dependence trees"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "It is shown that the procedure derived in this paper yields an approximation of a minimum difference in information when applied to empirical observations from an unknown distribution of tree dependence, and the procedure is the maximum-likelihood estimate of the distribution."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Inf. Theory"
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "118836810"
                        ],
                        "name": "Scott W. Barclay",
                        "slug": "Scott-W.-Barclay",
                        "structuredName": {
                            "firstName": "Scott",
                            "lastName": "Barclay",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Scott W. Barclay"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2109432620"
                        ],
                        "name": "Rex V. Brown",
                        "slug": "Rex-V.-Brown",
                        "structuredName": {
                            "firstName": "Rex",
                            "lastName": "Brown",
                            "middleNames": [
                                "V."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Rex V. Brown"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "67048237"
                        ],
                        "name": "C. W. Kelly",
                        "slug": "C.-W.-Kelly",
                        "structuredName": {
                            "firstName": "Clinton",
                            "lastName": "Kelly",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. W. Kelly"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50145007"
                        ],
                        "name": "C. Peterson",
                        "slug": "C.-Peterson",
                        "structuredName": {
                            "firstName": "Cameron",
                            "lastName": "Peterson",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Peterson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145431344"
                        ],
                        "name": "L. Phillips",
                        "slug": "L.-Phillips",
                        "structuredName": {
                            "firstName": "Lawrence",
                            "lastName": "Phillips",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Phillips"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60708652,
            "fieldsOfStudy": [
                "Sociology",
                "Economics"
            ],
            "id": "bbd37d26a2bd074a5c10d5f909dc5e9343e7c6d2",
            "isKey": false,
            "numCitedBy": 66,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : This handbook is intended to provide decision makers and their staffs (current or potential) with an introduction to the basic concepts and operations of decision analysis. Decision analysis is a quantitative method which permits the systematic evaluation of the costs or benefits accruing to courses of action that might be taken in a decision problem. It entails identification of the alternative choices involved, the assignment of values (costs/benefits) for possible outcomes, and the expression of the probability of those outcomes being realized. With this information at hand, one can then systematically combine the values and probabilities to show the probable gain or loss that is associated with alternative choices."
            },
            "slug": "Handbook-for-Decision-Analysis-Barclay-Brown",
            "title": {
                "fragments": [],
                "text": "Handbook for Decision Analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 79,
                "text": "This handbook is intended to provide decision makers and their staffs with an introduction to the basic concepts and operations of decision analysis."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Hillsdale, Eribaum Associates"
            },
            "venue": {
                "fragments": [],
                "text": "Hillsdale, Eribaum Associates"
            },
            "year": 1979
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Causa l Schemata i n judgments Under U n c e r t a i n t y , \" i n P rog ress i n S o c i a l Psycho logy"
            },
            "venue": {
                "fragments": [],
                "text": "Vancouver , Canada,"
            },
            "year": 1979
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Decision and Design IncHandbook of Decision Analysis"
            },
            "venue": {
                "fragments": [],
                "text": "Decision and Design IncHandbook of Decision Analysis"
            },
            "year": 1973
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 2,
            "methodology": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 10,
        "totalPages": 1
    },
    "page_url": "https://www.semanticscholar.org/paper/A-Computational-Model-for-Causal-and-Diagnostic-in-Kim-Pearl/f8d16924d37ac2ad2fe23e641673f9f2b5434733?sort=total-citations"
}