{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3148558"
                        ],
                        "name": "S. Zhong",
                        "slug": "S.-Zhong",
                        "structuredName": {
                            "firstName": "Sifen",
                            "lastName": "Zhong",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Zhong"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122474222,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "fe226845b369b48e063f6cc180520a6f23f9af11",
            "isKey": false,
            "numCitedBy": 27,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The multiscale edges of a signal are the sharp variation points measured at different scales. This thesis studies a model of multiscale edge representation based on the local maxima wavelet transform. The wavelet transform is a mathematical formulation of a multiscale decomposition. It decomposes a signal into multiple components indexed by a scale parameter. A particular class of wavelets are used such that each of these components is the first derivative of a smooth version of the signal, with the scale parameter indicating the degree of smoothing. The local maxima of this wavelet transform is therefore a multiscale edge representation. This thesis shows that the local maxima not only identify the edges but also characterize the edges. An algorithm to reconstruct a signal from its local maximum representation is developed. The experimental results show that the algorithm reconstructs the original signal, and this reconstruction is stable. This implies that the local maximum representation is a reorganization of the signal information. Therefore, various pattern analysis algorithms can be developed uniquely based on the properties of edges. Image processing can also be done through the multiscale edge representation. An application to image coding is described."
            },
            "slug": "Edge-representation-from-wavelet-transform-maxima-Zhong",
            "title": {
                "fragments": [],
                "text": "Edge representation from wavelet transform maxima"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1746242"
                        ],
                        "name": "S. Mallat",
                        "slug": "S.-Mallat",
                        "structuredName": {
                            "firstName": "Stéphane",
                            "lastName": "Mallat",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Mallat"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144393117"
                        ],
                        "name": "W. Hwang",
                        "slug": "W.-Hwang",
                        "structuredName": {
                            "firstName": "Wen-Liang",
                            "lastName": "Hwang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Hwang"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2661011,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "7756c24837b1f9ca3fc5be4ce7b4de0fcf9de8e6",
            "isKey": false,
            "numCitedBy": 4078,
            "numCiting": 41,
            "paperAbstract": {
                "fragments": [],
                "text": "The mathematical characterization of singularities with Lipschitz exponents is reviewed. Theorems that estimate local Lipschitz exponents of functions from the evolution across scales of their wavelet transform are reviewed. It is then proven that the local maxima of the wavelet transform modulus detect the locations of irregular structures and provide numerical procedures to compute their Lipschitz exponents. The wavelet transform of singularities with fast oscillations has a particular behavior that is studied separately. The local frequency of such oscillations is measured from the wavelet transform modulus maxima. It has been shown numerically that one- and two-dimensional signals can be reconstructed, with a good approximation, from the local maxima of their wavelet transform modulus. As an application, an algorithm is developed that removes white noises from signals by analyzing the evolution of the wavelet transform maxima across scales. In two dimensions, the wavelet transform maxima indicate the location of edges in images. >"
            },
            "slug": "Singularity-detection-and-processing-with-wavelets-Mallat-Hwang",
            "title": {
                "fragments": [],
                "text": "Singularity detection and processing with wavelets"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "It is proven that the local maxima of the wavelet transform modulus detect the locations of irregular structures and provide numerical procedures to compute their Lipschitz exponents."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Inf. Theory"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1873105"
                        ],
                        "name": "J. Froment",
                        "slug": "J.-Froment",
                        "structuredName": {
                            "firstName": "Jacques",
                            "lastName": "Froment",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Froment"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1746242"
                        ],
                        "name": "S. Mallat",
                        "slug": "S.-Mallat",
                        "structuredName": {
                            "firstName": "Stéphane",
                            "lastName": "Mallat",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Mallat"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 118269387,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "7dbadec28bb6d9424b4444f9aa9c5a5aed08230e",
            "isKey": false,
            "numCitedBy": 105,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Second-generation-compact-image-coding-with-Froment-Mallat",
            "title": {
                "fragments": [],
                "text": "Second generation compact image coding with wavelets"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1746242"
                        ],
                        "name": "S. Mallat",
                        "slug": "S.-Mallat",
                        "structuredName": {
                            "firstName": "Stéphane",
                            "lastName": "Mallat",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Mallat"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 26567059,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d5d814bdb19f521ca8cc52b168de0e0f6674bfcb",
            "isKey": false,
            "numCitedBy": 754,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "The completeness, stability, and application to pattern recognition of a multiscale representation based on zero-crossings is discussed. An alternative projection algorithm is described that reconstructs a signal from a zero-crossing representation, which is stabilized by keeping the value of the wavelet transform integral between each pair of consecutive zero-crossings. The reconstruction algorithm has a fast convergence and each iteration requires O(N log/sup 2/ (N)) computation for a signal of N samples. The zero-crossings of a wavelet transform define a representation which is particularly well adapted for solving pattern recognition problems. As an example, the implementation and results of a coarse-to-fine stereo-matching algorithm are described. >"
            },
            "slug": "Zero-crossings-of-a-wavelet-transform-Mallat",
            "title": {
                "fragments": [],
                "text": "Zero-crossings of a wavelet transform"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "An alternative projection algorithm is described that reconstructs a signal from azero-crossing representation, which is stabilized by keeping the value of the wavelet transform integral between each pair of consecutive zero-crossings."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Inf. Theory"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31857045"
                        ],
                        "name": "E. Hildreth",
                        "slug": "E.-Hildreth",
                        "structuredName": {
                            "firstName": "Ellen",
                            "lastName": "Hildreth",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Hildreth"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2150419,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "9009c9685754346deb93f316144a9da1f70ffcd8",
            "isKey": false,
            "numCitedBy": 7031,
            "numCiting": 62,
            "paperAbstract": {
                "fragments": [],
                "text": "A theory of edge detection is presented. The analysis proceeds in two parts. (1) Intensity changes, which occur in a natural image over a wide range of scales, are detected separately at different scales. An appropriate filter for this purpose at a given scale is found to be the second derivative of a Gaussian, and it is shown that, provided some simple conditions are satisfied, these primary filters need not be orientation-dependent. Thus, intensity changes at a given scale are best detected by finding the zero values of ∇2G(x, y)* I(x, y) for image I, where G(x, y) is a two-dimensional Gaussian distribution and ∇2 is the Laplacian. The intensity changes thus discovered in each of the channels are then represented by oriented primitives called zero-crossing segments, and evidence is given that this representation is complete. (2) Intensity changes in images arise from surface discontinuities or from reflectance or illumination boundaries, and these all have the property that they are spatially localized. Because of this, the zero-crossing segments from the different channels are not independent, and rules are deduced for combining them into a description of the image. This description is called the raw primal sketch. The theory explains several basic psychophysical findings, and the operation of forming oriented zero-crossing segments from the output of centre-surround ∇2G filters acting on the image forms the basis for a physiological model of simple cells (see Marr & Ullman 1979)."
            },
            "slug": "Theory-of-edge-detection-Marr-Hildreth",
            "title": {
                "fragments": [],
                "text": "Theory of edge detection"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The theory of edge detection explains several basic psychophysical findings, and the operation of forming oriented zero-crossing segments from the output of centre-surround ∇2G filters acting on the image forms the basis for a physiological model of simple cells."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1746242"
                        ],
                        "name": "S. Mallat",
                        "slug": "S.-Mallat",
                        "structuredName": {
                            "firstName": "Stéphane",
                            "lastName": "Mallat",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Mallat"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17360391,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "37542b485661f7fcdfc17c165e997c87400df2fd",
            "isKey": false,
            "numCitedBy": 2123,
            "numCiting": 85,
            "paperAbstract": {
                "fragments": [],
                "text": "The author reviews recent multichannel models developed in psychophysiology, computer vision, and image processing. In psychophysiology, multichannel models have been particularly successful in explaining some low-level processing in the visual cortex. The expansion of a function into several frequency channels provides a representation which is intermediate between a spatial and a Fourier representation. The author describes the mathematical properties of such decompositions and introduces the wavelet transform. He reviews the classical multiresolution pyramidal transforms developed in computer vision and shows how they relate to the decomposition of an image into a wavelet orthonormal basis. He discusses the properties of the zero crossings of multifrequency channels. Zero-crossing representations are particularly well adapted for pattern recognition in computer vision. >"
            },
            "slug": "Multifrequency-channel-decompositions-of-images-and-Mallat",
            "title": {
                "fragments": [],
                "text": "Multifrequency channel decompositions of images and wavelet models"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The author describes the mathematical properties of such decompositions and introduces the wavelet transform, which relates to the decomposition of an image into a wavelet orthonormal basis."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Acoust. Speech Signal Process."
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1729041"
                        ],
                        "name": "J. Canny",
                        "slug": "J.-Canny",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Canny",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Canny"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 13284142,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "fcf9fc4e23b45345c2404ce7d6cb0fc9dea2c9ec",
            "isKey": false,
            "numCitedBy": 27661,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes a computational approach to edge detection. The success of the approach depends on the definition of a comprehensive set of goals for the computation of edge points. These goals must be precise enough to delimit the desired behavior of the detector while making minimal assumptions about the form of the solution. We define detection and localization criteria for a class of edges, and present mathematical forms for these criteria as functionals on the operator impulse response. A third criterion is then added to ensure that the detector has only one response to a single edge. We use the criteria in numerical optimization to derive detectors for several common image features, including step edges. On specializing the analysis to step edges, we find that there is a natural uncertainty principle between detection and localization performance, which are the two main goals. With this principle we derive a single operator shape which is optimal at any scale. The optimal detector has a simple approximate implementation in which edges are marked at maxima in gradient magnitude of a Gaussian-smoothed image. We extend this simple detector using operators of several widths to cope with different signal-to-noise ratios in the image. We present a general method, called feature synthesis, for the fine-to-coarse integration of information from operators at different scales. Finally we show that step edge detector performance improves considerably as the operator point spread function is extended along the edge."
            },
            "slug": "A-Computational-Approach-to-Edge-Detection-Canny",
            "title": {
                "fragments": [],
                "text": "A Computational Approach to Edge Detection"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "There is a natural uncertainty principle between detection and localization performance, which are the two main goals, and with this principle a single operator shape is derived which is optimal at any scale."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1809905"
                        ],
                        "name": "A. Witkin",
                        "slug": "A.-Witkin",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Witkin",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Witkin"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7096897,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a26f893c224ed6e3df1f37479de0e774a4cae237",
            "isKey": false,
            "numCitedBy": 2873,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Scale-Space-Filtering-Witkin",
            "title": {
                "fragments": [],
                "text": "Scale-Space Filtering"
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30489560"
                        ],
                        "name": "R. Hummel",
                        "slug": "R.-Hummel",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Hummel",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Hummel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2257526"
                        ],
                        "name": "R. Moniot",
                        "slug": "R.-Moniot",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Moniot",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Moniot"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 36623247,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "c6f346abdbcd2ada367a04ecbce30ae68b030ff4",
            "isKey": false,
            "numCitedBy": 189,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "In computer vision, the one-parameter family of images obtained from the Laplacian-of-a-Gaussian-filtered version of the image, parameterized by the width of the Gaussian, has proved to be a useful data structure for the extraction of feature data. In particular, the zero crossings of this so-called scale-space data are associated with edges and have been proposed by D. Marr (1982) and others as the basis of a representation of the image data. The question arises as to whether the representation is complete and stable. The authors survey some of the studies and results related to these questions as well as several studies that attempt reconstructions based on this or related representations. They formulate a novel method for reconstruction from zero crossings in scale space that is based on minimizing equation error, and they present results showing that the reconstruction is possible but can be unstable. They further show that the method applies when gradient data along the zero crossings are included in the representation, and they demonstrate empirically that the reconstruction is then stable. >"
            },
            "slug": "Reconstructions-from-zero-crossings-in-scale-space-Hummel-Moniot",
            "title": {
                "fragments": [],
                "text": "Reconstructions from zero crossings in scale space"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "A novel method for reconstruction from zero crossings in scale space that is based on minimizing equation error is formulated and presented, and results showing that the reconstruction is possible but can be unstable are presented."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Acoust. Speech Signal Process."
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145081362"
                        ],
                        "name": "A. Yuille",
                        "slug": "A.-Yuille",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Yuille",
                            "middleNames": [
                                "Loddon"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Yuille"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14815630,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "d352cf71946e7f4b229d30c614e504424633a62a",
            "isKey": false,
            "numCitedBy": 726,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "We characterize some properties of the zero crossings of the Laplacian of signals¿in particular images¿filtered with linear filters, as a function of the scale of the filter (extending recent work by Witkin [16]). We prove that in any dimension the only filter that does not create generic zero crossings as the scale increases is the Gaussian. This result can be generalized to apply to level crossings of any linear differential operator: it applies in particular to ridges and ravines in the image intensity. In the case of the second derivative along the gradient, there is no filter that avoids creation of zero crossings, unless the filtering is performed after the derivative is applied."
            },
            "slug": "Scaling-Theorems-for-Zero-Crossings-Yuille-Poggio",
            "title": {
                "fragments": [],
                "text": "Scaling Theorems for Zero Crossings"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "It is proved that in any dimension the only filter that does not create generic zero crossings as the scale increases is the Gaussian and this result can be generalized to apply to level crossings of any linear differential operator."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1809905"
                        ],
                        "name": "A. Witkin",
                        "slug": "A.-Witkin",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Witkin",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Witkin"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11755124,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f58b22395f9585c3da65bbc948c67eed3377f701",
            "isKey": false,
            "numCitedBy": 1126,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "The extrema in a signal and its first few derivatives provide a useful general purpose qualitative description for many kinds of signals. A fundamental problem in computing such descriptions is scale: a derivative must be taken over some neighborhood, but there is seldom a principled basis for choosing its size. Scale-space filtering is a method that describes signals qualitatively, managing the ambiguity of scale in an organized and natural way. The signal is first expanded by convolution with gaussian masks over a continuum of sizes. This \"scale-space\" image is then collapsed, using its qualitative structure, into a tree providing a concise but complete qualitative description covering all scales of observation. The description is further refined by applying a stability criterion, to identify events that persist of large changes in scale."
            },
            "slug": "Scale-space-filtering:-A-new-approach-to-Witkin",
            "title": {
                "fragments": [],
                "text": "Scale-space filtering: A new approach to multi-scale description"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "Scale-space filtering is a method that describes signals qualitatively, managing the ambiguity of scale in an organized and natural way."
            },
            "venue": {
                "fragments": [],
                "text": "ICASSP"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143766793"
                        ],
                        "name": "A. Rosenfeld",
                        "slug": "A.-Rosenfeld",
                        "structuredName": {
                            "firstName": "Azriel",
                            "lastName": "Rosenfeld",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rosenfeld"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46720503"
                        ],
                        "name": "M. Thurston",
                        "slug": "M.-Thurston",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Thurston",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Thurston"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 206618628,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c901dd790abcb04f258ea29655a8a8401c715fca",
            "isKey": false,
            "numCitedBy": 770,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "Simple sets of parallel operations are described which can be used to detect texture edges, \"spots,\" and \"streaks\" in digitized pictures. It is shown that, by comparing the outputs of the operations corresponding to (e.g.,) edges of different sizes, one can construct a composite output in which edges between differently textured regions are detected, and isolated objects are also detected, but the objects composing the textures are ignored. Relationships between this class of picture processing operations and the Gestalt psychologists' laws of pictorial pattern organization are also discussed."
            },
            "slug": "Edge-and-Curve-Detection-for-Visual-Scene-Analysis-Rosenfeld-Thurston",
            "title": {
                "fragments": [],
                "text": "Edge and Curve Detection for Visual Scene Analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 72,
                "text": "Simple sets of parallel operations are described which can be used to detect texture edges, \"spots,\" and \"streaks\" in digitized pictures and it is shown that a composite output is constructed in which edges between differently textured regions are detected, and isolated objects are also detected, but the objects composing the textures are ignored."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Computers"
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1755659"
                        ],
                        "name": "O. Rioul",
                        "slug": "O.-Rioul",
                        "structuredName": {
                            "firstName": "Olivier",
                            "lastName": "Rioul",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Rioul"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145876744"
                        ],
                        "name": "M. Vetterli",
                        "slug": "M.-Vetterli",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Vetterli",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Vetterli"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 13266737,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "25d3243df862f04de7f26b287c8383a0361831ad",
            "isKey": false,
            "numCitedBy": 2930,
            "numCiting": 135,
            "paperAbstract": {
                "fragments": [],
                "text": "A simple, nonrigorous, synthetic view of wavelet theory is presented for both review and tutorial purposes. The discussion includes nonstationary signal analysis, scale versus frequency, wavelet analysis and synthesis, scalograms, wavelet frames and orthonormal bases, the discrete-time case, and applications of wavelets in signal processing. The main definitions and properties of wavelet transforms are covered, and connections among the various fields where results have been developed are shown.<<ETX>>"
            },
            "slug": "Wavelets-and-signal-processing-Rioul-Vetterli",
            "title": {
                "fragments": [],
                "text": "Wavelets and signal processing"
            },
            "tldr": {
                "abstractSimilarityScore": 96,
                "text": "A simple, nonrigorous, synthetic view of wavelet theory is presented for both review and tutorial purposes, which includes nonstationary signal analysis, scale versus frequency,Wavelet analysis and synthesis, scalograms, wavelet frames and orthonormal bases, the discrete-time case, and applications of wavelets in signal processing."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Signal Processing Magazine"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1700419"
                        ],
                        "name": "D. Rotem",
                        "slug": "D.-Rotem",
                        "structuredName": {
                            "firstName": "Doron",
                            "lastName": "Rotem",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Rotem"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1804190"
                        ],
                        "name": "Y. Zeevi",
                        "slug": "Y.-Zeevi",
                        "structuredName": {
                            "firstName": "Yehoshua",
                            "lastName": "Zeevi",
                            "middleNames": [
                                "Y."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Zeevi"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 7995191,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "8e71d3ac558f9d0f86c93357f4ecaa370734dd65",
            "isKey": false,
            "numCitedBy": 72,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "This study is concerned with the information in zero crossings (ZC) of images. Logan's conditions, specifying when a one-dimensional signal may be recovered (within a multiplicative constant) from its ZC, are extended for various cases of two-dimensional signals. An algorithm is implemented in reconstruction of context-free band-pass images. It is also successfully applied in reconstruction of contextual images by first dissecting the image into appropriate bandpass-band-limited two-dimensional signals. In almost all cases of spectrum confined to less than an octave in one dimension, the reconstruction algorithm converges, whereas it does not converge for any signal exceeding one octave in bandwidth. This paper substantiates the proposition that images are well represented by the partial information confined to ZC."
            },
            "slug": "Image-reconstruction-from-zero-crossings-Rotem-Zeevi",
            "title": {
                "fragments": [],
                "text": "Image reconstruction from zero crossings"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The proposition that images are well represented by the partial information confined to ZC is substantiated, whereas it does not converge for any signal exceeding one octave in bandwidth."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Acoust. Speech Signal Process."
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153120475"
                        ],
                        "name": "S. Carlsson",
                        "slug": "S.-Carlsson",
                        "structuredName": {
                            "firstName": "Stefan",
                            "lastName": "Carlsson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Carlsson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 120409611,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5d73eebdb08182472124ae6d82d16e4024c2945e",
            "isKey": false,
            "numCitedBy": 178,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Sketch-based-coding-of-grey-level-images-Carlsson",
            "title": {
                "fragments": [],
                "text": "Sketch based coding of grey level images"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "100862406"
                        ],
                        "name": "A. Grossmann",
                        "slug": "A.-Grossmann",
                        "structuredName": {
                            "firstName": "Alexander",
                            "lastName": "Grossmann",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Grossmann"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145515955"
                        ],
                        "name": "J. Morlet",
                        "slug": "J.-Morlet",
                        "structuredName": {
                            "firstName": "Jean",
                            "lastName": "Morlet",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Morlet"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 48492243,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "da158644dbb23417682d915bf4bbfa934ae7f323",
            "isKey": false,
            "numCitedBy": 3329,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "An arbitrary square integrable real-valued function (or, equivalently, the associated Hardy function) can be conveniently analyzed into a suitable family of square integrable wavelets of constant shape, (i.e. obtained by shifts and dilations from any one of them.) The resulting integral transform is isometric and self-reciprocal if the wavelets satisfy an “admissibility condition” given here. Explicit expressions are obtained in the case of a particular analyzing family that plays a role analogous to that of coherent states (Gabor wavelets) in the usual $L_2 $ -theory. They are written in terms of a modified $\\Gamma $-function that is introduced and studied. From the point of view of group theory, this paper is concerned with square integrable coefficients of an irreducible representation of the nonunimodular $ax + b$-group."
            },
            "slug": "DECOMPOSITION-OF-HARDY-FUNCTIONS-INTO-SQUARE-OF-Grossmann-Morlet",
            "title": {
                "fragments": [],
                "text": "DECOMPOSITION OF HARDY FUNCTIONS INTO SQUARE INTEGRABLE WAVELETS OF CONSTANT SHAPE"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2707896"
                        ],
                        "name": "B. Logan",
                        "slug": "B.-Logan",
                        "structuredName": {
                            "firstName": "Benjamin",
                            "lastName": "Logan",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Logan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1636877,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "ecc6cdfe63a5803e71cc1eae3c52ac1e4b036e49",
            "isKey": false,
            "numCitedBy": 281,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "An interesting subclass of bandpass signals {h} is described wherein the zero crossings of h determine h within a multiplicative constant. The members may have complex zeros, but it is necessary that h should have no zeros in common with its Hilbert transform h other than real simple zeros. It is then sufficient that the band be less than an octave in width. The subclass is shown to include full-carrier upper-sideband signals (of less than an octave bandwidth). Also it is shown that full-carrier lower-sideband signals have only real simple zeros (for any ratio of upper and tower frequencies) and, hence, are readily identified by their zero crossings. However, under the most general conditions for uniqueness, the problem of actually recovering h from its sign changes appears to be very difficult and impractical."
            },
            "slug": "Information-in-the-zero-crossings-of-bandpass-Logan",
            "title": {
                "fragments": [],
                "text": "Information in the zero crossings of bandpass signals"
            },
            "venue": {
                "fragments": [],
                "text": "The Bell System Technical Journal"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743550"
                        ],
                        "name": "M. Kunt",
                        "slug": "M.-Kunt",
                        "structuredName": {
                            "firstName": "Murat",
                            "lastName": "Kunt",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Kunt"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31873082"
                        ],
                        "name": "A. Ikonomopoulos",
                        "slug": "A.-Ikonomopoulos",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Ikonomopoulos",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Ikonomopoulos"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144342138"
                        ],
                        "name": "M. Kocher",
                        "slug": "M.-Kocher",
                        "structuredName": {
                            "firstName": "Michel",
                            "lastName": "Kocher",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Kocher"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 10177743,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3f4a57cba7c090fb1d3a75fb52712d395793669d",
            "isKey": false,
            "numCitedBy": 762,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": "The digital representation of an image requires a very large number of bits. The goal of image coding is to reduce this number, as much as possible, and reconstruct a faithful duplicate of the original picture. Early efforts in image coding, solely guided by information theory, led to a plethora of methods. The compression ratio, starting at 1 with the first digital picture in the early 1960s, reached a saturation level around 10:1 a couple of years ago. This certainly does not mean that the upper bound given by the entropy of the source has also been reached. First, this entropy is not known and depends heavily on the model used for the source, i.e., the digital image. Second, the information theory does not take into account what the human eye sees and how it sees. Recent progress in the study of the brain mechanism of vision has opened new vistas in picture coding. Directional sensitivity of the neurones in the visual pathway combined with the separate processing of contours and textures has led to a new class of coding methods capable of achieving compression ratios as high as 70:1. Image quality, of course, remains as an important problem to be investigated. This class of methods, that we call second generation, is the subject of this paper. Two groups can be formed in this class: methods using local operators and combining their output in a suitable way and methods using contour-texture descriptions. Four methods, two in each class, are described in detail. They are applied to the same set of original pictures to allow a fair comparison of the quality in the decoded pictures. If more effort is devoted to this subject, a compression ratio of 100:1 is within reach."
            },
            "slug": "Second-generation-image-coding-techniques-Kunt-Ikonomopoulos",
            "title": {
                "fragments": [],
                "text": "Second-generation image-coding techniques"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "A new class of coding methods capable of achieving compression ratios as high as 70:1 is called second generation, which can be formed in this class: methods using local operators and combining their output in a suitable way and methods using contour-texture descriptions."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the IEEE"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31836742"
                        ],
                        "name": "S. Curtis",
                        "slug": "S.-Curtis",
                        "structuredName": {
                            "firstName": "Susan",
                            "lastName": "Curtis",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Curtis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1713391"
                        ],
                        "name": "S. Shamai",
                        "slug": "S.-Shamai",
                        "structuredName": {
                            "firstName": "Shlomo",
                            "lastName": "Shamai",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Shamai"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33340475"
                        ],
                        "name": "A. Oppenheim",
                        "slug": "A.-Oppenheim",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Oppenheim",
                            "middleNames": [
                                "V."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Oppenheim"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14654897,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3f90ce712bdaa9a37eef10ee4f9370388d0b5fdf",
            "isKey": false,
            "numCitedBy": 39,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "In this correspondence, we present new results on the reconstruction of two-dimensional signals from zero crossing or threshold crossing information. Specifically, we develop new theoretical results which state conditions under which two-dimensional bandlimited signals are uniquely specified to within a scale factor with this information. Unlike previous results in this area, our new results do not constrain the signals to be periodic or bandpass."
            },
            "slug": "Reconstruction-of-nonperiodic-two-dimensional-from-Curtis-Shamai",
            "title": {
                "fragments": [],
                "text": "Reconstruction of nonperiodic two-dimensional signals from zero crossings"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "New theoretical results are developed which state conditions under which two-dimensional bandlimited signals are uniquely specified to within a scale factor with this information."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Acoust. Speech Signal Process."
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3045133"
                        ],
                        "name": "D. Youla",
                        "slug": "D.-Youla",
                        "structuredName": {
                            "firstName": "Dante",
                            "lastName": "Youla",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Youla"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144167269"
                        ],
                        "name": "H. Webb",
                        "slug": "H.-Webb",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Webb",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Webb"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2442506,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "8c9d128436ca9fb4e4786b762dc01d4f4c4aebe7",
            "isKey": false,
            "numCitedBy": 1079,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "A projection operator onto a closed convex set in Hilbert space is one of the few examples of a nonlinear map that can be defined in simple abstract terms. Moreover, it minimizes distance and is nonexpansive, and therefore shares two of the more important properties of ordinary linear orthogonal projections onto closed linear manifolds. In this paper, we exploit the properties of these operators to develop several iterative algorithms for image restoration from partial data which permit any number of nonlinear constraints of a certain type to be subsumed automatically. Their common conceptual basis is as follows. Every known property of an original image f is envisaged as restricting it to lie in a well-defined closed convex set. Thus, m such properties place f in the intersection E0 = Ei of the corresponding closed convex sets E1,E2,···Em. Given only the projection operators Pi onto the individual Ei's, i = 1 → m, we restore f by recursive means. Clearly, in this approach, the realization of the Pi's in a Hilbert space setting is one of the major synthesis problems. Section I describes the geometrical significance of the three main theorems in considerable detail, and most of the underlying ideas are illustrated with the aid of simple diagrams. Section II presents rules for the numerical implementation of 11 specific projection operators which are found to occur frequently in many signal-processing applications, and the Appendix contains proofs of all the major results."
            },
            "slug": "Image-Restoration-by-the-Method-of-Convex-Part-Youla-Webb",
            "title": {
                "fragments": [],
                "text": "Image Restoration by the Method of Convex Projections: Part 1ߞTheory"
            },
            "tldr": {
                "abstractSimilarityScore": 50,
                "text": "This paper exploits the properties of projection operators Pi onto a closed convex set in Hilbert space to develop several iterative algorithms for image restoration from partial data which permit any number of nonlinear constraints of a certain type to be subsumed automatically."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Medical Imaging"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1737063"
                        ],
                        "name": "I. Daubechies",
                        "slug": "I.-Daubechies",
                        "structuredName": {
                            "firstName": "Ingrid",
                            "lastName": "Daubechies",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Daubechies"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 58524360,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "7e63bf9af3f70abd5771c06d459a0d3fbfbb2909",
            "isKey": false,
            "numCitedBy": 15556,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Introduction Preliminaries and notation The what, why, and how of wavelets The continuous wavelet transform Discrete wavelet transforms: Frames Time-frequency density and orthonormal bases Orthonormal bases of wavelets and multiresolutional analysis Orthonormal bases of compactly supported wavelets More about the regularity of compactly supported wavelets Symmetry for compactly supported wavelet bases Characterization of functional spaces by means of wavelets Generalizations and tricks for orthonormal wavelet bases References Indexes."
            },
            "slug": "Ten-Lectures-on-Wavelets-Daubechies",
            "title": {
                "fragments": [],
                "text": "Ten Lectures on Wavelets"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This paper presents a meta-analyses of the wavelet transforms of Coxeter’s inequality and its applications to multiresolutional analysis and orthonormal bases."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5208597"
                        ],
                        "name": "M. Sezan",
                        "slug": "M.-Sezan",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Sezan",
                            "middleNames": [
                                "Ibrahim"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Sezan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144319446"
                        ],
                        "name": "H. Stark",
                        "slug": "H.-Stark",
                        "structuredName": {
                            "firstName": "Henry",
                            "lastName": "Stark",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Stark"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10087661,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "574e8385f94a911ab1146de679871ce4c20726e1",
            "isKey": false,
            "numCitedBy": 332,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "The image restoration theory discussed in a previous paper by Youla and Webb [1] is applied to a simulated image and the results compared with the well-known method known as the Gerchberg-Papoulis algorithm. The results show that the method of image restoration by projection onto convex sets, by providing a convenient technique for utilizing a priori information, performs significantly better than the Gerchberg-Papoulis method."
            },
            "slug": "Image-Restoration-by-the-Method-of-Convex-Part-and-Sezan-Stark",
            "title": {
                "fragments": [],
                "text": "Image Restoration by the Method of Convex Projections: Part 2-Applications and Numerical Results"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The results show that the method of image restoration by projection onto convex sets, by providing a convenient technique for utilizing a priori information, performs significantly better than the Gerchberg-Papoulis method."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Medical Imaging"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1861837498"
                        ],
                        "name": "G. G. Stokes",
                        "slug": "G.-G.-Stokes",
                        "structuredName": {
                            "firstName": "G.",
                            "lastName": "Stokes",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. G. Stokes"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 221060727,
            "fieldsOfStudy": [
                "Philosophy"
            ],
            "id": "90006064cafcb0a9ad8a30cffeb56efe7e14129b",
            "isKey": false,
            "numCitedBy": 672630,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "however (for it was the literal soul of the life of the Redeemer, John xv. io), is the peculiar token of fellowship with the Redeemer. That love to God (what is meant here is not God’s love to men) is described in such a case as a perfect love (love that has been perfected), involves no difficulty, for the simple reason that the proposition is purely hypothetical. We must, of course, also take the &dquo;keeping&dquo; in all its stringency. John knows right well that the case supposed here ncver becomes full reality. &dquo; Hereb)’,&dquo; i.e. from the actual realization of love to God. &dquo; TIli7i 7e)e are ill Hinz &dquo;"
            },
            "slug": "\"J.\"-Stokes",
            "title": {
                "fragments": [],
                "text": "\"J.\""
            },
            "venue": {
                "fragments": [],
                "text": "The New Yale Book of Quotations"
            },
            "year": 2021
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39916351"
                        ],
                        "name": "R. Duffin",
                        "slug": "R.-Duffin",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Duffin",
                            "middleNames": [
                                "James"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Duffin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "103048846"
                        ],
                        "name": "A. Schaeffer",
                        "slug": "A.-Schaeffer",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Schaeffer",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Schaeffer"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 121172856,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "465ef08243dc82d196670eb3b9047a6e24ead020",
            "isKey": false,
            "numCitedBy": 2088,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-class-of-nonharmonic-Fourier-series-Duffin-Schaeffer",
            "title": {
                "fragments": [],
                "text": "A class of nonharmonic Fourier series"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1952
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50113127"
                        ],
                        "name": "Z. Berman",
                        "slug": "Z.-Berman",
                        "structuredName": {
                            "firstName": "Zeev",
                            "lastName": "Berman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Z. Berman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 117868438,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "8a509ef3b473560a40032b488589df9f81cee2ae",
            "isKey": false,
            "numCitedBy": 15,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-Uniqueness-Question-of-Discrete-Wavelet-Maxima-Berman",
            "title": {
                "fragments": [],
                "text": "The Uniqueness Question of Discrete Wavelet Maxima Representation"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The uniqueness question of discrete wavelet maxima and appl ied mathematics. representation."
            },
            "venue": {
                "fragments": [],
                "text": "Tech. Rep. TR 91-48, Syst. Res. Cent., Univ. of Dr. Mallat received the 1990 IEEE Signal Processing Society’s paper award"
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Reconstruction from zero - crossings in scale - space . ” IEEE Trans . Acoustic Speech Signal Processing , vol . 37 . no . 12 , Dec . 1989 . J . Koenderink , “ The structure of images , ”"
            },
            "venue": {
                "fragments": [],
                "text": "Biol . Cybern ."
            },
            "year": 1984
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Moniot, “Reconstruction from zero-crossings in scale-space."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Acoustic Speech Signal Processing,"
            },
            "year": 1989
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Sharp results on random sampling of band-l imited functions."
            },
            "venue": {
                "fragments": [],
                "text": "in Proc. NATO ASI Workshoo Stochastic Processes. New York: Kluwer,"
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": ", ‘ Scaling theorems for zero crossings , ” IEEE Tram . Part . Anal . Machine Intell . , vol . PAMI - 8 , Jan 1986 . Y . Zeevi and D . Rotem , “ Image reconstruction from zero - crossings"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans . Med . Imaging"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Second generat ion image coding technics,"
            },
            "venue": {
                "fragments": [],
                "text": "Pro>. IEEE,"
            },
            "year": 1985
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Un contre-exemple a la conjecture de Marr et a celle de S"
            },
            "venue": {
                "fragments": [],
                "text": "Un contre-exemple a la conjecture de Marr et a celle de S"
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "New York: Academic"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Sharp results on random sampling of band-limited functions"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. NATO ASI Workshoo Stochastic Processes"
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Theorem and experiments on image reconstruction from zero-crossings"
            },
            "venue": {
                "fragments": [],
                "text": "Res. Rep. RJ5460, IBM"
            },
            "year": 1987
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 35,
        "totalPages": 4
    },
    "page_url": "https://www.semanticscholar.org/paper/Characterization-of-Signals-from-Multiscale-Edges-Mallat-Zhong/f42d06ff2160dae7412c299619c04f63395b784b?sort=total-citations"
}