{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "A central problem in the theory of vision (Wertheimer 1912; Marr 1976; Ullman 1979) is that of establishing a correspondence between the features of two related images such as the members of a stereo pair or successive frames in a motion sequence."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 40175393,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "aa4b60b5847999c2f778e3e67ca1f2201e396abb",
            "isKey": false,
            "numCitedBy": 1004,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "An introduction is given to a theory of early visual information processing. The theory has been implemented, and examples are given of images at various stages of analysis. It is argued that the first step of consequence is to compute a primitive but rich description of the grey-level changes present in an image. The description is expressed in a vocabulary of kinds of intensity change (EDGE, SHADING-EDGE, EXTENDED-EDGE, LINE, BLOB etc.). Modifying parameters are bound to the elements in the description, specifying their POSITION, ORIENTATION, TERMINATION points, CONTRAST, SIZE and FUZZINESS. This description is obtained from the intensity array by fixed techniques, and it is called the primal sketch. For most images, the primal sketch is large and unwieldy. The second important step in visual information processing is to group its contents in a way that is appropriate for later recognition. From our ability to interpret drawings with little semantic content, one may infer the presence in our perceptual equipment of symbolic processes that can define \"place-tokens\" in an image in various ways, and can group them according to certain rules. Homomorphic techniques fail to account for many of these grouping phenomena, whose explanations require mechanisms of construction rather than mechanisms of detection. The necessary grouping of elements in the primal sketch may be achieved by a mechanism that has available the processes inferred from above, together with the ability to select items by first order discriminations acting on the elements' parameters. Only occasionally do these mechanisms use downward-flowing information about the contents of the particular image being processed. It is argued that \"non-attentive\" vision is in practice implemented by these grouping operations and first order discriminations acting on the primal sketch. The class of computations so obtained differs slightly from the class of second order operations on the intensity array. The extraction of a form from the primal sketch using these techniques amounts to the separation of figure from ground. It is concluded that most of the separation can be carried out by using techniques that do not depend upon the particular image in question. Therefore, figure-ground separation can normally precede the description of the shape of the extracted form. Up to this point, higher-level knowledge and purpose are brought to bear on only a few of the decisions taken during the processing. This relegates the widespread use of downward-flowing information to a later stage than is found in current machine-vision programs, and implies that such knowledge should influence the control of, rather than interfering with, the actual data-processing that is taking place lower down."
            },
            "slug": "Early-processing-of-visual-information.-Marr",
            "title": {
                "fragments": [],
                "text": "Early processing of visual information."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is argued that \"non-attentive\" vision is in practice implemented by these grouping operations and first order discriminations acting on the primal sketch, and implies that such knowledge should influence the control of, rather than interfering with, the actual data-processing that is taking place lower down."
            },
            "venue": {
                "fragments": [],
                "text": "Philosophical transactions of the Royal Society of London. Series B, Biological sciences"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "103628832"
                        ],
                        "name": "J. Ternus",
                        "slug": "J.-Ternus",
                        "structuredName": {
                            "firstName": "Josef",
                            "lastName": "Ternus",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Ternus"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 124322467,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "f1534795ae2e94377e0d38ee324810e9ff69b336",
            "isKey": false,
            "numCitedBy": 165,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Experimentelle-Untersuchungen-über-phänomenale-Ternus",
            "title": {
                "fragments": [],
                "text": "Experimentelle Untersuchungen über phänomenale Identität"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1926
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Experimentelle Untersuchung fiber phanomenale Identitat"
            },
            "venue": {
                "fragments": [],
                "text": "Psychol . Forsch ."
            },
            "year": 1926
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Experimentelle Studien uber das Sehen von Bewegung"
            },
            "venue": {
                "fragments": [],
                "text": "Z . Psychol ."
            },
            "year": 1912
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 4,
        "totalPages": 1
    },
    "page_url": "https://www.semanticscholar.org/paper/An-algorithm-for-associating-the-features-of-two-Scott-Longuet-Higgins/281a3859b8ead503067f52e653dff28ed534d6d2?sort=total-citations"
}