{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1696931"
                        ],
                        "name": "H. Barrow",
                        "slug": "H.-Barrow",
                        "structuredName": {
                            "firstName": "Harry",
                            "lastName": "Barrow",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barrow"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144592244"
                        ],
                        "name": "J. Tenenbaum",
                        "slug": "J.-Tenenbaum",
                        "structuredName": {
                            "firstName": "Jay",
                            "lastName": "Tenenbaum",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Tenenbaum"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1764443"
                        ],
                        "name": "R. Bolles",
                        "slug": "R.-Bolles",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Bolles",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Bolles"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "11843441"
                        ],
                        "name": "H. C. Wolf",
                        "slug": "H.-C.-Wolf",
                        "structuredName": {
                            "firstName": "Helen",
                            "lastName": "Wolf",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. C. Wolf"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1621080,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "358a97112cc60d6bfefb352b863fec8a86a39e28",
            "isKey": false,
            "numCitedBy": 873,
            "numCiting": 41,
            "paperAbstract": {
                "fragments": [],
                "text": "Parametric correspondence is a technique for matching images to a three dimensional symbolic reference map. An analytic camera model is used to predict the location and appearance of landmarks in the image, generating a projection for an assumed viewpoint. Correspondence is achieved by adjusting the parameters of the camera model until the appearances of the landmarks optimally match a symbolic description extracted from the image. \n \nThe matching of image and map features is performed rapidly by a new technique, called \"chamfer matching\", that compares the shapes of two collections of shape fragments, at a cost proportional to linear dimension, rather than area. These two techniques permit the matching of spatially extensive features on the basis of shape, which reduces the risk of ambiguous matches and the dependence on viewing conditions inherent in conventional image based correlation matching."
            },
            "slug": "Parametric-Correspondence-and-Chamfer-Matching:-Two-Barrow-Tenenbaum",
            "title": {
                "fragments": [],
                "text": "Parametric Correspondence and Chamfer Matching: Two New Techniques for Image Matching"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The matching of image and map features is performed rapidly by a new technique, called \"chamfer matching\", that compares the shapes of two collections of shape fragments, at a cost proportional to linear dimension, rather than area."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2251336"
                        ],
                        "name": "D. Burr",
                        "slug": "D.-Burr",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Burr",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Burr"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60450592,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9df60a9ccc5b6b784b964d1b1a2bfacf0ccad026",
            "isKey": false,
            "numCitedBy": 7,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : This report treats two major subproblems in computer stereo vision -- that of reconstructing 3-D scenes from stereo sets of images and automatic recognition of 3-D scenes. Two techniques are presented for scene reconstruction. The first, or multiple view method, utilizes the combined information from bulk correlation and three or more stereo images to construct three-dimensional edge features or structures. The structure is obtained by projecting into space a piecewise-linear representation of intensity edges obtained from one of the images. The second technique utilizes a narrow angle pair (2-3 degrees) of images and symbolic correlation to ensure matching reliability and efficiency in the construction of edge depth maps of scenes. A new technique of dynamic smoothing of edge contours is presented which permits accurate triangulation at narrow viewing angles, while preserving the integrity of sharp corners. Also, two new techniques are presented for piecewise approximation of 3-D and 2-D digital contours with circular arcs."
            },
            "slug": "On-computer-stereo-vision-with-wire-frame-models.-Burr",
            "title": {
                "fragments": [],
                "text": "On computer stereo vision with wire frame models."
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "A new technique of dynamic smoothing of edge contours is presented which permits accurate triangulation at narrow viewing angles, while preserving the integrity of sharp corners in 3-D scenes."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2760919"
                        ],
                        "name": "S. Rubin",
                        "slug": "S.-Rubin",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Rubin",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Rubin"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60526133,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d7d1d6259e93f727458a5d08986101cb333c2999",
            "isKey": false,
            "numCitedBy": 65,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : ARGOS is an image understanding system. It builds a three-dimensional model of the task domain and uses hypothesized two-dimensional views of the model to label images. It currently achieves less than 20% error by area when labeling real-world (city of Pittsburgh) photographs with a knowledge base of over fifty objects. In addition, the system can determine the angle of view around the city with approximately 40 degrees of error. The labeling technique used by ARGOS is called Locus search. Locus is a non-backtracking graph search technique in which a beam of near-miss alternatives around the best path are extended in parallel through the graph. After the graph has been searched in breadth-first order, the beam of possibilities is examined in reverse order to extract a near-optimal path. This path defines a labeling of the image and is only sub-optimal because of the pruning heuristics used in the beam creation. This thesis formulates image understanding as a problem of search; shows how Locus search can be used to label images; describes the many sources of knowledge used in the interpretation; shows how knowledge represented as a network can be used to constrain the search; explores extensions to the use of knowledge; and presents the experimental results of ARGOS. Its main contributions are the demonstration that Locus search can be used for image understanding and the exploration of issues involved in this use."
            },
            "slug": "The-argos-image-understanding-system.-Rubin",
            "title": {
                "fragments": [],
                "text": "The argos image understanding system."
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "The demonstration that Locus search can be used for image understanding and the exploration of issues involved in this use are the main contributions of this thesis."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1913418"
                        ],
                        "name": "B. Widrow",
                        "slug": "B.-Widrow",
                        "structuredName": {
                            "firstName": "Bernard",
                            "lastName": "Widrow",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Widrow"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 195703395,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "15a0f30ad2efee0b1f6d7143f3b770ad774da746",
            "isKey": false,
            "numCitedBy": 78,
            "numCiting": 76,
            "paperAbstract": {
                "fragments": [],
                "text": "Template matching is a fundamental technique of pattern recognition. Although this technique is very general, its applicability has been limited because of the difficulty often encountered when fitting templates to natural data. Natural patterns are often distorted, misshapen, stretched in size, fuzzy, rotated, translated, observed at an unusual perspective, etc. Flexible templates (rubber masks) have been devised which, when fitted to natural data, can be used for measurement, data reduction, data smoothing, and classification of highly irregular waveforms and image shapes. These problems had been largely unsolved by existing template matching methods."
            },
            "slug": "The-\"Rubber-Mask\"-Technique-I.-Pattern-Measurement-Widrow",
            "title": {
                "fragments": [],
                "text": "The \"Rubber-Mask\" Technique I. Pattern Measurement and Analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "Flexible templates (rubber masks) have been devised which, when fitted to natural data, can be used for measurement, data reduction, data smoothing, and classification of highly irregular waveforms and image shapes."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1693428"
                        ],
                        "name": "L. Davis",
                        "slug": "L.-Davis",
                        "structuredName": {
                            "firstName": "Larry",
                            "lastName": "Davis",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Davis"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 14992206,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "8734b7c9d55b8383a32262de6d32d771496b31c0",
            "isKey": false,
            "numCitedBy": 287,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "The problem of finding approximate matches of pieces of shapes to parts of larger shapes is investigated. The shapes are represented by polygonal approximations. Initially, figures of merit are assigned to the matches between pairs of angles on the two shapes. Relaxation methods are then used to find acceptable combinations of these matches. This approach was tested on a data base consisting of digitized coastlines in various map projections. In nearly all cases, all matches except the correct one were eliminated by the relaxation processes."
            },
            "slug": "Shape-Matching-Using-Relaxation-Techniques-Davis",
            "title": {
                "fragments": [],
                "text": "Shape Matching Using Relaxation Techniques"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "This approach was tested on a data base consisting of digitized coastlines in various map projections and found that in nearly all cases, all matches except the correct one were eliminated by the relaxation processes."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 767650,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6bb6eba248b6ef8d228dc33e6113c3e12dd48fee",
            "isKey": false,
            "numCitedBy": 1168,
            "numCiting": 82,
            "paperAbstract": {
                "fragments": [],
                "text": "The extraction of stereo-disparity information from two images depends upon establishing a correspondence between them. In this article we analyze the nature of the correspondence computation and derive a cooperative algorithm that implements it. We show that this algorithm successfully extracts information from random-dot stereograms, and its implications for the psychophysics and neurophysiology of the visual system are briefly discussed."
            },
            "slug": "Cooperative-computation-of-stereo-disparity.-Marr-Poggio",
            "title": {
                "fragments": [],
                "text": "Cooperative computation of stereo disparity."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is shown that this algorithm successfully extracts information from random-dot stereograms, and its implications for the psychophysics and neurophysiology of the visual system are briefly discussed."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1976
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 6,
        "totalPages": 1
    },
    "page_url": "https://www.semanticscholar.org/paper/A-dynamic-model-for-image-registration-Burr/5c2a1a48cc37963ce148727d88f38f85c1edd104?sort=total-citations"
}