{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1699809"
                        ],
                        "name": "H. Derin",
                        "slug": "H.-Derin",
                        "structuredName": {
                            "firstName": "Haluk",
                            "lastName": "Derin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Derin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145117776"
                        ],
                        "name": "H. Elliott",
                        "slug": "H.-Elliott",
                        "structuredName": {
                            "firstName": "Howard",
                            "lastName": "Elliott",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Elliott"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1971069"
                        ],
                        "name": "R. Cristi",
                        "slug": "R.-Cristi",
                        "structuredName": {
                            "firstName": "Roberto",
                            "lastName": "Cristi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Cristi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1707642"
                        ],
                        "name": "D. Geman",
                        "slug": "D.-Geman",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "Geman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Geman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 945120,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "905ae12034b6556846dda31e6b40fabb6a4d833f",
            "isKey": false,
            "numCitedBy": 207,
            "numCiting": 39,
            "paperAbstract": {
                "fragments": [],
                "text": "A new image segmentation algorithm is presented, based on recursive Bayes smoothing of images modeled by Markov random fields and corrupted by independent additive noise. The Bayes smoothing algorithm yields the a posteriori distribution of the scene value at each pixel, given the total noisy image, in a recursive way. The a posteriori distribution together with a criterion of optimality then determine a Bayes estimate of the scene. The algorithm presented is an extension of a 1-D Bayes smoothing algorithm to 2-D and it gives the optimum Bayes estimate for the scene value at each pixel. Computational concerns in 2-D, however, necessitate certain simplifying assumptions on the model and approximations on the implementation of the algorithm. In particular, the scene (noiseless image) is modeled as a Markov mesh random field, a special class of Markov random fields, and the Bayes smoothing algorithm is applied on overlapping strips (horizontal/vertical) of the image consisting of several rows (columns). It is assumed that the signal (scene values) vector sequence along the strip is a vector Markov chain. Since signal correlation in one of the dimensions is not fully used along the edges of the strip, estimates are generated only along the middle sections of the strips. The overlapping strips are chosen such that the union of the middle sections of the strips gives the whole image. The Bayes smoothing algorithm presented here is valid for scene random fields consisting of multilevel (discrete) or continuous random variables."
            },
            "slug": "Bayes-Smoothing-Algorithms-for-Segmentation-of-by-Derin-Elliott",
            "title": {
                "fragments": [],
                "text": "Bayes Smoothing Algorithms for Segmentation of Binary Images Modeled by Markov Random Fields"
            },
            "tldr": {
                "abstractSimilarityScore": 50,
                "text": "The Bayes smoothing algorithm presented here is valid for scene random fields consisting of multilevel (discrete) or continuous random variables, and it gives the optimum Bayes estimate for the scene value at each pixel."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1869519"
                        ],
                        "name": "G. R. Cross",
                        "slug": "G.-R.-Cross",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Cross",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. R. Cross"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145295484"
                        ],
                        "name": "Anil K. Jain",
                        "slug": "Anil-K.-Jain",
                        "structuredName": {
                            "firstName": "Anil",
                            "lastName": "Jain",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Anil K. Jain"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 19038308,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "7862fc4099b31f0a21fcf681403c2e594c2dd5bc",
            "isKey": false,
            "numCitedBy": 1501,
            "numCiting": 58,
            "paperAbstract": {
                "fragments": [],
                "text": "We consider a texture to be a stochastic, possibly periodic, two-dimensional image field. A texture model is a mathematical procedure capable of producing and describing a textured image. We explore the use of Markov random fields as texture models. The binomial model, where each point in the texture has a binomial distribution with parameter controlled by its neighbors and ``number of tries'' equal to the number of gray levels, was taken to be the basic model for the analysis. A method of generating samples from the binomial model is given, followed by a theoretical and practical analysis of the method's convergence. Examples show how the parameters of the Markov random field control the strength and direction of the clustering in the image. The power of the binomial model to produce blurry, sharp, line-like, and blob-like textures is demonstrated. Natural texture samples were digitized and their parameters were estimated under the Markov random field model. A hypothesis test was used for an objective assessment of goodness-of-fit under the Markov random field model. Overall, microtextures fit the model well. The estimated parameters of the natural textures were used as input to the generation procedure. The synthetic microtextures closely resembled their real counterparts, while the regular and inhomogeneous textures did not."
            },
            "slug": "Markov-Random-Field-Texture-Models-Cross-Jain",
            "title": {
                "fragments": [],
                "text": "Markov Random Field Texture Models"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The power of the binomial model to produce blurry, sharp, line-like, and blob-like textures is demonstrated and the synthetic microtextures closely resembled their real counterparts, while the regular and inhomogeneous textures did not."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144753402"
                        ],
                        "name": "M. Hassner",
                        "slug": "M.-Hassner",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Hassner",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Hassner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1765522"
                        ],
                        "name": "J. Sklansky",
                        "slug": "J.-Sklansky",
                        "structuredName": {
                            "firstName": "Jack",
                            "lastName": "Sklansky",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Sklansky"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 119827929,
            "fieldsOfStudy": [
                "Computer Science",
                "Mathematics"
            ],
            "id": "fcfd56c6fc2a1632da285a0cbd1f657956b23cea",
            "isKey": false,
            "numCitedBy": 220,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-use-of-Markov-Random-Fields-as-models-of-Hassner-Sklansky",
            "title": {
                "fragments": [],
                "text": "The use of Markov Random Fields as models of texture"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35175118"
                        ],
                        "name": "F. Cohen",
                        "slug": "F.-Cohen",
                        "structuredName": {
                            "firstName": "Fernand",
                            "lastName": "Cohen",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Cohen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145700259"
                        ],
                        "name": "D. Cooper",
                        "slug": "D.-Cooper",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Cooper",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Cooper"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 12097745,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0759cc14f1a92dcbdc304591e421c1afba248425",
            "isKey": false,
            "numCitedBy": 241,
            "numCiting": 36,
            "paperAbstract": {
                "fragments": [],
                "text": "The modeling and segmentation of images by MRF's (Markov random fields) is treated. These are two-dimensional noncausal Markovian stochastic processes. Two conceptually new algorithms are presented for segmenting textured images into regions in each of which the data are modeled as one of C MRF's. The algorithms are designed to operate in real time when implemented on new parallel computer architectures that can be built with present technology. A doubly stochastic representation is used in image modeling. Here, a Gaussian MRF is used to model textures in visible light and infrared images, and an autobinary (or autoternary, etc.) MRF to model a priori information about the local geometry of textured image regions. For image segmentation, the true texture class regions are treated either as a priori completely unknown or as a realization of a binary (or ternary, etc.) MRF. In the former case, image segmentation is realized as true maximum likelihood estimation. In the latter case, it is realized as true maximum a posteriori likelihood segmentation. In addition to providing a mathematically correct means for introducing geometric structure, the autobinary (or ternary, etc.) MRF can be used in a generative mode to generate image geometries and artificial images, and such simulations constitute a very powerful tool for studying the effects of these models and the appropriate choice of model parameters. The first segmentation algorithm is hierarchical and uses a pyramid-like structure in new ways that exploit the mutual dependencies among disjoint pieces of a textured region."
            },
            "slug": "Simple-Parallel-Hierarchical-and-Relaxation-for-Cohen-Cooper",
            "title": {
                "fragments": [],
                "text": "Simple Parallel Hierarchical and Relaxation Algorithms for Segmenting Noncausal Markovian Random Fields"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "Two conceptually new algorithms are presented for segmenting textured images into regions in each of which the data are modeled as one of C MRF's, designed to operate in real time when implemented on new parallel computer architectures that can be built with present technology."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "9215658"
                        ],
                        "name": "R. Chellappa",
                        "slug": "R.-Chellappa",
                        "structuredName": {
                            "firstName": "Rama",
                            "lastName": "Chellappa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Chellappa"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145316994"
                        ],
                        "name": "S. Chatterjee",
                        "slug": "S.-Chatterjee",
                        "structuredName": {
                            "firstName": "Shankar",
                            "lastName": "Chatterjee",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Chatterjee"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 12503745,
            "fieldsOfStudy": [
                "Computer Science",
                "Mathematics"
            ],
            "id": "e2134f8e70426fe392d95e1d0b91a61d850e6331",
            "isKey": false,
            "numCitedBy": 550,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "The problem of texture classification arises in several disciplines such as remote sensing, computer vision, and image analysis. In this paper we present two feature extraction methods for the classification of textures using two-dimensional (2-D) Markov random field (MRF) models. It is assumed that the given M × M texture is generated by a Gaussian MRF model. In the first method, the least square (LS) estimates of model parameters are used as features. In the second method, using the notion of sufficient statistics, it is shown that the sample correlations over a symmetric window including the origin are optimal features for classification. Simple minimum distance classifiers using these two feature sets yield good classification accuracies for a seven class problem."
            },
            "slug": "Classification-of-textures-using-Gaussian-Markov-Chellappa-Chatterjee",
            "title": {
                "fragments": [],
                "text": "Classification of textures using Gaussian Markov random fields"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "Two feature extraction methods for the classification of textures using two-dimensional Markov random field (MRF) models are presented and it is shown that the sample correlations over a symmetric window including the origin are optimal features for classification."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Acoust. Speech Signal Process."
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1699809"
                        ],
                        "name": "H. Derin",
                        "slug": "H.-Derin",
                        "structuredName": {
                            "firstName": "Haluk",
                            "lastName": "Derin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Derin"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 117205676,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "cd50939828ce2d48d28fd94ac9ebabc65f720ec6",
            "isKey": false,
            "numCitedBy": 12,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "In this chapter, we discuss the potential of Gibbs distributions (GDs) as models in image processing applications. We briefly review the definitions and basic concepts of Markov random fields (MRFs) and GDs and present some realizations from these distributions. The use of statistical models and methods in image processing has increased considerably over the recent years. Most of these studies involve the use of MRF models and processing techniques based on these models. The pioneering work on MRFs due to Dobrushin [1], Wong [2], and Woods [3] involves extending the Markovian property in one dimension to higher dimensions. However, due to lack of causality in two dimensions the extension is not straightforward. Some properties in one dimension, for example, the equivalence of one-sided and two-sided Markovianity, do not carry over to two dimensions. The early work by Abend et al. [4] presents a causal characterization for a class of MRFs called Markov mesh random fields. This work also includes a formulation pointing out the Gibbsian property of a Markov chain without fully realizing the connection. Other attempts in extending the Markovian property to two dimensions include the autoregressive models: the “simultaneous autoregressive” (SAR) models and the “conditional Markov” models introduced by Chellappa and Kashyap [5]."
            },
            "slug": "The-Use-of-Gibbs-Distributions-In-Image-Processing-Derin",
            "title": {
                "fragments": [],
                "text": "The Use of Gibbs Distributions In Image Processing"
            },
            "tldr": {
                "abstractSimilarityScore": 61,
                "text": "The potential of Gibbs distributions (GDs) as models in image processing applications is discussed and a formulation pointing out the Gibbsian property of a Markov chain without fully realizing the connection is presented."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153191420"
                        ],
                        "name": "Patrick C. Chen",
                        "slug": "Patrick-C.-Chen",
                        "structuredName": {
                            "firstName": "Patrick",
                            "lastName": "Chen",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Patrick C. Chen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145820949"
                        ],
                        "name": "T. Pavlidis",
                        "slug": "T.-Pavlidis",
                        "structuredName": {
                            "firstName": "Theodosios",
                            "lastName": "Pavlidis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Pavlidis"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 119342788,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "7c1af97007ab29776b888eb1e88d7d7407967d00",
            "isKey": false,
            "numCitedBy": 236,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Segmentation-by-texture-using-a-co-occurrence-and-a-Chen-Pavlidis",
            "title": {
                "fragments": [],
                "text": "Segmentation by texture using a co-occurrence matrix and a split-and-merge algorithm☆"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3194361"
                        ],
                        "name": "S. Geman",
                        "slug": "S.-Geman",
                        "structuredName": {
                            "firstName": "Stuart",
                            "lastName": "Geman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Geman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1707642"
                        ],
                        "name": "D. Geman",
                        "slug": "D.-Geman",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "Geman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Geman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 5837272,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "459b30a9a960080f3b313e41886b1aa0e51e882c",
            "isKey": false,
            "numCitedBy": 18711,
            "numCiting": 60,
            "paperAbstract": {
                "fragments": [],
                "text": "We make an analogy between images and statistical mechanics systems. Pixel gray levels and the presence and orientation of edges are viewed as states of atoms or molecules in a lattice-like physical system. The assignment of an energy function in the physical system determines its Gibbs distribution. Because of the Gibbs distribution, Markov random field (MRF) equivalence, this assignment also determines an MRF image model. The energy function is a more convenient and natural mechanism for embodying picture attributes than are the local characteristics of the MRF. For a range of degradation mechanisms, including blurring, nonlinear deformations, and multiplicative or additive noise, the posterior distribution is an MRF with a structure akin to the image model. By the analogy, the posterior distribution defines another (imaginary) physical system. Gradual temperature reduction in the physical system isolates low energy states (``annealing''), or what is the same thing, the most probable states under the Gibbs distribution. The analogous operation under the posterior distribution yields the maximum a posteriori (MAP) estimate of the image given the degraded observations. The result is a highly parallel ``relaxation'' algorithm for MAP estimation. We establish convergence properties of the algorithm and we experiment with some simple pictures, for which good restorations are obtained at low signal-to-noise ratios."
            },
            "slug": "Stochastic-Relaxation,-Gibbs-Distributions,-and-the-Geman-Geman",
            "title": {
                "fragments": [],
                "text": "Stochastic Relaxation, Gibbs Distributions, and the Bayesian Restoration of Images"
            },
            "tldr": {
                "abstractSimilarityScore": 52,
                "text": "The analogy between images and statistical mechanics systems is made and the analogous operation under the posterior distribution yields the maximum a posteriori (MAP) estimate of the image given the degraded observations, creating a highly parallel ``relaxation'' algorithm for MAP estimation."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2149907"
                        ],
                        "name": "C. Therrien",
                        "slug": "C.-Therrien",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Therrien",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Therrien"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 34498528,
            "fieldsOfStudy": [
                "Environmental Science",
                "Mathematics"
            ],
            "id": "452303a2a8fb6931e6154fd865174bc6ebc716d8",
            "isKey": false,
            "numCitedBy": 105,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "An-estimation-theoretic-approach-to-terrain-image-Therrien",
            "title": {
                "fragments": [],
                "text": "An estimation-theoretic approach to terrain image segmentation"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Vis. Graph. Image Process."
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1719456"
                        ],
                        "name": "K. Deguchi",
                        "slug": "K.-Deguchi",
                        "structuredName": {
                            "firstName": "Koichiro",
                            "lastName": "Deguchi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Deguchi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35102154"
                        ],
                        "name": "I. Morishita",
                        "slug": "I.-Morishita",
                        "structuredName": {
                            "firstName": "Iwao",
                            "lastName": "Morishita",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Morishita"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 23522760,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "9567a86bd7686cd445609ff3fb533f0a44ae643f",
            "isKey": false,
            "numCitedBy": 46,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "A new approach to texture characterization and texture-based image partitioning is presented. In this approach the gray level of each pixel of an image is estimated from a weighted sum of gray levels of its neighbor pixels. The weight coefficients are determined so that the mean square estimation error is minimized. The obtained two-dimensional estimator characterizes the texture of the sample and can be used to discriminate other classes of textures. This texture characterization technique is applied to image partitioning, and two partitioning procedures are developed. Experimental results obtained by their application are also shown."
            },
            "slug": "Texture-Characterization-and-Texture-Based-Image-Deguchi-Morishita",
            "title": {
                "fragments": [],
                "text": "Texture Characterization and Texture-Based Image Partitioning Using Two-Dimensional Linear Estimation Techniques"
            },
            "tldr": {
                "abstractSimilarityScore": 95,
                "text": "A new approach to texture characterization and texture-based image partitioning is presented, in which the gray level of each pixel of an image is estimated from a weighted sum of gray levels of its neighbor pixels."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Computers"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145117776"
                        ],
                        "name": "H. Elliott",
                        "slug": "H.-Elliott",
                        "structuredName": {
                            "firstName": "Howard",
                            "lastName": "Elliott",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Elliott"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1699809"
                        ],
                        "name": "H. Derin",
                        "slug": "H.-Derin",
                        "structuredName": {
                            "firstName": "Haluk",
                            "lastName": "Derin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Derin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1971069"
                        ],
                        "name": "R. Cristi",
                        "slug": "R.-Cristi",
                        "structuredName": {
                            "firstName": "Roberto",
                            "lastName": "Cristi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Cristi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1707642"
                        ],
                        "name": "D. Geman",
                        "slug": "D.-Geman",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "Geman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Geman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 20320482,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5dd35d48c14d88ddc2c544f75440b709301546e0",
            "isKey": false,
            "numCitedBy": 62,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents a new statistical approach to image segmentation. Making use of Gibbs distribution models of Markov random fields a dynamic programming based segmentation algorithm is developed. The algorithm is described in detail and examples are given."
            },
            "slug": "Application-of-the-Gibbs-distribution-to-image-Elliott-Derin",
            "title": {
                "fragments": [],
                "text": "Application of the Gibbs distribution to image segmentation"
            },
            "tldr": {
                "abstractSimilarityScore": 54,
                "text": "Making use of Gibbs distribution models of Markov random fields a dynamic programming based segmentation algorithm is developed and examples are given."
            },
            "venue": {
                "fragments": [],
                "text": "ICASSP"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "9215658"
                        ],
                        "name": "R. Chellappa",
                        "slug": "R.-Chellappa",
                        "structuredName": {
                            "firstName": "Rama",
                            "lastName": "Chellappa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Chellappa"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32583901"
                        ],
                        "name": "R. Kashyap",
                        "slug": "R.-Kashyap",
                        "structuredName": {
                            "firstName": "Rangasami",
                            "lastName": "Kashyap",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Kashyap"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122545909,
            "fieldsOfStudy": [
                "Mathematics",
                "Computer Science"
            ],
            "id": "b18064ea08a4485c436359b61ad169423fb35190",
            "isKey": false,
            "numCitedBy": 148,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper is concerned with developing fast nonrecursive algorithms for the minimum mean-squared error restoration of degraded images. The degradation is assumed to be due to a space invariant, periodic, nonseparable known point-spread function, and additive white noise. Our basic approach is to represent the images by a class of spatial interaction models, namely the simultaneous autoregressve models and the conditional Markov models defined on toroidal lattices, and develop minimum mean-squared error restoration algorithms using these models. The restoration algorithms are optimal, if the parameters characterizing the interaction models are exactly known. However, in practice, the parameters are estimated from the images. By using spatial interaction models, we develop restoration algorithms that do not require the availability of the original image or its prototype. The specific structure of the underlying lattice enables the implementation of the filters using fast Fourier transform (FFT) computations, Several restoration examples are given."
            },
            "slug": "Digital-image-restoration-using-spatial-interaction-Chellappa-Kashyap",
            "title": {
                "fragments": [],
                "text": "Digital image restoration using spatial interaction models"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "By using spatial interaction models, this paper develops restoration algorithms that do not require the availability of the original image or its prototype, and the specific structure of the underlying lattice enables the implementation of the filters using fast Fourier transform (FFT) computations."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1693428"
                        ],
                        "name": "L. Davis",
                        "slug": "L.-Davis",
                        "structuredName": {
                            "firstName": "Larry",
                            "lastName": "Davis",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Davis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3285691"
                        ],
                        "name": "Steven A. Johns",
                        "slug": "Steven-A.-Johns",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Johns",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Steven A. Johns"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1705627"
                        ],
                        "name": "J. Aggarwal",
                        "slug": "J.-Aggarwal",
                        "structuredName": {
                            "firstName": "Jake",
                            "lastName": "Aggarwal",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Aggarwal"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 9628893,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "31db124111ca4a6d76b202bcaf2f3bb8ea64aa1e",
            "isKey": false,
            "numCitedBy": 339,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a new approach to texture analysis based on the spatial distribution of local features in unsegmented textures. The textures are described using features derived from generalized co-occurrence matrices (GCM). A GCM is determined by a spatial constraint predicate F and a set of local features P = {(Xi, Yi, di), i = 1,..., m} where (Xi, Yi) is the location of the ith feature, and di is a description of the ith feature. The GCM of P under F, GF, is defined by GF(i, j) = number of pairs, pk, pl such that F(pk, pl) is true and di and dj are the descriptions of pk and pl, respectively. We discuss features derived from GCM's and present an experimental study using natural textures."
            },
            "slug": "Texture-Analysis-Using-Generalized-Co-Occurrence-Davis-Johns",
            "title": {
                "fragments": [],
                "text": "Texture Analysis Using Generalized Co-Occurrence Matrices"
            },
            "tldr": {
                "abstractSimilarityScore": 78,
                "text": "A new approach to texture analysis based on the spatial distribution of local features in unsegmented textures and features derived from generalized co-occurrence matrices (GCM) are presented."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1698824"
                        ],
                        "name": "S. Zucker",
                        "slug": "S.-Zucker",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Zucker",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Zucker"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143766793"
                        ],
                        "name": "A. Rosenfeld",
                        "slug": "A.-Rosenfeld",
                        "structuredName": {
                            "firstName": "Azriel",
                            "lastName": "Rosenfeld",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rosenfeld"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1693428"
                        ],
                        "name": "L. Davis",
                        "slug": "L.-Davis",
                        "structuredName": {
                            "firstName": "Larry",
                            "lastName": "Davis",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Davis"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 206620720,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "6f6784ee9cddba10ec8fd0027b2a36f44ef2c73d",
            "isKey": false,
            "numCitedBy": 79,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "This correspondence describes a method of dividing a picture into differently textured regions by thresholding the values of a suitable local picture property. The approach used is a generalization to natural textures of a technique recently proposed by Tsuji. The examples given involve textures that differ in coarseness; a method of estimating texture coarseness by analysis of local property values is also described."
            },
            "slug": "Picture-Segmentation-by-Texture-Discrimination-Zucker-Rosenfeld",
            "title": {
                "fragments": [],
                "text": "Picture Segmentation by Texture Discrimination"
            },
            "tldr": {
                "abstractSimilarityScore": 92,
                "text": "This correspondence describes a method of dividing a picture into differently textured regions by thresholding the values of a suitable local picture property by a generalization to natural textures of a technique recently proposed by Tsuji."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Computers"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1699809"
                        ],
                        "name": "H. Derin",
                        "slug": "H.-Derin",
                        "structuredName": {
                            "firstName": "Haluk",
                            "lastName": "Derin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Derin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145117776"
                        ],
                        "name": "H. Elliott",
                        "slug": "H.-Elliott",
                        "structuredName": {
                            "firstName": "Howard",
                            "lastName": "Elliott",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Elliott"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3070676"
                        ],
                        "name": "J. Kuang",
                        "slug": "J.-Kuang",
                        "structuredName": {
                            "firstName": "Jie-Gang",
                            "lastName": "Kuang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Kuang"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 119974064,
            "fieldsOfStudy": [
                "Computer Science",
                "Mathematics"
            ],
            "id": "13480aa91d98f7a0b90e200d49b6ab67f3e6987c",
            "isKey": false,
            "numCitedBy": 13,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents a new approach for estimating the parameters of random fields characterized by Gibbs distributions. Unlike the commonly used \"coding method\", the parameter estimation procedure presented here involves the solution of a set of linear equations. We also present numerical and pictorial results on application of this estimation procedure on several Gibbs distributed images."
            },
            "slug": "A-new-approach-to-parameter-estimation-for-Gibbs-Derin-Elliott",
            "title": {
                "fragments": [],
                "text": "A new approach to parameter estimation for Gibbs random fields"
            },
            "tldr": {
                "abstractSimilarityScore": 82,
                "text": "This paper presents a new approach for estimating the parameters of random fields characterized by Gibbs distributions that involves the solution of a set of linear equations."
            },
            "venue": {
                "fragments": [],
                "text": "ICASSP '85. IEEE International Conference on Acoustics, Speech, and Signal Processing"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1710238"
                        ],
                        "name": "R. Haralick",
                        "slug": "R.-Haralick",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Haralick",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Haralick"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 44050331,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "48e5e52bbad59ead8096fb05ab149da5fc892d23",
            "isKey": false,
            "numCitedBy": 2705,
            "numCiting": 58,
            "paperAbstract": {
                "fragments": [],
                "text": "In this survey we review the image processing literature on the various approaches and models investigators have used for texture. These include statistical approaches of autocorrelation function, optical transforms, digital transforms, textural edgeness, structural element, gray tone cooccurrence, run lengths, and autoregressive models. We discuss and generalize some structural approaches to texture based on more complex primitives than gray tone. We conclude with some structural-statistical generalizations which apply the statistical techniques to the structural primitives."
            },
            "slug": "Statistical-and-structural-approaches-to-texture-Haralick",
            "title": {
                "fragments": [],
                "text": "Statistical and structural approaches to texture"
            },
            "tldr": {
                "abstractSimilarityScore": 96,
                "text": "This survey reviews the image processing literature on the various approaches and models investigators have used for texture, including statistical approaches of autocorrelation function, optical transforms, digital transforms, textural edgeness, structural element, gray tone cooccurrence, run lengths, and autoregressive models."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the IEEE"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143766793"
                        ],
                        "name": "A. Rosenfeld",
                        "slug": "A.-Rosenfeld",
                        "structuredName": {
                            "firstName": "Azriel",
                            "lastName": "Rosenfeld",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rosenfeld"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2083287686"
                        ],
                        "name": "E. B. Troy",
                        "slug": "E.-B.-Troy",
                        "structuredName": {
                            "firstName": "Eleanor",
                            "lastName": "Troy",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. B. Troy"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 209911486,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "0d107a8be4b642c48da49397720d94d4585e2145",
            "isKey": false,
            "numCitedBy": 167,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Differentiation between the coarsenesses of samples of a given texture may be successfully effected using any of the following measures: (1) Amount of edge per unit area, (2) Self-match (as measured by sum of absolute differences) over a unit shift, (3) Gray value dependency, and (4) Number of relative extrema per unit area."
            },
            "slug": "Visual-texture-analysis-Rosenfeld-Troy",
            "title": {
                "fragments": [],
                "text": "Visual texture analysis"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1970
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33660186"
                        ],
                        "name": "P. Flinn",
                        "slug": "P.-Flinn",
                        "structuredName": {
                            "firstName": "Paul",
                            "lastName": "Flinn",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Flinn"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122560058,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "1f15a74015b33b64519c3d0dc966c8020be442c4",
            "isKey": false,
            "numCitedBy": 60,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "Monte Carlo calculations were carried out for a two-dimensional Ising model of a binary alloy with nearest-neighbor attractive interactions between like atoms. The pair correlation observed had the form of an exponentially damped cosine function with parameters varying as the one-sixth power of the time."
            },
            "slug": "Monte-Carlo-calculation-of-phase-separation-in-a-Flinn",
            "title": {
                "fragments": [],
                "text": "Monte Carlo calculation of phase separation in a two-dimensional Ising system"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "12179233"
                        ],
                        "name": "E. Ising",
                        "slug": "E.-Ising",
                        "structuredName": {
                            "firstName": "Ernst",
                            "lastName": "Ising",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Ising"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122157319,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "cfd3f3da5eecf44137503e4f4f4fb02eef1c3aea",
            "isKey": false,
            "numCitedBy": 2848,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Beitrag-zur-Theorie-des-Ferromagnetismus-Ising",
            "title": {
                "fragments": [],
                "text": "Beitrag zur Theorie des Ferromagnetismus"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1925
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3072213"
                        ],
                        "name": "J. Besag",
                        "slug": "J.-Besag",
                        "structuredName": {
                            "firstName": "Julian",
                            "lastName": "Besag",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Besag"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 42087677,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "8bf730243ed967afd5349bef053641a6043517a0",
            "isKey": false,
            "numCitedBy": 6166,
            "numCiting": 69,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Spatial-Interaction-and-the-Statistical-Analysis-of-Besag",
            "title": {
                "fragments": [],
                "text": "Spatial Interaction and the Statistical Analysis of Lattice Systems"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102278025"
                        ],
                        "name": "Ross Kindermann",
                        "slug": "Ross-Kindermann",
                        "structuredName": {
                            "firstName": "Ross",
                            "lastName": "Kindermann",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Ross Kindermann"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34296841"
                        ],
                        "name": "J. Snell",
                        "slug": "J.-Snell",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Snell",
                            "middleNames": [
                                "Laurie"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Snell"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 117120661,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "870234e41be333eb8ab128cbd1ca1623838b8d7f",
            "isKey": false,
            "numCitedBy": 1314,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Markov-Random-Fields-and-Their-Applications-Kindermann-Snell",
            "title": {
                "fragments": [],
                "text": "Markov Random Fields and Their Applications"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 21,
        "totalPages": 3
    },
    "page_url": "https://www.semanticscholar.org/paper/Segmentation-of-textured-images-using-Gibbs-random-Derin-Cole/e275412a97407e8730a0a2fe93dcbc41d0c89ed1?sort=total-citations"
}