{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144020416"
                        ],
                        "name": "M. Bianchini",
                        "slug": "M.-Bianchini",
                        "structuredName": {
                            "firstName": "Monica",
                            "lastName": "Bianchini",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Bianchini"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145467467"
                        ],
                        "name": "M. Gori",
                        "slug": "M.-Gori",
                        "structuredName": {
                            "firstName": "Marco",
                            "lastName": "Gori",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Gori"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47260481"
                        ],
                        "name": "F. Scarselli",
                        "slug": "F.-Scarselli",
                        "structuredName": {
                            "firstName": "Franco",
                            "lastName": "Scarselli",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Scarselli"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61285219,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bde4cb307b61f24398a157eacff53b3eff80eb17",
            "isKey": false,
            "numCitedBy": 9,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "Recursive neural networks are a powerful tool for processing structured data. According to the recursive learning paradigm, the information to be processed consists of directed positional acyclic graphs (DPAGs). In fact, recursive networks are fed following the partial order defined by the links of the graph. Unfortunately, the hypothesis of processing DPAGs is sometimes too restrictive, being the nature of some real-world problems intrinsically disordered and cyclic. In the paper, a methodology is proposed which allows us to map any cyclic directed graph into a \"recursive-equivalent\" tree. Therefore, the computational power of recursive networks is definitely established, also clarifying the underlying limitations of the model."
            },
            "slug": "Recursive-processing-of-cyclic-graphs-Bianchini-Gori",
            "title": {
                "fragments": [],
                "text": "Recursive processing of cyclic graphs"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "A methodology is proposed which allows us to map any cyclic directed graph into a \"recursive-equivalent\" tree, and the computational power of recursive networks is definitely established, also clarifying the underlying limitations of the model."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the 2002 International Joint Conference on Neural Networks. IJCNN'02 (Cat. No.02CH37290)"
            },
            "year": 2002
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145467467"
                        ],
                        "name": "M. Gori",
                        "slug": "M.-Gori",
                        "structuredName": {
                            "firstName": "Marco",
                            "lastName": "Gori",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Gori"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35251916"
                        ],
                        "name": "Marco Maggini",
                        "slug": "Marco-Maggini",
                        "structuredName": {
                            "firstName": "Marco",
                            "lastName": "Maggini",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Marco Maggini"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2608269"
                        ],
                        "name": "L. Sarti",
                        "slug": "L.-Sarti",
                        "structuredName": {
                            "firstName": "Lorenzo",
                            "lastName": "Sarti",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Sarti"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60764369,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "767855258552b3b4cf7ab871979f72c9d3078631",
            "isKey": false,
            "numCitedBy": 22,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "The recursive paradigm extends the neural network processing and learning algorithms to deal with structured inputs. In particular, recursive neural network (RNN) models have been proposed to process information coded as directed positional acyclic graphs (DPAGs) whose maximum node outdegree is known a priori. Unfortunately, the hypothesis of processing DPAGs having a given maximum node outdegree is sometimes too restrictive, being the nature of some real-world problems intrinsically disordered. In many applications the node outdegrees can vary considerably among the nodes in the graph, it may be unnatural to define a position for each child of a given node, and it may be necessary to prune some edges to reduce the number of the network parameters, which is proportional to the maximum node outdegree. In this paper, we proposed a new recursive neural network model which allows us to process directed acyclic graphs (DAGs) with labeled edges, relaxing the positional constraint and the correlated maximum outdegree limit. The effectiveness of the new scheme is experimentally tested on an image classification task. The results show that the new RNN model outperforms the standard RNN architecture, also allowing us to use a smaller number of free parameters."
            },
            "slug": "A-recursive-neural-network-model-for-processing-Gori-Maggini",
            "title": {
                "fragments": [],
                "text": "A recursive neural network model for processing directed acyclic graphs with labeled edges"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "A new recursive neural network model is proposed which allows us to process directed acyclic graphs (DAGs) with labeled edges, relaxing the positional constraint and the correlated maximum outdegree limit and the results show that the new RNN model outperforms the standard RNN architecture, also allowing us to use a smaller number of free parameters."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the International Joint Conference on Neural Networks, 2003."
            },
            "year": 2003
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1688235"
                        ],
                        "name": "P. Frasconi",
                        "slug": "P.-Frasconi",
                        "structuredName": {
                            "firstName": "Paolo",
                            "lastName": "Frasconi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Frasconi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145467467"
                        ],
                        "name": "M. Gori",
                        "slug": "M.-Gori",
                        "structuredName": {
                            "firstName": "Marco",
                            "lastName": "Gori",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Gori"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1749815"
                        ],
                        "name": "A. Sperduti",
                        "slug": "A.-Sperduti",
                        "structuredName": {
                            "firstName": "Alessandro",
                            "lastName": "Sperduti",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Sperduti"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6197973,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a5eb96540ef53b49eac2246d6b13635fe6e54451",
            "isKey": false,
            "numCitedBy": 467,
            "numCiting": 100,
            "paperAbstract": {
                "fragments": [],
                "text": "A structured organization of information is typically required by symbolic processing. On the other hand, most connectionist models assume that data are organized according to relatively poor structures, like arrays or sequences. The framework described in this paper is an attempt to unify adaptive models like artificial neural nets and belief nets for the problem of processing structured information. In particular, relations between data variables are expressed by directed acyclic graphs, where both numerical and categorical values coexist. The general framework proposed in this paper can be regarded as an extension of both recurrent neural networks and hidden Markov models to the case of acyclic graphs. In particular we study the supervised learning problem as the problem of learning transductions from an input structured space to an output structured space, where transductions are assumed to admit a recursive hidden statespace representation. We introduce a graphical formalism for representing this class of adaptive transductions by means of recursive networks, i.e., cyclic graphs where nodes are labeled by variables and edges are labeled by generalized delay elements. This representation makes it possible to incorporate the symbolic and subsymbolic nature of data. Structures are processed by unfolding the recursive network into an acyclic graph called encoding network. In so doing, inference and learning algorithms can be easily inherited from the corresponding algorithms for artificial neural networks or probabilistic graphical model."
            },
            "slug": "A-general-framework-for-adaptive-processing-of-data-Frasconi-Gori",
            "title": {
                "fragments": [],
                "text": "A general framework for adaptive processing of data structures"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The framework described in this paper is an attempt to unify adaptive models like artificial neural nets and belief nets for the problem of processing structured information, where relations between data variables are expressed by directed acyclic graphs, where both numerical and categorical values coexist."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Neural Networks"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1749815"
                        ],
                        "name": "A. Sperduti",
                        "slug": "A.-Sperduti",
                        "structuredName": {
                            "firstName": "Alessandro",
                            "lastName": "Sperduti",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Sperduti"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1678493"
                        ],
                        "name": "A. Starita",
                        "slug": "A.-Starita",
                        "structuredName": {
                            "firstName": "Antonina",
                            "lastName": "Starita",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Starita"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 3,
                                "start": 0
                            }
                        ],
                        "text": "[4] are a new neural model that tries to overcome this problem."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 5942593,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3e33eca03933caaec671e20692e79d1acc9527e1",
            "isKey": false,
            "numCitedBy": 486,
            "numCiting": 46,
            "paperAbstract": {
                "fragments": [],
                "text": "Standard neural networks and statistical methods are usually believed to be inadequate when dealing with complex structures because of their feature-based approach. In fact, feature-based approaches usually fail to give satisfactory solutions because of the sensitivity of the approach to the a priori selection of the features, and the incapacity to represent any specific information on the relationships among the components of the structures. However, we show that neural networks can, in fact, represent and classify structured patterns. The key idea underpinning our approach is the use of the so called \"generalized recursive neuron\", which is essentially a generalization to structures of a recurrent neuron. By using generalized recursive neurons, all the supervised networks developed for the classification of sequences, such as backpropagation through time networks, real-time recurrent networks, simple recurrent networks, recurrent cascade correlation networks, and neural trees can, on the whole, be generalized to structures. The results obtained by some of the above networks (with generalized recursive neurons) on the classification of logic terms are presented."
            },
            "slug": "Supervised-neural-networks-for-the-classification-Sperduti-Starita",
            "title": {
                "fragments": [],
                "text": "Supervised neural networks for the classification of structures"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "It is shown that neural networks can, in fact, represent and classify structured patterns and all the supervised networks developed for the classification of sequences can, on the whole, be generalized to structures."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Neural Networks"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "116208651"
                        ],
                        "name": "Sc Thorsten",
                        "slug": "Sc-Thorsten",
                        "structuredName": {
                            "firstName": "Sc",
                            "lastName": "Thorsten",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Sc Thorsten"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1759124"
                        ],
                        "name": "C. Goller",
                        "slug": "C.-Goller",
                        "structuredName": {
                            "firstName": "Christoph",
                            "lastName": "Goller",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Goller"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 14,
                                "start": 11
                            }
                        ],
                        "text": "in chemics [1], software engineering, image processing [2]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 16984416,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b28aa3e3b951931e07284cc605a40220f1f37d35",
            "isKey": false,
            "numCitedBy": 10,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper is based on the neural folding architecture (FA). The FA is a recurrent neural network architecture which is especially suited for adaptive structure processing, i.e. learning approximations of mappings from symbolic term structures to IR n. The main objective of this paper is to demonstrate that the FA can be successfully applied to approximate quantitative structure activity relationships (QSARs), which play an important role during a drug design process. Several approaches for the conversion of a QSAR problem to suitable learning tasks for the FA are presented. Finally the FA is applied to a well-known QSAR benchmark, viz. the inhibition of E. coli dihydrofolate reductase by triazines. The achieved results are compared with results of other machine learning approaches on the same QSAR benchmark, and prove that the FA is signiicantly better. activity relationships, inhibition of E. coli dihydrofolate reductase by triazines."
            },
            "slug": "Relating-Chemical-Structure-to-Activity:-An-of-the-Thorsten-Goller",
            "title": {
                "fragments": [],
                "text": "Relating Chemical Structure to Activity: An Application of the Neural Folding Architecture"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The main objective of this paper is to demonstrate that the FA can be successfully applied to approximate quantitative structure activity relationships (QSARs), which play an important role during a drug design process."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1751770"
                        ],
                        "name": "E. Francesconi",
                        "slug": "E.-Francesconi",
                        "structuredName": {
                            "firstName": "Enrico",
                            "lastName": "Francesconi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Francesconi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1688235"
                        ],
                        "name": "P. Frasconi",
                        "slug": "P.-Frasconi",
                        "structuredName": {
                            "firstName": "Paolo",
                            "lastName": "Frasconi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Frasconi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145467467"
                        ],
                        "name": "M. Gori",
                        "slug": "M.-Gori",
                        "structuredName": {
                            "firstName": "Marco",
                            "lastName": "Gori",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Gori"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3285734"
                        ],
                        "name": "S. Marinai",
                        "slug": "S.-Marinai",
                        "structuredName": {
                            "firstName": "Simone",
                            "lastName": "Marinai",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Marinai"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2443962"
                        ],
                        "name": "Jianqing Sheng",
                        "slug": "Jianqing-Sheng",
                        "structuredName": {
                            "firstName": "Jianqing",
                            "lastName": "Sheng",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jianqing Sheng"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2540925"
                        ],
                        "name": "G. Soda",
                        "slug": "G.-Soda",
                        "structuredName": {
                            "firstName": "Giovanni",
                            "lastName": "Soda",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Soda"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1749815"
                        ],
                        "name": "A. Sperduti",
                        "slug": "A.-Sperduti",
                        "structuredName": {
                            "firstName": "Alessandro",
                            "lastName": "Sperduti",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Sperduti"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 58,
                                "start": 55
                            }
                        ],
                        "text": "in chemics [1], software engineering, image processing [2]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 2228282,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9802c126ffb50fe8ab589a6e1560f910a0165ad8",
            "isKey": false,
            "numCitedBy": 68,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper we propose recognizing logo images by using an adaptive model referred to as recursive artificial neural network. At first, logo images are converted into a structured representation based on contour trees. Recursive neural networks are then learnt using the contourtrees as inputs to the neural nets. On the other hand, the contour-tree is constructed by associating a node with each exterior or interior contour extracted from the logo instance. Nodes in the tree are labeled by a feature vector, which describes the contour by means of its perimeter, surrounded area, and a synthetic representation of its curvature plot. The contour-tree representation contains the topological structured information of logo and continuous values pertaining to each contour node. Hence symbolic and sub-symbolic information coexist in the contour-tree representation of logo image. Experimental results are reported on 40 real logos distorted with artificial noise and performance of recursive neural network is compared with another two types of neural approaches."
            },
            "slug": "Logo-Recognition-by-Recursive-Neural-Networks-Francesconi-Frasconi",
            "title": {
                "fragments": [],
                "text": "Logo Recognition by Recursive Neural Networks"
            },
            "tldr": {
                "abstractSimilarityScore": 70,
                "text": "This paper proposes recognizing logo images by using an adaptive model referred to as recursive artificial neural network, which contains the topological structured information of logo and continuous values pertaining to each contour node in the contour-tree representation of logo image."
            },
            "venue": {
                "fragments": [],
                "text": "GREC"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144020416"
                        ],
                        "name": "M. Bianchini",
                        "slug": "M.-Bianchini",
                        "structuredName": {
                            "firstName": "Monica",
                            "lastName": "Bianchini",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Bianchini"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2092902706"
                        ],
                        "name": "P. Mazzoni",
                        "slug": "P.-Mazzoni",
                        "structuredName": {
                            "firstName": "Paolo",
                            "lastName": "Mazzoni",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Mazzoni"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2608269"
                        ],
                        "name": "L. Sarti",
                        "slug": "L.-Sarti",
                        "structuredName": {
                            "firstName": "Lorenzo",
                            "lastName": "Sarti",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Sarti"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47260481"
                        ],
                        "name": "F. Scarselli",
                        "slug": "F.-Scarselli",
                        "structuredName": {
                            "firstName": "Franco",
                            "lastName": "Scarselli",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Scarselli"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 86,
                                "start": 83
                            }
                        ],
                        "text": "A similar approach was already used with success in recursive neural networks [7], [8]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 16577493,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "12182b550685b5097a1539c8dfa18c8aa49bba36",
            "isKey": false,
            "numCitedBy": 18,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "Images containing faces are fundamental for vision– based human computer interaction. Several problems concerning the presence of faces in images, including face recognition, pose estimation, and expression recognition have focused the research efforts in the last few years. Moreover, those problems are usually solved having assumed that the face was previously localized, often via heuristics based on prototypes of the whole face or significant details. Therefore, each fully automated system, which is able to analyze the information contained in images of faces, requires an efficient face localization method. In this paper, we propose a novel approach to the solution of the face localization problem using recursive neural networks. In particular, the proposed approach assumes a graph–based representation of images that combines structural and sub–symbolic visual features. Each image is represented by a forest of trees. Such trees are then processed by recursive neural networks, in order to establish the eventual presence and the position of faces inside the image. Some preliminary experiments on snapshots from video sequences are reported, showing very promising results."
            },
            "slug": "Face-Spotting-in-Color-Images-using-Recursive-Bianchini-Mazzoni",
            "title": {
                "fragments": [],
                "text": "Face Spotting in Color Images using Recursive Neural Networks"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This paper proposes a novel approach to the solution of the face localization problem using recursive neural networks that assumes a graph–based representation of images that combines structural and sub–symbolic visual features."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2003
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1688235"
                        ],
                        "name": "P. Frasconi",
                        "slug": "P.-Frasconi",
                        "structuredName": {
                            "firstName": "Paolo",
                            "lastName": "Frasconi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Frasconi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145467467"
                        ],
                        "name": "M. Gori",
                        "slug": "M.-Gori",
                        "structuredName": {
                            "firstName": "Marco",
                            "lastName": "Gori",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Gori"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35251916"
                        ],
                        "name": "Marco Maggini",
                        "slug": "Marco-Maggini",
                        "structuredName": {
                            "firstName": "Marco",
                            "lastName": "Maggini",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Marco Maggini"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40451893"
                        ],
                        "name": "E. Martinelli",
                        "slug": "E.-Martinelli",
                        "structuredName": {
                            "firstName": "Enrico",
                            "lastName": "Martinelli",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Martinelli"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2540925"
                        ],
                        "name": "G. Soda",
                        "slug": "G.-Soda",
                        "structuredName": {
                            "firstName": "Giovanni",
                            "lastName": "Soda",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Soda"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 37832536,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3945f338ab687c00de441b55790d3f1afa83c935",
            "isKey": false,
            "numCitedBy": 15,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Recurrent neural networks are powerful learning machines capable of processing sequences. A recent extension of these machines can conveniently be used to process also general data structures like trees and graphs, which opens the doors to a number of new very interesting applications previously unexplored."
            },
            "slug": "Inductive-Inference-of-Tree-Automata-by-Recursive-Frasconi-Gori",
            "title": {
                "fragments": [],
                "text": "Inductive Inference of Tree Automata by Recursive Neural Networks"
            },
            "tldr": {
                "abstractSimilarityScore": 87,
                "text": "Recurrent neural networks are powerful learning machines capable of processing sequences but can conveniently be used to process also general data structures like trees and graphs, which opens the doors to a number of new very interesting applications previously unexplored."
            },
            "venue": {
                "fragments": [],
                "text": "AI*IA"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48429353"
                        ],
                        "name": "Pineda",
                        "slug": "Pineda",
                        "structuredName": {
                            "firstName": "",
                            "lastName": "Pineda",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Pineda"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 40994937,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6602985bd326d9996c68627b56ed389e2c90fd08",
            "isKey": false,
            "numCitedBy": 905,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "An adaptive neural network with asymmetric connections is introduced. This network is related to the Hopfield network with graded neurons and uses a recurrent generalization of the \\ensuremath{\\delta} rule of Rumelhart, Hinton, and Williams to modify adaptively the synaptic weights. The new network bears a resemblance to the master/slave network of Lapedes and Farber but it is architecturally simpler."
            },
            "slug": "Generalization-of-back-propagation-to-recurrent-Pineda",
            "title": {
                "fragments": [],
                "text": "Generalization of back-propagation to recurrent neural networks."
            },
            "tldr": {
                "abstractSimilarityScore": 68,
                "text": "An adaptive neural network with asymmetric connections is introduced that bears a resemblance to the master/slave network of Lapedes and Farber but it is architecturally simpler."
            },
            "venue": {
                "fragments": [],
                "text": "Physical review letters"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144128701"
                        ],
                        "name": "M. Khamsi",
                        "slug": "M.-Khamsi",
                        "structuredName": {
                            "firstName": "Mohamed",
                            "lastName": "Khamsi",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Khamsi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145734132"
                        ],
                        "name": "W. A. Kirk",
                        "slug": "W.-A.-Kirk",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Kirk",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. A. Kirk"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 43,
                                "start": 40
                            }
                        ],
                        "text": "In fact, the Banach fixed point theorem [6] guarantees that if Fw is a contraction mapping, then Eq."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 118080951,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "46cb7584ba5838c67368fbb98748a662bd3b427e",
            "isKey": false,
            "numCitedBy": 587,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Preface. METRIC SPACES. Introduction. Metric Spaces. Metric Contraction Principles. Hyperconvex Spaces. \"Normal\" Structures in Metric Spaces. BANACH SPACES. Banach Spaces: Introduction. Continuous Mappings in Banach Spaces. Metric Fixed Point Theory. Banach Space Ultrapowers. Appendix: Set Theory. Bibliography. Index."
            },
            "slug": "An-Introduction-to-Metric-Spaces-and-Fixed-Point-Khamsi-Kirk",
            "title": {
                "fragments": [],
                "text": "An Introduction to Metric Spaces and Fixed Point Theory"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2068289963"
                        ],
                        "name": "L. B. Almeida",
                        "slug": "L.-B.-Almeida",
                        "structuredName": {
                            "firstName": "Luís",
                            "lastName": "Almeida",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. B. Almeida"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 79,
                                "start": 76
                            }
                        ],
                        "text": "for training recursive neural networks [41, and the AlmeidaPineda algorithm [9], [101."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 58820035,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8be3f21ab796bd9811382b560507c1c679fae37f",
            "isKey": false,
            "numCitedBy": 325,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-learning-rule-for-asynchronous-perceptrons-with-a-Almeida",
            "title": {
                "fragments": [],
                "text": "A learning rule for asynchronous perceptrons with feedback in a combinatorial environment"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 112,
                                "start": 109
                            }
                        ],
                        "text": "w and x, then the above learning procedure implements a gradient descendent strategy on the error function w [5]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A new neural network model for graph processing"
            },
            "venue": {
                "fragments": [],
                "text": "Department of Information Engineering, University of Siena, Tech. Rep. DII 01/05, 2005."
            },
            "year": 2005
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 2,
            "methodology": 5
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 12,
        "totalPages": 2
    },
    "page_url": "https://www.semanticscholar.org/paper/A-new-model-for-learning-in-graph-domains-Gori-Monfardini/9ca9f28676ad788d04ba24a51141a9a0a0df4d67?sort=total-citations"
}