{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3288569"
                        ],
                        "name": "H. Kiiveri",
                        "slug": "H.-Kiiveri",
                        "structuredName": {
                            "firstName": "Harri",
                            "lastName": "Kiiveri",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Kiiveri"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 122758769,
            "fieldsOfStudy": [
                "Mathematics",
                "Computer Science"
            ],
            "id": "7c79f298e281940b28b2cf3b92c732a6a846aa4a",
            "isKey": false,
            "numCitedBy": 5,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "Directed graphs and conditional independence ideas are used to define a class of causal models applicable to a finite set of random variables. Given the directed graph for a particular model, a factorization of the joint distribution of the random variables can be written down and rules given for reading the conditional independence relations amongst the variables. The definition does not depend on any particular distributional form and hence can be applied to models with both discrete and continuous random variables. However, the most tractable examples are those for which the joint distribution is normal, or a product of multinomials, and these are considered in detail."
            },
            "slug": "A-Unified-Theory-of-Causal-Models-Kiiveri",
            "title": {
                "fragments": [],
                "text": "A Unified Theory of Causal Models"
            },
            "tldr": {
                "abstractSimilarityScore": 77,
                "text": "Directed graphs and conditional independence ideas are used to define a class of causal models applicable to a finite set of random variables, which can be applied to models with both discrete and continuous random variables."
            },
            "venue": {
                "fragments": [],
                "text": "Bulletin of the Australian Mathematical Society"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49223598"
                        ],
                        "name": "J. Darroch",
                        "slug": "J.-Darroch",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Darroch",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Darroch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2050895"
                        ],
                        "name": "S. Lauritzen",
                        "slug": "S.-Lauritzen",
                        "structuredName": {
                            "firstName": "Steffen",
                            "lastName": "Lauritzen",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Lauritzen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "29989822"
                        ],
                        "name": "T. Speed",
                        "slug": "T.-Speed",
                        "structuredName": {
                            "firstName": "Terence",
                            "lastName": "Speed",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Speed"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 3545924,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "10143673f3f1a49d346120928d6b9a56851d6cf0",
            "isKey": false,
            "numCitedBy": 437,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "We use a close connection between the theory of Markov fields and that of log-linear interaction models for contingency tables to define and investigate a new class of models for such tables, graphical models. These models are hierarchical models that can be represented by a simple, undirected graph on as many vertices as the dimension of the corresponding table. Further all these models can be given an interpretation in terms of conditional independence and the interpretation can be read directly off the graph in the form of a Markov property. The class of graphical models contains that of decomposable models and we give a simple criterion for decomposability of a given graphical model. To some extent we discuss estimation problems and give suggestions for further work."
            },
            "slug": "Markov-Fields-and-Log-Linear-Interaction-Models-for-Darroch-Lauritzen",
            "title": {
                "fragments": [],
                "text": "Markov Fields and Log-Linear Interaction Models for Contingency Tables"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30871509"
                        ],
                        "name": "A. Goldberger",
                        "slug": "A.-Goldberger",
                        "structuredName": {
                            "firstName": "Arthur",
                            "lastName": "Goldberger",
                            "middleNames": [
                                "Stanley"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Goldberger"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "12152939"
                        ],
                        "name": "H. Blalock",
                        "slug": "H.-Blalock",
                        "structuredName": {
                            "firstName": "Hubert",
                            "lastName": "Blalock",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Blalock"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 124775836,
            "fieldsOfStudy": [
                "Sociology"
            ],
            "id": "a3b72fec32c5c8fe09efe0aa09323d011f277c33",
            "isKey": false,
            "numCitedBy": 165,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Causal models are formal theories stating the relationships between precisely defined variables, and have become an indispensable tool of the social scientist. This collection of articles is a course book on the causal modeling approach to theory construction and data analysis. H. M. Blalock, Jr. summarizes the then-current developments in causal model utilization in sociology, political science, economics, and other disciplines. This book provides a comprehensive multidisciplinary picture of the work on causal models. It seeks to address the problem of measurement in the social sciences and to link theory and research through the development of causal models.Organized into five sections (Simple Recursive Models, Path Analysis, Simultaneous Equations Techniques, The Causal Approach to Measurement Error, and Other Complications), this volume contains twenty-seven articles (eight of which were specially commissioned). Each section begins with an introduction explaining the concepts to be covered in the section and links them to the larger subject. It provides a general overview of the theory and application of causal modeling.Blalock argues for the development of theoretical models that can be operationalized and provide verifiable predictions. Many of the discussions of this subject that occur in other literature are too technical for most social scientists and other scholars who lack a strong background in mathematics. This book attempts to integrate a few of the less technical papers written by econometricians such as Koopmans, Wold, Strotz, and Fisher with discussions of causal approaches in the social and biological sciences. This classic text by Blalock is a valuable source of material for those interested in the issue of measurement in the social sciences and the construction of mathematical models."
            },
            "slug": "Causal-Models-in-the-Social-Sciences.-Goldberger-Blalock",
            "title": {
                "fragments": [],
                "text": "Causal Models in the Social Sciences."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "12152939"
                        ],
                        "name": "H. Blalock",
                        "slug": "H.-Blalock",
                        "structuredName": {
                            "firstName": "Hubert",
                            "lastName": "Blalock",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Blalock"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 144596461,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "f0ed2d7fdddc32234d666ffd87b43b58f5a592bd",
            "isKey": false,
            "numCitedBy": 119,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "Simon's method for making causal inferences from correlational data is applied to the various possible four-variable causal models. Prediction equations are given for forty-one models, so that the goodness of fit of any particular model can easily be evaluated without the use of tedious computations. Certain suggestion are also made for handling problems involving a larger number of variables. The major purpose of the paper, however, is to investigate what happens to the correlations between two variables when controls are made for variables which are causally related to these variables in different ways."
            },
            "slug": "Four-Variable-Causal-Models-and-Partial-Blalock",
            "title": {
                "fragments": [],
                "text": "Four-Variable Causal Models and Partial Correlations"
            },
            "venue": {
                "fragments": [],
                "text": "American Journal of Sociology"
            },
            "year": 1962
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3184408"
                        ],
                        "name": "N. Wermuth",
                        "slug": "N.-Wermuth",
                        "structuredName": {
                            "firstName": "Nanny",
                            "lastName": "Wermuth",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Wermuth"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 155,
                                "start": 41
                            }
                        ],
                        "text": "Our next result incorporates the work of Wermuth (1980) into the present framework. Decomposable graphs are defined and discussed in Darroch et al. (1980); they are simple graphs possessing no cycles of length n > 4 without chords."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 156,
                                "start": 141
                            }
                        ],
                        "text": "Most of the results in Section 3 relate to our particular parametrisation of 2 which is a variant of the Choleski-type factorisation used in Wermuth (1980). No use is made of the graph @ in this first lemma; we are simply dealing with p + q random variables labelled as above."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 56,
                                "start": 41
                            }
                        ],
                        "text": "Our next result incorporates the work of Wermuth (1980) into the present framework."
                    },
                    "intents": []
                }
            ],
            "corpusId": 122299929,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "4f0d3c27ffa81610fb8dddd244ff329f96d1b96a",
            "isKey": true,
            "numCitedBy": 150,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract By defining a reducible zero pattern and by using the concept of multiplicative models, we relate linear recursive equations that have been introduced by econometrician Herman Wold (1954) and path analysis as it was proposed by geneticist Sewall Wright (1923) to the statistical theory of covariance selection formulated by Arthur Dempster (1972). We show that a reducible zero pattern is the condition under which parameters as well as least squares estimates in recursive equations are one-to-one transformations of parameters and of maximum likelihood estimates, respectively, in a decomposable covariance selection model. As a consequence, (a) we can give a closed-form expression for the maximum likelihood estimate of a decomposable covariance matrix, (b) we can derive Wright's rule for computing implied correlations in path analysis, and (c) we can describe a search procedure for fitting recursive equations."
            },
            "slug": "Linear-Recursive-Equations,-Covariance-Selection,-Wermuth",
            "title": {
                "fragments": [],
                "text": "Linear Recursive Equations, Covariance Selection, and Path Analysis"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "94059053"
                        ],
                        "name": "H. Simon",
                        "slug": "H.-Simon",
                        "structuredName": {
                            "firstName": "Herbert",
                            "lastName": "Simon",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Simon"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 58,
                                "start": 44
                            }
                        ],
                        "text": "In his initial exposition of path analysis, Wright (1921) introduced into statistics the basic idea of directed graphs whose vertices represent continuous random variables and edges some notion of correlation and causation."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 545,
                                "start": 44
                            }
                        ],
                        "text": "In his initial exposition of path analysis, Wright (1921) introduced into statistics the basic idea of directed graphs whose vertices represent continuous random variables and edges some notion of correlation and causation. Apart from simply depicting the general nature of the linear structural equations which define the causal relations under study, these graphs are also used to write down those partial correlations which must vanish when the equations and the associated distributional assumptions take a standard form, see Blalock (1962). Furthermore, the path analysis rules of Wright (1921, 1934) involve tracing paths in the graph as part of an algorithm giving equations relating the variances and covariances of the random variables."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 123603975,
            "fieldsOfStudy": [
                "Economics"
            ],
            "id": "179ef2ab12e58c0fcf3355874ca1bb5ff5f9b211",
            "isKey": false,
            "numCitedBy": 476,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract * I am indebted to Richard M. Cyert, Paul F. Lazarsfeld, Roy Radner, and T. C Koopmans for valuable comments on earlier drafts of this paper. To test whether a correlation between two variables is genuine or spurious, additional variables and equations must be introduced, and sufficient assumptions must be made to identify the parameters of this wider system. If the two original variables are causally related in the wider system, the correlation is “genuine.”"
            },
            "slug": "Spurious-Correlation:-A-Causal-Interpretation*-Simon",
            "title": {
                "fragments": [],
                "text": "Spurious Correlation: A Causal Interpretation*"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1954
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "12870513"
                        ],
                        "name": "O. D. Duncan",
                        "slug": "O.-D.-Duncan",
                        "structuredName": {
                            "firstName": "Otis",
                            "lastName": "Duncan",
                            "middleNames": [
                                "Dudley"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. D. Duncan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 59428866,
            "fieldsOfStudy": [
                "Sociology"
            ],
            "id": "415c6551a1f1ce17df5b4c8a788e7d7b52927693",
            "isKey": false,
            "numCitedBy": 1253,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "Linear causal models are conveniently developed by the method of path coefficients proposed by Sewall Wright. Path analysis is useful in making explicit the rationale of conventional regression calculations. It may also have special usefulness in sociology problems involving the decomposition of a dependent variable or those in which successive experiences of a cohort are measured. Path analysis focuses on the problem of interpretation and does not purpot to be a method for discovering causes. It may, nevertheless, be invaluable in rendering interpretations explicit, self-consistent, and susceptible to rejection by subsequent research."
            },
            "slug": "Path-Analysis:-Sociological-Examples-Duncan",
            "title": {
                "fragments": [],
                "text": "Path Analysis: Sociological Examples"
            },
            "venue": {
                "fragments": [],
                "text": "American Journal of Sociology"
            },
            "year": 1966
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "117603410"
                        ],
                        "name": "R. Boudon",
                        "slug": "R.-Boudon",
                        "structuredName": {
                            "firstName": "Raymond",
                            "lastName": "Boudon",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Boudon"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 54,
                                "start": 40
                            }
                        ],
                        "text": "General references in this area include Boudon (1965), Duncan (1966, 1975), Goldberger and Duncan (1973), Moran (1963) and Simon (1953, 1954)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 147416126,
            "fieldsOfStudy": [
                "Business"
            ],
            "id": "761a47be30d341ae618b54e4e5665da21f783b0b",
            "isKey": false,
            "numCitedBy": 94,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "In addition to the close correspondence indicated by the rank order correlations in Table 7, computer-generated responses and labor union members' decisions do not differ significantly on any of the eight individual questionnaire items (see Table 5). Data from both the computer-simulated respondents and the human respondents support theoretical predictions, and this version of the model regarding decision strategy produces data that are remarkably close to living persons' responses, even in the variations from predictions."
            },
            "slug": "A-Method-of-Linear-Causal-Analysis:-Dependence-Boudon",
            "title": {
                "fragments": [],
                "text": "A Method of Linear Causal Analysis: Dependence Analysis"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1965
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39867082"
                        ],
                        "name": "L. A. Goodman",
                        "slug": "L.-A.-Goodman",
                        "structuredName": {
                            "firstName": "Leo",
                            "lastName": "Goodman",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. A. Goodman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 151,
                                "start": 128
                            }
                        ],
                        "text": "correlation analysis, not requiring a complete specification of the joint distribution of the random variables under study, see Kang and Seneta (1980) and references therein."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 144006084,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "00427d3722a349f68adfd92f93ada697aede9358",
            "isKey": false,
            "numCitedBy": 181,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "This article presents new models and methods that are particularly appropriate for the causal analysis of data obtained in panel studies and in other kinds of surveys. For a given path diagram, we provide methods for estimating the magnitude of the various effects represented in the diagram and also methods for determining whether the path-diagram model (described by a given system of equations) is congruent with the data. We present an overall test of the entire system of equations in the model, as well as separate tests of each equation in the system, and we also provide methods for comparing the merits and demerits ofa variety of path diagrams pertaining to the data. To illustrate the various advantages of the techniques proposed, we shall reanalyze three sets of data: (a) The famous two-attribute turnover table (the 16-fold table) on voting intention analyzed earlier by Lazarsfeld (1948), Lipset et al. (1954), Campbell (1963), Lazarsfeld, Berelson, and Gaudet (1968), Boudon (1968), and Lazarsfeld (1970); (b) a two-attribute turnover table on student attitudes analyzed earlier by Coleman (1964); and (c) the four-way cross-classification pertaining to the \"contact hypothesis\" analyzed earlier by Wilner, Walkley, and Cook (1955), Davis(1971), and Goodman (1972b). New insights into these data will be obtained."
            },
            "slug": "Causal-Analysis-of-Data-from-Panel-Studies-and-of-Goodman",
            "title": {
                "fragments": [],
                "text": "Causal Analysis of Data from Panel Studies and Other Kinds of Surveys"
            },
            "tldr": {
                "abstractSimilarityScore": 86,
                "text": "New models and methods that are particularly appropriate for the causal analysis of data obtained in panel studies and in other kinds of surveys are presented."
            },
            "venue": {
                "fragments": [],
                "text": "American Journal of Sociology"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32583585"
                        ],
                        "name": "R. F. Ling",
                        "slug": "R.-F.-Ling",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Ling",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. F. Ling"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2060895"
                        ],
                        "name": "D. A. Kenny",
                        "slug": "D.-A.-Kenny",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Kenny",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. A. Kenny"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 13822260,
            "fieldsOfStudy": [
                "Education"
            ],
            "id": "eae4a087e2c2c72d3ed0475cd7b554164233378b",
            "isKey": false,
            "numCitedBy": 1610,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "The ideal method of science is the study of the direct influence of one condition on another in experiments in which all other possible causes of variation are eliminated. Unfortunately, causes of variation often seem to be beyond control. In the biological sciences, especially, one often has to deal with a group of characteristics or conditions which are correlated because of a complex of interacting, uncontrollable, and often obscure causes. The degree of correlation between two variables can be calculated by well-known methods, but when it is found it gives merely the resultant of all connecting paths of influence. The present paper is an attempt to present a method of measuring the direct influence along each separate path in such a system and thus of finding the degree to which variation of a given effect is determined by each particular cause. The method depends on the combination of knowledge of the degrees of correlation among the variables in a system with such knowledge as may be possessed of the causal relations. In cases in which the causal relations are uncertain the method can be used to find the logical consequences of any particular hypothesis in regard to them. CORRELATION"
            },
            "slug": "Correlation-and-Causation.-Ling-Kenny",
            "title": {
                "fragments": [],
                "text": "Correlation and Causation."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39867082"
                        ],
                        "name": "L. A. Goodman",
                        "slug": "L.-A.-Goodman",
                        "structuredName": {
                            "firstName": "Leo",
                            "lastName": "Goodman",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. A. Goodman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 145018886,
            "fieldsOfStudy": [
                "Economics",
                "Sociology"
            ],
            "id": "80c85b2bcdbdff2d2dcb32766679652f91ab515c",
            "isKey": false,
            "numCitedBy": 494,
            "numCiting": 34,
            "paperAbstract": {
                "fragments": [],
                "text": "This article presents methods for analyzing the relationships among a set of qualitative variables when some of these variables are specified manifest (i.e., observed) variables and others are latent (i.e., unobserved or unobservable) variables. We shall show how to estimate the magnitude of the various effects represented in pathdiagram models that include both the manifestand latent variables, and also how to test whether this kind of path-diagram model is congruent with the observed data. These methods can be applied in order to analyze data obtained in various kinds of surveys (including panel studies), and also in order to construct tests and indices for purposes of measurement and prediction. To illustrate their wide applicability and flexibility, we shall use these methods to reanalyze several different sets of data which were analyzed earlier by Coleman (1964), Lazarsfeld (1948, 1970), Goodman (1973a), and others. Except for some related conclusions in Goodman (1973a), the methods introduced herein lead to conclusions that are very different from those presented by the other researchers who had analyzed these data earlier."
            },
            "slug": "The-Analysis-of-Systems-of-Qualitative-Variables-of-Goodman",
            "title": {
                "fragments": [],
                "text": "The Analysis of Systems of Qualitative Variables When Some of the Variables Are Unobservable. Part I-A Modified Latent Structure Approach"
            },
            "venue": {
                "fragments": [],
                "text": "American Journal of Sociology"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39867082"
                        ],
                        "name": "L. A. Goodman",
                        "slug": "L.-A.-Goodman",
                        "structuredName": {
                            "firstName": "Leo",
                            "lastName": "Goodman",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. A. Goodman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 144307804,
            "fieldsOfStudy": [
                "Business"
            ],
            "id": "37ca615643fb65704d4b4f76378a87582e1b50c0",
            "isKey": false,
            "numCitedBy": 330,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "This article shows how the combined use of direct estimation methods and indirect testing procedures, which was advocated by Goodman (1970-1971a), can beapplied in survey analysis. this approach to survey analysis replaces a \"causal system\" diagram (of the kind used, e.g., by Davis 1971) by a more quantitativelyexplicit model of the system, which then leads to a more direct and more unifiedassessment of the relationships among the variables in the system. The methods presented in the present article can also help the survey analyst to determine whether his survey data support or negate a given hypothesized causal system; and in some cases these methods can be used to determine alternative causal systems that provide better descriptions of the phenomena under investigation. To illustrate the application of these methods, we shall reanalyze data that were analyzed recently by Davis (1971) and earlier by Wilner, Walkley, and Cook (1955) in their well-known study of the \"contact hypothesis.\" We also include in the present article some new results on how the relationship between two given dichotomous variables is affected by the introduction of additional variables."
            },
            "slug": "A-General-Model-for-the-Analysis-of-Surveys-Goodman",
            "title": {
                "fragments": [],
                "text": "A General Model for the Analysis of Surveys"
            },
            "venue": {
                "fragments": [],
                "text": "American Journal of Sociology"
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39867082"
                        ],
                        "name": "L. A. Goodman",
                        "slug": "L.-A.-Goodman",
                        "structuredName": {
                            "firstName": "Leo",
                            "lastName": "Goodman",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. A. Goodman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 123162468,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "038742d1ccd731e65f9bbd112b4da91b50146643",
            "isKey": false,
            "numCitedBy": 1559,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "SUMMARY This paper considers a wide class of latent structure models. These models can serve as possible explanations of the observed relationships among a set of m manifest polytomous variables. The class of models considered here includes both models in which the parameters are identifiable and also models in which the parameters are not. For each of the models considered here, a relatively simple method is presented for calculating the maximum likeli- hood estimate of the frequencies in the m-way contingency table expected under the model, and for determining whether the parameters in the estimated model are identifiable. In addition, methods are presented for testing whether the model fits the observed data, and for replacing unidentifiable models that fit by identifiable models that fit. Some illus- trative applications to data are also included. This paper deals with the relationships among m polytomous variables, i.e. with the analysis of an m-way contingency table. These m variables are manifest variables in that, for each observed individual in a sample, his class with respect to each of the m variables is observed. We also consider here polytomous variables that are latent in that an individ- ual's class with respect to these variables is not observed. The classes of a latent variable will be called latent classes. Consider first a 4-way contingency table which cross-classifies a sample of n individuals with respect to four manifest polytomous variables A, B, C and D. If there is, say, some latent dichotomous variable X, so that each of the n individuals is in one of the two latent classes with respect to this variable, and within the tth latent class the manifest variables (A, B, C, D) are mutually independent, then this two-class latent structure would serve as a simple explanation of the observed relationships among the variables in the 4-way con- tingency table for the n individuals. There is a direct generalization when the latent variable has T classes. We shall present some relatively simple methods for determining whether the observed relationships among the variables in the m-way contingency table can be explained by a T-class structure, or by various modifications and extensions of this latent structure. To illustrate the methods we analyze Table 1, a 24 contingency table presented earlier by Stouffer & Toby (1951, 1962, 1963), which cross-classifies 216 respondents with respect to whether they tend towards universalistic values ( + ) or particularistic values (-) when confronted by each of four different situations of role conflict. The letters A, B, C and D in"
            },
            "slug": "Exploratory-latent-structure-analysis-using-both-Goodman",
            "title": {
                "fragments": [],
                "text": "Exploratory latent structure analysis using both identifiable and unidentifiable models"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "70056214"
                        ],
                        "name": "S. Wright",
                        "slug": "S.-Wright",
                        "structuredName": {
                            "firstName": "Sewall",
                            "lastName": "Wright",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Wright"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 121382684,
            "fieldsOfStudy": [
                "Education"
            ],
            "id": "f6d9ba13cb2f6354787e1c8fe4ee30cbd5f6addb",
            "isKey": false,
            "numCitedBy": 1791,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "The Method of path coefficients was suggested a number of years ago (Wright 1918, more fully 1920, 1921), as a flexible means of relating the correlation coefficients between variables in a multiple system to the functional relations among them. The method has been applied in quite a variety of cases. It seems desirable now to make a restatement of the theory and to review the types of application, especially as there has been a certain amount of misunderstanding both of purpose and of procedure."
            },
            "slug": "The-Method-of-Path-Coefficients-Wright",
            "title": {
                "fragments": [],
                "text": "The Method of Path Coefficients"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1934
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39867082"
                        ],
                        "name": "L. A. Goodman",
                        "slug": "L.-A.-Goodman",
                        "structuredName": {
                            "firstName": "Leo",
                            "lastName": "Goodman",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. A. Goodman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122014236,
            "fieldsOfStudy": [
                "Sociology"
            ],
            "id": "65260ddd0bb7c68ce91b55bace4645398575d2d2",
            "isKey": false,
            "numCitedBy": 207,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "S-UMMARY Models and methods for analyzing the relations among a set of polytomous variables, when some of the variables are posterior to others, are presented. The techniques proposed here yield 'path diagrams' that are somewhat analogous to those used in path analysis. Earlier path analysis models are not suited to the case where the variables are polytomous, or dichotomous, but the models proposed herein are. For each of our models, methods are presented for (a) testing whether the model fits the data, (b) partitioning the test statistic into components that can be used to test submodels within the overall model, and (c) estimating the parameters in the model. An illustrative application is also included."
            },
            "slug": "The-analysis-of-multidimensional-contingency-tables-Goodman",
            "title": {
                "fragments": [],
                "text": "The analysis of multidimensional contingency tables when some variables are posterior to others: a modified path analysis approach"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2149602933"
                        ],
                        "name": "D. I. Holmes",
                        "slug": "D.-I.-Holmes",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Holmes",
                            "middleNames": [
                                "I."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. I. Holmes"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 53877008,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "07a47d8e7c81ae74285145d89ba3116dae1b00bd",
            "isKey": false,
            "numCitedBy": 4,
            "numCiting": 31,
            "paperAbstract": {
                "fragments": [],
                "text": "The content of this thesis is divided into two part. Part I consists of a review of graphical methods in data analysis, whilst Part II presents a graphical procedure for identifying growth curves based on the fitting of a polynomial function to sections or \"blocks\" of the raw data."
            },
            "slug": "Graphical-methods-for-the-analysis-of-data.-Holmes",
            "title": {
                "fragments": [],
                "text": "Graphical methods for the analysis of data."
            },
            "tldr": {
                "abstractSimilarityScore": 83,
                "text": "The content of this thesis is divided into two part: a review of graphical methods in data analysis and a graphical procedure for identifying growth curves based on the fitting of a polynomial function to sections or \"blocks\" of the raw data."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1684961"
                        ],
                        "name": "S. Fienberg",
                        "slug": "S.-Fienberg",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Fienberg",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Fienberg"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 221,
                                "start": 205
                            }
                        ],
                        "text": "In this section we examine the problems of parametrising discrete recursive causal models, and relate such models to the more familiar log-linear models for discrete data, see Goodman (1972, 1973a, b) and Fienberg (1977). We begin with some extra notation and terminology."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 62405077,
            "fieldsOfStudy": [
                "Business"
            ],
            "id": "a4c0f3525bc9dbf6f23ba9da51c0c2bb695229aa",
            "isKey": false,
            "numCitedBy": 2362,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The second edition has been updated and revised, with more emphasis on logic and logistic response properties and on the small-sample behavior of chi-square statistics. It includes 40 to 50 new problems with most having separate data sheets. A solutions manual is available to qualified instructors. In addition, some minor revisions in early chapters have been added to clarify such terms as order categories and collapsing."
            },
            "slug": "The-analysis-of-cross-classified-categorical-data-Fienberg",
            "title": {
                "fragments": [],
                "text": "The analysis of cross-classified categorical data"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "The second edition has been updated and revised, with more emphasis on logic and logistic response properties and on the small-sample behavior of chi-square statistics."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1978
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 130,
                                "start": 105
                            }
                        ],
                        "text": "The graph Figure 3(i) below arises as part of the causal system described as two-wave two-variables, see Kiiveri and Speed (1982)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 428,
                                "start": 42
                            }
                        ],
                        "text": ",am and d with a^ and a, separated by d ( K k < / < m) is readily found to be equivalent to the condition stated here. The general equivalence of the local and global Markov conditions over an arbitrary finite graph does not seem to be explicit in the published literature. It is well known for discrete random variables, where it follows from a characterisation of all corresponding probability distributions, see Speed (1979) for this result (and many references to equivalent ones), while the remarks on page 194 of that paper show how to get the general result."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 122,
                                "start": 97
                            }
                        ],
                        "text": "A much more extensive discussion of these ideas with reference and illustrations can be found in Kiiveri and Speed (1982)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 37,
                                "start": 14
                            }
                        ],
                        "text": "More recently Kang and Seneta (1980) prove results which relate closely to the material concerning Gaussian arrays."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 158,
                                "start": 135
                            }
                        ],
                        "text": "There is now quite a large literature on path analysis but few precise formulations or proofs of the so-called path analysis rule, see Kang and Seneta (1980) for references."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 81,
                                "start": 66
                            }
                        ],
                        "text": "Its final form is the basis for the approach adopted in a thesis, Kiiveri (1982), on causal models, and the author gratefully acknowledges the Commonwealth Postgraduate Research Scholarship held during the preparation of that thesis."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 288,
                                "start": 14
                            }
                        ],
                        "text": "More recently Kang and Seneta (1980) prove results which relate closely to the material concerning Gaussian arrays. Specifically, their Lemma 1 is a second-order version of part of the main theorem and their Lemma 3 is a more general version of our Proposition 3. Finally, Wermuth (1980) considers the relationship between the pattern of zeros of 2\"(1) and that of L in 2~' = LA~l7, proving that they are essentially the same iff the corresponding Gaussian distribution (or graph) is decomposable."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Structural equation models in the social sciences: Specification, estimation"
            },
            "venue": {
                "fragments": [],
                "text": "Joreskog"
            },
            "year": 1977
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 54,
                                "start": 0
                            }
                        ],
                        "text": "This coincides with the approach of N. Wermuth (1980), see the expression for 2\" 1 associated wi th®."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 41,
                                "start": 0
                            }
                        ],
                        "text": "They have been discussed in Speed (1979). (There, however, the subspace S(A) is denoted by EA; we have changed notation to avoid confusion with edge sets."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 238,
                                "start": 0
                            }
                        ],
                        "text": "The following reformulation of the main theorem shows that a recursive causal model for discrete data is, in general, the conjunction of a set of log-linear models for the full array and certain of its marginals. Recall, see Speed (1978), that a maximal clique in an undirected graph is a set of vertices each pair of which is connected by an edge, and is maximal with respect to this property."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Speed (1978a), Graphical methods in the analysis of data (Lecture notes issued at the University"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1978
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 59,
                                "start": 45
                            }
                        ],
                        "text": "This paper began as an honours dissertation, Carlin (1977), by one of the authors."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 322,
                                "start": 45
                            }
                        ],
                        "text": "This paper began as an honours dissertation, Carlin (1977), by one of the authors. Its further development was greatly assisted by access to then unpublished work of Kang and Seneta (1980) and Wermuth (1980), and many thanks are due to these authors for their kindness. The ideas were discussed in a seminar Speed (1978a) at the University of Copenhagen, and further thanks are due to all of the active participants in that seminar, especially Steffen Lauritzen."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 189,
                                "start": 45
                            }
                        ],
                        "text": "This paper began as an honours dissertation, Carlin (1977), by one of the authors. Its further development was greatly assisted by access to then unpublished work of Kang and Seneta (1980) and Wermuth (1980), and many thanks are due to these authors for their kindness."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Causal models: an attempt at a unified approach (Honours"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "71132329"
                        ],
                        "name": "G. Goudswaard",
                        "slug": "G.-Goudswaard",
                        "structuredName": {
                            "firstName": "G.",
                            "lastName": "Goudswaard",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Goudswaard"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16718772"
                        ],
                        "name": "W. Hood",
                        "slug": "W.-Hood",
                        "structuredName": {
                            "firstName": "Wm.",
                            "lastName": "Hood",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Hood"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2697616"
                        ],
                        "name": "T. Koopmans",
                        "slug": "T.-Koopmans",
                        "structuredName": {
                            "firstName": "Tjalling",
                            "lastName": "Koopmans",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Koopmans"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 124060741,
            "fieldsOfStudy": [
                "Economics"
            ],
            "id": "187dcd717dc4a2dfd5c20c5b0084aad7c501ea05",
            "isKey": false,
            "numCitedBy": 16,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Studies-in-Econometric-Method-Goudswaard-Hood",
            "title": {
                "fragments": [],
                "text": "Studies in Econometric Method"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1954
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2431814"
                        ],
                        "name": "L. Taylor",
                        "slug": "L.-Taylor",
                        "structuredName": {
                            "firstName": "Lester",
                            "lastName": "Taylor",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Taylor"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30871509"
                        ],
                        "name": "A. Goldberger",
                        "slug": "A.-Goldberger",
                        "structuredName": {
                            "firstName": "Arthur",
                            "lastName": "Goldberger",
                            "middleNames": [
                                "Stanley"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Goldberger"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "12870513"
                        ],
                        "name": "O. D. Duncan",
                        "slug": "O.-D.-Duncan",
                        "structuredName": {
                            "firstName": "Otis",
                            "lastName": "Duncan",
                            "middleNames": [
                                "Dudley"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. D. Duncan"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 124416743,
            "fieldsOfStudy": [
                "Sociology"
            ],
            "id": "75b9079e51c4eaaf143f039815f85dc9d871151c",
            "isKey": false,
            "numCitedBy": 199,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Structural-Equation-Models-in-the-Social-Sciences.-Taylor-Goldberger",
            "title": {
                "fragments": [],
                "text": "Structural Equation Models in the Social Sciences."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "29989822"
                        ],
                        "name": "T. Speed",
                        "slug": "T.-Speed",
                        "structuredName": {
                            "firstName": "Terence",
                            "lastName": "Speed",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Speed"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 968,
                                "start": 0
                            }
                        ],
                        "text": "The undirected graph with vertices Vx(®) and edges Ex(®) will be denoted by ©x, the subgraph on the exogenous vertices. More generally, the subgraph of © defined by any subset B c F o f vertices will be denoted by (B)@; its vertices are the elements of B and its edges those in © both of whose elements belong to B. An important object associated with any causal graph © is what we call the underlying undirected graph ©\" which has the same set of vertices F(@\") = V{®), whilst its edges £(©\") are the undirected ones Ex(®) of © together with the additional undirected ones connecting pairs of vertices between which a directed edge exists in ©, that is, £(©\") = Ex(®) U £„(©), where £„(©) denotes the directed edges of © with their direction omitted. A triple i,j and k of distinct vertices in © is said to be in configuration [>] if i -> k,j -> k but / and j are not connected by any edge, directed or undirected. This notion, which first appeared in Wermuth (1980), plays a key role in determining the admissible independence statements associated with a causal graph."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 152,
                                "start": 64
                            }
                        ],
                        "text": "We have already asserted the equivalence of the factorisation (1234) = (12)(3|2)(4| 13) with the pair of factorisations (123) = (12)(23)/(2) and (1234) = (123)(134)/(13)."
                    },
                    "intents": []
                }
            ],
            "corpusId": 124324212,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "73e3e5f948a032350d6a335dad30b4dc599345d3",
            "isKey": false,
            "numCitedBy": 16,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Relations-between-Models-for-Spatial-Data,-Tables-Speed",
            "title": {
                "fragments": [],
                "text": "Relations between Models for Spatial Data, Contingency Tables and Markov Fields on Graphs"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2040241"
                        ],
                        "name": "J. Ware",
                        "slug": "J.-Ware",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Ware",
                            "middleNames": [
                                "Harold"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Ware"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48104572"
                        ],
                        "name": "P. Krishnaiah",
                        "slug": "P.-Krishnaiah",
                        "structuredName": {
                            "firstName": "Paruchuri",
                            "lastName": "Krishnaiah",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Krishnaiah"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 119373428,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "06e3efa0dcc1c887b2e51e89f11fa14f97b7befb",
            "isKey": false,
            "numCitedBy": 241,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Applications-of-Statistics-Ware-Krishnaiah",
            "title": {
                "fragments": [],
                "text": "Applications of Statistics"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49432033"
                        ],
                        "name": "P. Moran",
                        "slug": "P.-Moran",
                        "structuredName": {
                            "firstName": "Percy",
                            "lastName": "Moran",
                            "middleNames": [
                                "artist"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Moran"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 120640293,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "7da433292884435deba0cc5961608422393fe348",
            "isKey": false,
            "numCitedBy": 10,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "PATH-COEFFICIENTS-RECONSIDERED-Moran",
            "title": {
                "fragments": [],
                "text": "PATH COEFFICIENTS RECONSIDERED"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1961
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3288569"
                        ],
                        "name": "H. Kiiveri",
                        "slug": "H.-Kiiveri",
                        "structuredName": {
                            "firstName": "Harri",
                            "lastName": "Kiiveri",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Kiiveri"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "29989822"
                        ],
                        "name": "T. Speed",
                        "slug": "T.-Speed",
                        "structuredName": {
                            "firstName": "Terence",
                            "lastName": "Speed",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Speed"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 120825128,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "abbf177beebe5608d85a202d94413ab3dcf8122c",
            "isKey": false,
            "numCitedBy": 107,
            "numCiting": 53,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Structural-Analysis-of-Multivariate-Data:-A-Review-Kiiveri-Speed",
            "title": {
                "fragments": [],
                "text": "Structural Analysis of Multivariate Data: A Review"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31730507"
                        ],
                        "name": "W. D. Ray",
                        "slug": "W.-D.-Ray",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Ray",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. D. Ray"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48104572"
                        ],
                        "name": "P. Krishnaiah",
                        "slug": "P.-Krishnaiah",
                        "structuredName": {
                            "firstName": "Paruchuri",
                            "lastName": "Krishnaiah",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Krishnaiah"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 67121690,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0fc76d14cfba6bece090f15fd4c32e23c32bf7e9",
            "isKey": false,
            "numCitedBy": 59,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Developments-in-Statistics-Ray-Krishnaiah",
            "title": {
                "fragments": [],
                "text": "Developments in Statistics"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "1973a), \"The analysis of multidimensional contingency tables when some variables"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1973
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "1974a), 'Exploratory latent structure analysis using both identifiable and unidentifia"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1974
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 13,
                                "start": 0
                            }
                        ],
                        "text": "Moran (1961) operates within a framework similar to ours, making Markov-type conditional independence assumptions concerning his system of random variables."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Path analysis: an exposition', Developments in statistics 3, pp"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Structural equation models in the social sciences (Seminar"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1973
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Structural equation models in the social sciences: Specification, estimation and testing', Applications of statistics"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Causal ordering and identifiability', Studies in econometric method"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1953
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Introduction to structural equation models (Academic Press, New York)"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Causal models: an attempt at a unified approach (Honours thesis"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Correlation and causation',7"
            },
            "venue": {
                "fragments": [],
                "text": "Agric. Research"
            },
            "year": 1921
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Causal models : an attempt at a unified approach ( Honours thesis , Department of Mathematics , University of Western Australia )"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Log-linear models for contingency tables and Markov fields over graphs"
            },
            "venue": {
                "fragments": [],
                "text": "Ann. Statist"
            },
            "year": 1980
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A note on nearest-neighbour Gibbs and Markov probability"
            },
            "venue": {
                "fragments": [],
                "text": "Speed"
            },
            "year": 1979
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Path analysis: an exposition', Developments in statistics 3"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 5,
            "methodology": 6
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 40,
        "totalPages": 4
    },
    "page_url": "https://www.semanticscholar.org/paper/Recursive-causal-models-Kiiveri-Speed/9cef473b998702c904ada536c1b403d28eb5c88a?sort=total-citations"
}