{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145341779"
                        ],
                        "name": "J. R. Quinlan",
                        "slug": "J.-R.-Quinlan",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Quinlan",
                            "middleNames": [
                                "Ross"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. R. Quinlan"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 59770361,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d7bb7027fecb01fb6292d6c51d417f2ea003d57d",
            "isKey": false,
            "numCitedBy": 58,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Techniques for discovering rules by induction from large collections of instances are developed. These are based on an iterative scheme for dividing the instances into two sets, only one of which needs to be randomly accessible. These techniques have made it possible to discover complex rules from data bases containing many thousands of instances. Results of several experiments using them are reported."
            },
            "slug": "Induction-over-large-data-bases-Quinlan",
            "title": {
                "fragments": [],
                "text": "Induction over large data bases"
            },
            "tldr": {
                "abstractSimilarityScore": 96,
                "text": "Techniques for discovering rules by induction from large collections of instances are developed based on an iterative scheme for dividing the instances into two sets, only one of which needs to be randomly accessible."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40975594"
                        ],
                        "name": "Tom Michael Mitchell",
                        "slug": "Tom-Michael-Mitchell",
                        "structuredName": {
                            "firstName": "Tom",
                            "lastName": "Mitchell",
                            "middleNames": [
                                "Michael"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tom Michael Mitchell"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10150894,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "19bfa432237dc1bd82113774727fe0307005e430",
            "isKey": false,
            "numCitedBy": 389,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "An important research problem in artificial intelligence is the study of methods for learning general concepts or rules from a set of training instances. An approach to this problem is presented which is guaranteed to find, without backtracing, all rule versions consistent with a set of positive and negative training instances. The algorithm put forth uses a representation of the space of those rules consistent with the observed training data. This \"rule version space\" is modified in response to new training instances by eliminating candidate rule versions found to conflict with each new instance. The use of version spaces is discussed in the context of Meta-DENDRAL, a program which learns rules in the domain of chemical spectroscopy."
            },
            "slug": "Version-Spaces:-A-Candidate-Elimination-Approach-to-Mitchell",
            "title": {
                "fragments": [],
                "text": "Version Spaces: A Candidate Elimination Approach to Rule Learning"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "An approach to this problem is presented which is guaranteed to find, without backtracing, all rule versions consistent with a set of positive and negative training instances."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1398681259"
                        ],
                        "name": "F. Hayes-Roth",
                        "slug": "F.-Hayes-Roth",
                        "structuredName": {
                            "firstName": "Frederick",
                            "lastName": "Hayes-Roth",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Hayes-Roth"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 32040758,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c622d53802e1aabbfb3facfd91b2288839129655",
            "isKey": false,
            "numCitedBy": 21,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : The common need of both Artificial Intelligence and Pattern Recognition for effective methods of automatic knowledge acquisition is considered. A pattern of induction is defined as a framework which relates a theory of behavior generation, underlying knowledge structures, and a learning methodology. One particular learning theory, called interference matching, suggests that knowledge structures which underlie behavior descriptions can be directly abstracted from those descriptions. Because of the close connection between descriptions and inferences in such a framework, the strengths and weaknesses of several types of descriptions are considered. Algorithms which exploit this theory are presented for three classes of problems: pattern learning and classification; induction of quantified production rules; and the induction of syntactic categories and phrase structure rules. Preliminary results are presented and directions for future research are outlined."
            },
            "slug": "Patterns-of-induction-and-associated-knowledge-Hayes-Roth",
            "title": {
                "fragments": [],
                "text": "Patterns of induction and associated knowledge acquisition algorithms"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "Algorithms which exploit one particular learning theory, called interference matching, which suggests that knowledge structures which underlie behavior descriptions can be directly abstracted from those descriptions, are presented."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1704635"
                        ],
                        "name": "D. Lenat",
                        "slug": "D.-Lenat",
                        "structuredName": {
                            "firstName": "Douglas",
                            "lastName": "Lenat",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Lenat"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 60603795,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "043acfaf749c456f76fe010022771ce39979f196",
            "isKey": false,
            "numCitedBy": 333,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : A program called 'AM', is described which models one aspect of elementary mathematics research: developing new concepts under the guidance of a large body of heuristic rules. 'Mathematics' is considered as a type of intelligent behavior, not as a finished product. The local heuristics communicate via an agenda mechanism, a global list of tasks for the system to perform and reasons why each task is plausible. A single task might direct AM to define a new concept, or to explore some facet of an existing concept, or to examine some empirical data for regularities, etc. Repeatedly, the program selects from the agenda the task having the best supporting reasons, and then executes it. Each concept is an active, structured knowledge module. A hundred very incomplete modules are initially provided, each one corresponding to an elementary set-theoretic concept (e.g.,union). This provides a definite but immense 'space' which AM begins to explore. AM extends its knowledge base, ultimately rediscovering hundreds of common concepts (e.g., numbers) and theorems (e.g., unique factorization). This approach to plausible inference contains great powers and great limitations."
            },
            "slug": "AM,-an-artificial-intelligence-approach-to-in-as-Lenat",
            "title": {
                "fragments": [],
                "text": "AM, an artificial intelligence approach to discovery in mathematics as heuristic search"
            },
            "tldr": {
                "abstractSimilarityScore": 85,
                "text": "A program called 'AM', is described which models one aspect of elementary mathematics research: developing new concepts under the guidance of a large body of heuristic rules, containing great powers and great limitations."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2421006"
                        ],
                        "name": "R. Michalski",
                        "slug": "R.-Michalski",
                        "structuredName": {
                            "firstName": "Ryszard",
                            "lastName": "Michalski",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Michalski"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2298655,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "20883c0004d6a5eae7fea33e9d4371d8346417b5",
            "isKey": false,
            "numCitedBy": 74,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "The paper presents a set-theoretical definition of the classification problem, and then discusses and illustrates by examples the application of the variable-valued logic system VL. to the synthesis of minimal (or simplest) classification rules under cost (or simplicity) functionals designed by a user from available criteria."
            },
            "slug": "Discovering-Classification-Rules-Using-Logic-System-Michalski",
            "title": {
                "fragments": [],
                "text": "Discovering Classification Rules Using variable-Valued Logic System VL1"
            },
            "tldr": {
                "abstractSimilarityScore": 51,
                "text": "The paper discusses and illustrates by examples the application of the variable-valued logic system VL."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1398681259"
                        ],
                        "name": "F. Hayes-Roth",
                        "slug": "F.-Hayes-Roth",
                        "structuredName": {
                            "firstName": "Frederick",
                            "lastName": "Hayes-Roth",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Hayes-Roth"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "14828509"
                        ],
                        "name": "J. McDermott",
                        "slug": "J.-McDermott",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "McDermott",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. McDermott"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10117453,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b2d29e192269f1968b0207756f928948adf8a57a",
            "isKey": false,
            "numCitedBy": 70,
            "numCiting": 31,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : The representation of concepts and antecedent-consequent productions is discussed and a method for inducing knowledge by abstracting such representations from a sequence of training examples is described. The proposed learning method, interference matching, induces abstractions by finding relational properties common to two or more exemplars. Three tasks solved by a program which performs an interference matching algorithm are presented. Several problems concerning the relational representation of examples and the induction of knowledge by interference matching are also discussed."
            },
            "slug": "Knowledge-Acquisition-from-Structural-Descriptions-Hayes-Roth-McDermott",
            "title": {
                "fragments": [],
                "text": "Knowledge Acquisition from Structural Descriptions"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "Three tasks solved by a program which performs an interference matching algorithm are presented and several problems concerning the relational representation of examples and the induction of knowledge by interference matching are discussed."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40975594"
                        ],
                        "name": "Tom Michael Mitchell",
                        "slug": "Tom-Michael-Mitchell",
                        "structuredName": {
                            "firstName": "Tom",
                            "lastName": "Mitchell",
                            "middleNames": [
                                "Michael"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tom Michael Mitchell"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 117769980,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "107ed240fd5a94aa84d9f6297fd6e43a88008755",
            "isKey": false,
            "numCitedBy": 443,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : A method is presented for learning general descriptions of concepts from a sequence of positive and negative training instances. This method involves examining a predetermined space or language of possible concept descriptions, finding those which are consistent with the observed training instances. Rather than use heuristic search techniques to examine this concept description space, the subspace (version space) of all plausible concept descriptions is represented and updated with each training instance. This version space approach determines all concept descriptions consistent with the training instances, without backtracking to reexamine past training instances or previously rejected concept descriptions. Proofs are given for the correctness of the method for representing version spaces, and of the associated concept learning algorithm, for any countably infinite concept description language. Empirical results obtained from computer implementations in two domains are presented. The version space approach has been implemented as one component of the Meta-DENDRAL program for learning production rules in the domain of chemical spectroscopy. Its implementation in this program is described in detail."
            },
            "slug": "Version-spaces:-an-approach-to-concept-learning.-Mitchell",
            "title": {
                "fragments": [],
                "text": "Version spaces: an approach to concept learning."
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "The version space approach has been implemented as one component of the Meta-DENDRAL program for learning production rules in the domain of chemical spectroscopy and proofs are given for the correctness of the method for representing version spaces, and of the associated concept learning algorithm, for any countably infinite concept description language."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144657113"
                        ],
                        "name": "J. Larson",
                        "slug": "J.-Larson",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Larson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Larson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2421006"
                        ],
                        "name": "R. Michalski",
                        "slug": "R.-Michalski",
                        "structuredName": {
                            "firstName": "Ryszard",
                            "lastName": "Michalski",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Michalski"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 16225988,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "794bb26502578744ddf4d276c787d734300aa109",
            "isKey": false,
            "numCitedBy": 124,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "The problem considered is a transformation of a set of user given decision rules into a set of new rules which are more general than the original ones and more optimal with regard to a user defined criterion. The decision rules are expressed in the VL21 logic system which permits a more general rule format than typically used, and facilitates a compact and easy to understand expression of descriptions of different degrees of generality. The paper gives a brief descriFtion of methodology for rule induction and of a computer program."
            },
            "slug": "Inductive-inference-of-VL-decision-rules-Larson-Michalski",
            "title": {
                "fragments": [],
                "text": "Inductive inference of VL decision rules"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "The paper gives a brief descriFtion of methodology for rule induction and of a computer program which permits a more general rule format than typically used, and facilitates a compact and easy to understand expression of descriptions of different degrees of generality."
            },
            "venue": {
                "fragments": [],
                "text": "SGAR"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1398681259"
                        ],
                        "name": "F. Hayes-Roth",
                        "slug": "F.-Hayes-Roth",
                        "structuredName": {
                            "firstName": "Frederick",
                            "lastName": "Hayes-Roth",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Hayes-Roth"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69854184"
                        ],
                        "name": "David J. Mostow",
                        "slug": "David-J.-Mostow",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Mostow",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "David J. Mostow"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 38672826,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "852ab613cdc922ee86c695211df9e951577d0879",
            "isKey": false,
            "numCitedBy": 8,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : This collection of four papers presents many of the major findings in the authors research related to the representation, recognition, and learning of structured patterns. The first paper presents an introduction to the problems of representation and recognition of structured patterns and suggests several directions for further research. One of these suggestions concerns a distributed processing network for pattern recognition. In the second paper (co-authored by D. J. Mostow), such a network is developed for use as a syntax system for speech understanding. The last two papers are concerned specifically with the learning problems encountered in the framework of structured patterns."
            },
            "slug": "Collected-papers-on-the-learning-and-recognition-of-Hayes-Roth-Mostow",
            "title": {
                "fragments": [],
                "text": "Collected papers on the learning and recognition of structured patterns"
            },
            "tldr": {
                "abstractSimilarityScore": 52,
                "text": "A distributed processing network for pattern recognition is developed for use as a syntax system for speech understanding and an introduction to the problems of representation and recognition of structured patterns is presented."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1398681259"
                        ],
                        "name": "F. Hayes-Roth",
                        "slug": "F.-Hayes-Roth",
                        "structuredName": {
                            "firstName": "Frederick",
                            "lastName": "Hayes-Roth",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Hayes-Roth"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "14828509"
                        ],
                        "name": "J. McDermott",
                        "slug": "J.-McDermott",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "McDermott",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. McDermott"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 14868105,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8303e62b9bdbbef1bc207059e208b9597401a439",
            "isKey": false,
            "numCitedBy": 142,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "A method for inducing knowledge by abstraction from a sequence of training examples is described. The proposed method, interference matching, induces abstractions by finding relational properties common to two or more exemplars. Three tasks solved by a program that uses an interference-matching algorithm are presented. Several problems concerning the description of the training examples and the adequacy of interference matching are discussed, and directions for future research are considered."
            },
            "slug": "An-interference-matching-technique-for-inducing-Hayes-Roth-McDermott",
            "title": {
                "fragments": [],
                "text": "An interference matching technique for inducing abstractions"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "Three tasks solved by a program that uses an interference-matching algorithm are presented, and several problems concerning the description of the training examples and the adequacy of interference matching are discussed."
            },
            "venue": {
                "fragments": [],
                "text": "CACM"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2421006"
                        ],
                        "name": "R. Michalski",
                        "slug": "R.-Michalski",
                        "structuredName": {
                            "firstName": "Ryszard",
                            "lastName": "Michalski",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Michalski"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 16719183,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "dc3dcbe5b0aeea5053320ea819ac73f4af30fe3a",
            "isKey": false,
            "numCitedBy": 454,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": "The determination of pattern recognition rules is viewed as a problem of inductive inference, guided by generalization rules, which control the generalization process, and problem knowledge rules, which represent the underlying semantics relevant to the recognition problem under consideration. The paper formulates the theoretical framework and a method for inferring general and optimal (according to certain criteria) descriptions of object classes from examples of classification or partial descriptions. The language for expressing the class descriptions and the guidance rules is an extension of the first-order predicate calculus, called variable-valued logic calculus VL21. VL21 involves typed variables and contains several new operators especially suited for conducting inductive inference, such as selector, internal disjunction, internal conjunction, exception, and generalization. Important aspects of the theory include: 1) a formulation of several kinds of generalization rules; 2) an ability to uniformly and adequately handle descriptors (i.e., variables, functions, and predicates) of different type (nominal, linear, and structured) and of different arity (i.e., different number of arguments); 3) an ability to generate new descriptors, which are derived from the initial descriptors through a rule-based system (i.e., an ability to conduct the so called constructive induction); 4) an ability to use the semantics underlying the problem under consideration. An experimental computer implementation of the method is briefly described and illustrated by an example."
            },
            "slug": "Pattern-Recognition-as-Rule-Guided-Inductive-Michalski",
            "title": {
                "fragments": [],
                "text": "Pattern Recognition as Rule-Guided Inductive Inference"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The paper formulates the theoretical framework and a method for inferring general and optimal descriptions of object classes from examples of classification or partial descriptions and an experimental computer implementation of the method is briefly described and illustrated by an example."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2421006"
                        ],
                        "name": "R. Michalski",
                        "slug": "R.-Michalski",
                        "structuredName": {
                            "firstName": "Ryszard",
                            "lastName": "Michalski",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Michalski"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60917906,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5407076f77a795a638b537a08acf0b8a38afecaa",
            "isKey": false,
            "numCitedBy": 72,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Variable-Valued-Logic-and-Its-Applications-to-and-Michalski",
            "title": {
                "fragments": [],
                "text": "Variable-Valued Logic and Its Applications to Pattern Recognition and Machine Learning"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2060896"
                        ],
                        "name": "P. Winston",
                        "slug": "P.-Winston",
                        "structuredName": {
                            "firstName": "Patrick",
                            "lastName": "Winston",
                            "middleNames": [
                                "Henry"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Winston"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 106617047,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "a7eb50210a468d0878666e8f82fb55f2b179f802",
            "isKey": false,
            "numCitedBy": 1208,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Massachusetts Institute of Technology. Dept. of Electrical Engineering. Thesis. 1970. Ph.D."
            },
            "slug": "Learning-Structural-Descriptions-From-Examples-Winston",
            "title": {
                "fragments": [],
                "text": "Learning Structural Descriptions From Examples"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1970
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1740513"
                        ],
                        "name": "B. Buchanan",
                        "slug": "B.-Buchanan",
                        "structuredName": {
                            "firstName": "Bruce",
                            "lastName": "Buchanan",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Buchanan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1792280"
                        ],
                        "name": "E. Feigenbaum",
                        "slug": "E.-Feigenbaum",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Feigenbaum",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Feigenbaum"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 27158474,
            "fieldsOfStudy": [
                "Chemistry"
            ],
            "id": "403c9b2f2eb2d6ca4f9be20f8dc45726d5299396",
            "isKey": false,
            "numCitedBy": 452,
            "numCiting": 66,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Dendral-and-Meta-Dendral:-Their-Applications-Buchanan-Feigenbaum",
            "title": {
                "fragments": [],
                "text": "Dendral and Meta-Dendral: Their Applications Dimension"
            },
            "venue": {
                "fragments": [],
                "text": "Artif. Intell."
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1767123"
                        ],
                        "name": "E. Sacerdoti",
                        "slug": "E.-Sacerdoti",
                        "structuredName": {
                            "firstName": "Earl",
                            "lastName": "Sacerdoti",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Sacerdoti"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 3146858,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4e02c6d40e24192f2bf6d945bfd1a76ab29367cb",
            "isKey": false,
            "numCitedBy": 1127,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Planning-in-a-Hierarchy-of-Abstraction-Spaces-Sacerdoti",
            "title": {
                "fragments": [],
                "text": "Planning in a Hierarchy of Abstraction Spaces"
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1740513"
                        ],
                        "name": "B. Buchanan",
                        "slug": "B.-Buchanan",
                        "structuredName": {
                            "firstName": "Bruce",
                            "lastName": "Buchanan",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Buchanan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1792280"
                        ],
                        "name": "E. Feigenbaum",
                        "slug": "E.-Feigenbaum",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Feigenbaum",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Feigenbaum"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2103455"
                        ],
                        "name": "J. Lederberg",
                        "slug": "J.-Lederberg",
                        "structuredName": {
                            "firstName": "Joshua",
                            "lastName": "Lederberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Lederberg"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 19008715,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "13d797925b7cab471a7ce58db3e55e2e0bb6a928",
            "isKey": false,
            "numCitedBy": 33,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "The Meta-DENDRAL program is a vehicle for studying problems of theory formation in science. The general strategy of Meta-DENDRAL is to reason from data to plausible generalizations and then to organize the generalizations into a unified theory. Three main subprobleras are discussed: (1) explain the experimental data for each individual chemical structure, (2) generalize the results from each structure to all structures, and (3) organize the generalizations into a unified theory. The program is built upon the concepts and programmed routines already available in the Heuristic DENDRAL performance program, but goes beyond the performance program in attempting to formulate the theory which the performance program will use."
            },
            "slug": "A-Heuristic-Programming-Study-of-Theory-Formation-Buchanan-Feigenbaum",
            "title": {
                "fragments": [],
                "text": "A Heuristic Programming Study of Theory Formation in Science"
            },
            "tldr": {
                "abstractSimilarityScore": 81,
                "text": "The Meta-DENDRAL program is a vehicle for studying problems of theory formation in science to reason from data to plausible generalizations and then to organize the generalizations into a unified theory."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2760919"
                        ],
                        "name": "S. Rubin",
                        "slug": "S.-Rubin",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Rubin",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Rubin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145502114"
                        ],
                        "name": "R. Reddy",
                        "slug": "R.-Reddy",
                        "structuredName": {
                            "firstName": "Raj",
                            "lastName": "Reddy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Reddy"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11097561,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "43f347e70f9c39bf636e867dc0c0b89173f7eb35",
            "isKey": false,
            "numCitedBy": 24,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "The Locus model of search is a non-backtracking, deterministic search technique in which a beam of near-miss alternatives around the best path are extended in parallel for graph searching problems. In this paper we formulate image interpretation as a giaph searching problem and show bow the Locus model provides a near-optimal minimal effort solution. The structure of the model is illustrated using a detailed example. The relationship of the present approach to earlier attempts at image interpretation are discussed."
            },
            "slug": "The-LOCUS-Model-of-Search-and-its-Use-in-Image-Rubin-Reddy",
            "title": {
                "fragments": [],
                "text": "The LOCUS Model of Search and its Use in Image Interpretation"
            },
            "tldr": {
                "abstractSimilarityScore": 38,
                "text": "This paper formulate image interpretation as a giaph searching problem and shows bow the Locus model provides a near-optimal minimal effort solution."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2071175549"
                        ],
                        "name": "S. Vera",
                        "slug": "S.-Vera",
                        "structuredName": {
                            "firstName": "S.",
                            "lastName": "Vera",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Vera"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 31594645,
            "fieldsOfStudy": [
                "Chemistry",
                "Materials Science"
            ],
            "id": "bc0418235ad0f5c5db9944858ce989b9b75c1c52",
            "isKey": false,
            "numCitedBy": 95,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "P o s i t i v e and n e g a t i v e i ns tances of a concept are assumed to be desc r i bed by a c o n j u n c t i o n o f l i t e r a l s i n the p r e d i c a t e c a l c u l u s , w i t h terms l i m i t e d t o cons tan ts and u n i v e r s a l l y q u a n t i f i e d v a r i a b l e s . A graph r e p r e s e n t a t i o n of a con junc t i o n o f l i t e r a l s , c a l l e d a \"p roduc t g r a p h \" , i s i n t r o d u c e d . I t i s d e s i r a b l e t o merge p o s i t i v e i ns tances by g e n e r a l i z a t i o n , w h i l e m a i n t a i n i n g d i s c r i m i n a t i o n aga ins t n e g a t i v e i n s t a n c e s . Th i s is accompl ished by an i n d u c t i o n procedure which opera tes on the p roduc t graph form of these posi t i v e and n e g a t i v e i n s t a n c e s . The c o r r e c t n e s s o f the procedure i s p r o v e n , t o g e t h e r w i t h seve ra l r e l a t e d r e s u l t s o f d i r e c t p r a c t i c a l s i g n i f i c a n c e . Th is work i s d i r e c t e d t o the goal o f p r o v i d i n g a fo rma l model f o r the i n d u c t i v e processes which are observed i n a r t i f i c i a l i n t e l l i g e n c e s t u d i e s i n s p e c i a l i z e d a reas . 1 . I n t r o d u c t i o n Lnduct ion may be b r o a d l y d e f i n e d as \" r e a s o n ing f rom a p a r t to a who le , f rom p a r t i c u l a r s to g e n e r a l s , o r f rom the i n d i v i d u a l t o the u n i v e r s a l \" [ 1 0 ] . C o n s i s t e n t w i t h t h i s , w e view \" i n d u c t i o n \" as a compu ta t i ona l process, and a \" g e n e r a l i z a t i o n \" as a s tatement computed by t h a t p rocess . The p resen t work is guided by the b e l i e f t h a t genera l purpose i n d u c t i o n procedures can be f o r mulated which would be independent o f the a r t i f i c i a l i n t e l l i g e n c e prob lem domain. I t i s s p e c i f i c a l l y concerned w i t h the i n d u c t i o n o f concepts from p o s i t i v e and nega t i ve i ns tances desc r i bed in the p r e d i c a t e c a l c u l u s , w i t h terms l i m i t e d t o cons t a n t s and u n i v e r s a l l y q u a n t i f i e d v a r i a b l e s . I n d u c t i v e processes i n a r t i f i c i a l i n t e l l i gence have been s t u d i e d from s e v e r a l aspec t s : v i s u a l ana log ies [ 3 ] , p r o p o s i t i o n a l l o g i c concept l e a r n i n g [ 4 , 9 ] , ana log ies i n p r e d i c a t e c a l c u l u s theorem p r o v i n g [ S ] , IQ t e s t comp le t i on problems [ 1 1 ] , t heo ry f o r m a t i o n f rom a data base [ 2 ] , v i s u a l concept l e a r n i n g f rom examples [ 1 2 ] , and i n d u c t i o n as a dual of deduc t i ve theorem p r o v i n g i n the p r e d i c a t e c a l c u l u s [ 1 , 6 , 8 ] , o r i n a gene r a l i z i t t i o n o f t he p r e d i c a t e c a l c u l u s [ 7 ] . The p resen t work may be regarded as a cont inuance of the concept l e a r n i n g research of Hunt and Tows te r , amongs o t h e r s , t o the p r e d i c a t e c a l c u l u s . I t s v i ewpo in t and many of the concepts are d e r i v e d from P l o t k i n . Throughou t , each p o s i t i v e and nega t i ve i n stance of a concept is assumed to be desc r i bed by a c o n j u n c t i o n o f l i t e r a l s i n the p r e d i c a t e c a l c u lus (no t n e c e s s a r i l y f i r s t o r d e r ) . Sec t i on 2 def i n e s t e r m i n o l o g y to be employed, o f which the most s i g n i f i c a n t i s t h e concept o f a \"max ima l , c o n s i s t e n t , u n i f y i n g g e n e r a l i z a t i o n \" , and con ta i ns some genera l o b s e r v a t i o n s on g e n e r a l i z a t i o n s . With t h i s background, a problem statement is then given in the def ined vocabulary. Section 3 i n t r o duces the \"product graph\", a graph representat ion of a conjunct ion of l i t e r a l s , which serves as a convenient medium fo r the d iscussion of the induct i o n process. This process is accomplished by s t ra igh t fo rward operat ions on these product graphs. Section 4 considers the application of product graphs to the quest ion of the \"cons is tency\" o f a genera l i za t ion in view of negat ive i n stances. Sect ion 5 contains concluding remarks. This work was p a r t i a l l y supported by DHEW Grant No. US-PHS-R01-MB-00114-01."
            },
            "slug": "Induction-of-Concepts-in-the-Predicate-Calculus-Vera",
            "title": {
                "fragments": [],
                "text": "Induction of Concepts in the Predicate Calculus"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "The p resen t work is guided by the b e l i e f t h a t genera l purpose i n d u c t i o n procedures can be f o r mulated which would be independent o f the a r t i f i c i a l i n t e l l i g e n c e prob lem domain."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2215146"
                        ],
                        "name": "S. Vere",
                        "slug": "S.-Vere",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Vere",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Vere"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 21333220,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e8e70ff97d0e9f9bd4e2a13254deb79fe801e865",
            "isKey": false,
            "numCitedBy": 105,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Multilevel-Counterfactuals-for-Generalizations-of-Vere",
            "title": {
                "fragments": [],
                "text": "Multilevel Counterfactuals for Generalizations of Relational Concepts and Productions"
            },
            "venue": {
                "fragments": [],
                "text": "Artif. Intell."
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145622390"
                        ],
                        "name": "E. Soloway",
                        "slug": "E.-Soloway",
                        "structuredName": {
                            "firstName": "Elliot",
                            "lastName": "Soloway",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Soloway"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 59802937,
            "fieldsOfStudy": [
                "Education"
            ],
            "id": "158ed0645028a51840db050ea3a2f35ec1d91ef3",
            "isKey": false,
            "numCitedBy": 23,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Learning-=-interpretation-+-generalization:-a-case-Soloway",
            "title": {
                "fragments": [],
                "text": "Learning = interpretation + generalization: a case study in knowledge-directed learning."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1978
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Discovering rules from large collections of examples: a case study,\" Expert Systems ill lire Micro Elec/ronic"
            },
            "venue": {
                "fragments": [],
                "text": "Techni.:al Report Report HPP-79-14,"
            },
            "year": 1979
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Computer-assisted structure elucidation using automatically acquired carbon-13 NMR rules"
            },
            "venue": {
                "fragments": [],
                "text": "Computer-assisted structure elucidation using automatically acquired carbon-13 NMR rules"
            },
            "year": 1977
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Experiments ill IlIdlKtion"
            },
            "venue": {
                "fragments": [],
                "text": "Experiments ill IlIdlKtion"
            },
            "year": 1966
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 85,
                                "start": 69
                            }
                        ],
                        "text": "\" In related work on nuclear magnetic resonance (NMR), Schwenzer and Mitchell [1977] present an example in which the value of nils is li~[cd as \"greater than or equal to one\" (which indicates an internal disjunction)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "~f., \"ersion Spaces: All approach to concept learning, Ph.D"
            },
            "venue": {
                "fragments": [],
                "text": "Dccemba"
            },
            "year": 1978
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Discovering rules from large collections of examples: a case study Expert Systems ill lire Micro Elec"
            },
            "venue": {
                "fragments": [],
                "text": "Discovering rules from large collections of examples: a case study Expert Systems ill lire Micro Elec"
            },
            "year": 1979
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A critical review of Winston's learning structural descriptions from examples"
            },
            "venue": {
                "fragments": [],
                "text": "AISB Quarterly"
            },
            "year": 1978
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Inductive itiference ill the variable-valued predicate logic system VL21: methodology alld computer implemelltation"
            },
            "venue": {
                "fragments": [],
                "text": "Inductive itiference ill the variable-valued predicate logic system VL21: methodology alld computer implemelltation"
            },
            "year": 1977
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Inductive Learning of Structural Descriptions"
            },
            "venue": {
                "fragments": [],
                "text": "Artificial Intel­ ligence"
            },
            "year": 1981
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Inductive learning of relational productions Paltern-Directed Illferel"
            },
            "venue": {
                "fragments": [],
                "text": "Inductive learning of relational productions Paltern-Directed Illferel"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Learning disjunctive concepts from examples,\" Master's thesis, M.I.T., Cambridge, Mass., 1979, (also AI memo 548)"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Applications of artificial intelligence for chemical inference XXII.· Automatic rule formation in mass spectrometry by means of the Mcta-DENDRAL program"
            },
            "venue": {
                "fragments": [],
                "text": "Applications of artificial intelligence for chemical inference XXII.· Automatic rule formation in mass spectrometry by means of the Mcta-DENDRAL program"
            },
            "year": 1976
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 94,
                                "start": 0
                            }
                        ],
                        "text": "Some initial work in this area has been done by Winston [1970, 1975], Cohen and Sammut [1978), and in the area of grammatical inference in general (for example, Biermann (1972])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Multilevel counterfUl.;tuuls for generalizations of relational concepts and productions,\" Art(/icilll/lllclligt'II(,("
            },
            "venue": {
                "fragments": [],
                "text": "Vol. 14,"
            },
            "year": 1980
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Learning by being told and learning from examples: an experimental comparison of the two methods of knowledge acquisition in the context of developing an expert system for soybean disease diagnosis"
            },
            "venue": {
                "fragments": [],
                "text": "Policy Analysis alld Information SVIel1ls"
            },
            "year": 1980
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A suniey of result.~ in grammatical inference"
            },
            "venue": {
                "fragments": [],
                "text": "A suniey of result.~ in grammatical inference"
            },
            "year": 1972
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Knowledge acquisition from structural descriptions,\" Proceed­ ings of (ile Fifth {mernatiollal"
            },
            "venue": {
                "fragments": [],
                "text": "Joint Conference on Artificialllllelligellce,"
            },
            "year": 1977
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Induction of rclational productions in the presence of background informalion Pmc<'e,lillgs (If' lite FiliI! IlIlertlllliOll<l1 Joilll COl/ferellce Oil Ani/ieiol IlIIclligeJ"
            },
            "venue": {
                "fragments": [],
                "text": "Induction of rclational productions in the presence of background informalion Pmc<'e,lillgs (If' lite FiliI! IlIlertlllliOll<l1 Joilll COl/ferellce Oil Ani/ieiol IlIIclligeJ"
            },
            "year": 1977
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Inductive itiference ill the variable-valued predicate logic system VL21: methodology alld computer implemelltation"
            },
            "venue": {
                "fragments": [],
                "text": "Ph.D. dissertation,"
            },
            "year": 1977
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Learning without negative examples via variable-valued logic characterizations: the Uniclass inductive program AQ7UNI"
            },
            "venue": {
                "fragments": [],
                "text": "Learning without negative examples via variable-valued logic characterizations: the Uniclass inductive program AQ7UNI"
            },
            "year": 1975
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Learning structural dcs.:riptions froOl examples"
            },
            "venue": {
                "fragments": [],
                "text": "Tlte P.IJcllOlogy of Computer Visioll"
            },
            "year": 1970
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A not<' on inductive generalization"
            },
            "venue": {
                "fragments": [],
                "text": "A not<' on inductive generalization"
            },
            "year": 1970
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Pattern recogmllon and learning with a structural description language"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Fourth Internatiollal Joillt COllferen('e on Artificial Intelligence"
            },
            "year": 1978
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "CHAPTER 3: A COMPARATIVE REVIEW ()IETTERICH & MICHALSKI I 61"
            },
            "venue": {
                "fragments": [],
                "text": "CHAPTER 3: A COMPARATIVE REVIEW ()IETTERICH & MICHALSKI I 61"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Learning disjunctive concepts from examples Master's thesis"
            },
            "venue": {
                "fragments": [],
                "text": "M.I.T"
            },
            "year": 1979
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 2
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 43,
        "totalPages": 5
    },
    "page_url": "https://www.semanticscholar.org/paper/Machine-learning-an-artificial-intelligence-Michalski-Anderson/b6df5c2ac2f91d71b1d08d76135e2a470ac1ad1e?sort=total-citations"
}