{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7789445"
                        ],
                        "name": "J. Weickert",
                        "slug": "J.-Weickert",
                        "structuredName": {
                            "firstName": "Joachim",
                            "lastName": "Weickert",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Weickert"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1679944"
                        ],
                        "name": "C. Schnörr",
                        "slug": "C.-Schnörr",
                        "structuredName": {
                            "firstName": "Christoph",
                            "lastName": "Schnörr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Schnörr"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 8,
                                "start": 0
                            }
                        ],
                        "text": "[22, 26]), we have shown that their co mbination outperforms all methods from the literature so far."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 139,
                                "start": 124
                            }
                        ],
                        "text": "Fi ally, spatio-temporal approaches have ameliorated the results simply by using the information of an additional dimension [18, 6, 26, 10]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 1180595,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a38383dff7b3d41a64fb3fb06e01ed970fc59d95",
            "isKey": false,
            "numCitedBy": 316,
            "numCiting": 69,
            "paperAbstract": {
                "fragments": [],
                "text": "Nonquadratic variational regularization is a well-known and powerful approach for the discontinuity-preserving computation of optic flow. In the present paper, we consider an extension of flow-driven spatial smoothness terms to spatio-temporal regularizers. Our method leads to a rotationally invariant and time symmetric convex optimization problem. It has a unique minimum that can be found in a stable way by standard algorithms such as gradient descent. Since the convexity guarantees global convergence, the result does not depend on the flow initialization. Two iterative algorithms are presented that are not difficult to implement. Qualitative and quantitative results for synthetic and real-world scenes show that our spatio-temporal approach (i) improves optic flow fields significantly, (ii) smoothes out background noise efficiently, and (iii) preserves true motion boundaries. The computational costs are only 50% higher than for a pure spatial approach applied to all subsequent image pairs of the sequence."
            },
            "slug": "Variational-Optic-Flow-Computation-with-a-Weickert-Schnörr",
            "title": {
                "fragments": [],
                "text": "Variational Optic Flow Computation with a Spatio-Temporal Smoothness Constraint"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "Qualitative and quantitative results show that the spatio-temporal approach leads to a rotationally invariant and time symmetric convex optimization problem and has a unique minimum that can be found in a stable way by standard algorithms such as gradient descent."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of Mathematical Imaging and Vision"
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145865631"
                        ],
                        "name": "L. Álvarez",
                        "slug": "L.-Álvarez",
                        "structuredName": {
                            "firstName": "Luis",
                            "lastName": "Álvarez",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Álvarez"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7789445"
                        ],
                        "name": "J. Weickert",
                        "slug": "J.-Weickert",
                        "structuredName": {
                            "firstName": "Joachim",
                            "lastName": "Weickert",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Weickert"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143757530"
                        ],
                        "name": "Javier Sánchez Pérez",
                        "slug": "Javier-Sánchez-Pérez",
                        "structuredName": {
                            "firstName": "Javier",
                            "lastName": "Pérez",
                            "middleNames": [
                                "Sánchez"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Javier Sánchez Pérez"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 14,
                                "start": 7
                            }
                        ],
                        "text": "models [19, 2] have been used to tackle large displacements."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 206,
                                "start": 188
                            }
                        ],
                        "text": "In order to handle discont inuities in the flow field, the quadratic regulariser in the Horn and Schunck model was r eplaced by smoothness constraints that permit piecewise smooth results [1, 9, 19, 2 , 25]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 131,
                                "start": 124
                            }
                        ],
                        "text": "A second strategy to deal with large displacements has been t he usage of the nonlinearised grey value constancy assumption [19, 2]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 166,
                                "start": 159
                            }
                        ],
                        "text": "It is further shown that a coarse-to-fine strategy using the socalled warping technique [7, 16], implements the non-linearised optical flow constraint used in [19, 2] and in image registration."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 18560227,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8e06ea3d5c3047aa41eebd2b6e2d265c4b87e057",
            "isKey": false,
            "numCitedBy": 351,
            "numCiting": 97,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper we show that a classic optical flow technique by Nagel and Enkelmann (1986, IEEE Trans. Pattern Anal. Mach. Intell., Vol. 8, pp. 565–593) can be regarded as an early anisotropic diffusion method with a diffusion tensor. We introduce three improvements into the model formulation that (i) avoid inconsistencies caused by centering the brightness term and the smoothness term in different images, (ii) use a linear scale-space focusing strategy from coarse to fine scales for avoiding convergence to physically irrelevant local minima, and (iii) create an energy functional that is invariant under linear brightness changes. Applying a gradient descent method to the resulting energy functional leads to a system of diffusion–reaction equations. We prove that this system has a unique solution under realistic assumptions on the initial data, and we present an efficient linear implicit numerical scheme in detail. Our method creates flow fields with 100 % density over the entire image domain, it is robust under a large range of parameter variations, and it can recover displacement fields that are far beyond the typical one-pixel limits which are characteristic for many differential methods for determining optical flow. We show that it performs better than the optical flow methods with 100 % density that are evaluated by Barron et al. (1994, Int. J. Comput. Vision, Vol. 12, pp. 43–47). Our software is available from the Internet."
            },
            "slug": "Reliable-Estimation-of-Dense-Optical-Flow-Fields-Álvarez-Weickert",
            "title": {
                "fragments": [],
                "text": "Reliable Estimation of Dense Optical Flow Fields with Large Displacements"
            },
            "tldr": {
                "abstractSimilarityScore": 81,
                "text": "This paper shows that a classic optical flow technique by Nagel and Enkelmann can be regarded as an early anisotropic diffusion method with a diffusion tensor, and introduces three improvements into the model formulation that avoid inconsistencies caused by centering the brightness term and the smoothness term in different images."
            },
            "venue": {
                "fragments": [],
                "text": "International Journal of Computer Vision"
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7789445"
                        ],
                        "name": "J. Weickert",
                        "slug": "J.-Weickert",
                        "structuredName": {
                            "firstName": "Joachim",
                            "lastName": "Weickert",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Weickert"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1679944"
                        ],
                        "name": "C. Schnörr",
                        "slug": "C.-Schnörr",
                        "structuredName": {
                            "firstName": "Christoph",
                            "lastName": "Schnörr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Schnörr"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 204,
                                "start": 186
                            }
                        ],
                        "text": "In order to handle discontinuities in the flow field, the quadratic regulariser in the Horn and Schunck model was replaced by smoothness constraints that permit piecewise smooth results [1, 9, 19, 21, 25]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 18998684,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "b9065f8b59f6c254d29f7a48afb0c4d15e5db28b",
            "isKey": false,
            "numCitedBy": 343,
            "numCiting": 78,
            "paperAbstract": {
                "fragments": [],
                "text": "Many differential methods for the recovery of the optic flow field from an image sequence can be expressed in terms of a variational problem where the optic flow minimizes some energy. Typically, these energy functionals consist of two terms: a data term, which requires e.g. that a brightness constancy assumption holds, and a regularizer that encourages global or piecewise smoothness of the flow field. In this paper we present a systematic classification of rotation invariant convex regularizers by exploring their connection to diffusion filters for multichannel images. This taxonomy provides a unifying framework for data-driven and flow-driven, isotropic and anisotropic, as well as spatial and spatio-temporal regularizers. While some of these techniques are classic methods from the literature, others are derived here for the first time. We prove that all these methods are well-posed: they posses a unique solution that depends in a continuous way on the initial data. An interesting structural relation between isotropic and anisotropic flow-driven regularizers is identified, and a design criterion is proposed for constructing anisotropic flow-driven regularizers in a simple and direct way from isotropic ones. Its use is illustrated by several examples."
            },
            "slug": "A-Theoretical-Framework-for-Convex-Regularizers-in-Weickert-Schnörr",
            "title": {
                "fragments": [],
                "text": "A Theoretical Framework for Convex Regularizers in PDE-Based Computation of Image Motion"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "This taxonomy provides a unifying framework for data-driven and flow-driven, isotropic and anisotropic, as well as spatial and spatio-temporal regularizers, and proves that all these methods are well-posed."
            },
            "venue": {
                "fragments": [],
                "text": "International Journal of Computer Vision"
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1702017"
                        ],
                        "name": "R. Deriche",
                        "slug": "R.-Deriche",
                        "structuredName": {
                            "firstName": "Rachid",
                            "lastName": "Deriche",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Deriche"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2796589"
                        ],
                        "name": "P. Kornprobst",
                        "slug": "P.-Kornprobst",
                        "structuredName": {
                            "firstName": "Pierre",
                            "lastName": "Kornprobst",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Kornprobst"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31641158"
                        ],
                        "name": "G. Aubert",
                        "slug": "G.-Aubert",
                        "structuredName": {
                            "firstName": "Gilles",
                            "lastName": "Aubert",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Aubert"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 206,
                                "start": 188
                            }
                        ],
                        "text": "In order to handle discont inuities in the flow field, the quadratic regulariser in the Horn and Schunck model was r eplaced by smoothness constraints that permit piecewise smooth results [1, 9, 19, 2 , 25]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 8927135,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "53d8ae0d8a7c17dec38d42b5846693b7f2567d45",
            "isKey": false,
            "numCitedBy": 149,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes a variational approach devised for the purpose of estimating optical flow from a sequence of images with the constraint to preserve the flow discontinuities. This problem is set as a regularization and minimization of a non quadratic functional. The Tikhonov quadratic regularization term usually used to recover smooth solution is replaced by a particular function of the gradient flow specifically derived to allow flow discontinuities formation in the solution. Conditions to be fulfilled by this specific regularizing term, to preserve discontinuities and insure stability of the regularization problem, are also derived. To minimize this non quadratic functional, two different methods have been investigated. The first one is an iterative scheme to solve the associated non-linear Euler-Lagrange equations. The second solution introduces dual variables so that the minimization problem becomes a quadratic or a convex functional minimization problem. Promising experimental results on synthetic and real image sequences will illustrate the capabilities of this approach."
            },
            "slug": "Optical-Flow-Estimation-while-Preserving-Its-A-Deriche-Kornprobst",
            "title": {
                "fragments": [],
                "text": "Optical-Flow Estimation while Preserving Its Discontinuities: A Variational Approach"
            },
            "tldr": {
                "abstractSimilarityScore": 94,
                "text": "This paper describes a variational approach devised for the purpose of estimating optical flow from a sequence of images with the constraint to preserve the flow discontinuities, set as a regularization and minimization of a non quadratic functional."
            },
            "venue": {
                "fragments": [],
                "text": "ACCV"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3248618"
                        ],
                        "name": "M. Lefébure",
                        "slug": "M.-Lefébure",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Lefébure",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Lefébure"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144049705"
                        ],
                        "name": "L. Cohen",
                        "slug": "L.-Cohen",
                        "structuredName": {
                            "firstName": "Laurent",
                            "lastName": "Cohen",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Cohen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16100181,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "c75ff5f65be2bf412d5f0eb82b72a856fe1b50a4",
            "isKey": false,
            "numCitedBy": 61,
            "numCiting": 49,
            "paperAbstract": {
                "fragments": [],
                "text": "We address the theoretical problems of optical flow estimation and image registration in a multi-scale framework in any dimension. Much work has been done based on the minimization of a distance between a first image and a second image after applying deformation or motion field. Usually no justification is given about convergence of the algorithm used. We start by showing, in the translation case, that convergence to the global minimum is made easier by applying a low pass filter to the images hence making the energy “convex enough”. In order to keep convergence to the global minimum in the general case, we introduce a local rigidity hypothesis on the unknown deformation. We then deduce a new natural motion constraint equation (MCE) at each scale using the Dirichlet low pass operator. This transforms the problem to solving the energy minimization in a finite dimensional subspace of approximation obtained through Fourier Decomposition. This allows us to derive sufficient conditions for convergence of a new multi-scale and iterative motion estimation/registration scheme towards a global minimum of the usual nonlinear energy instead of a local minimum as did all previous methods. Although some of the sufficient conditions cannot always be fulfilled because of the absence of the necessary a priori knowledge on the motion, we use an implicit approach. We illustrate our method by showing results on synthetic and real examples in dimension 1 (signal matching, Stereo) and 2 (Motion, Registration, Morphing), including large deformation experiments."
            },
            "slug": "Image-Registration,-Optical-Flow-and-Local-Rigidity-Lefébure-Cohen",
            "title": {
                "fragments": [],
                "text": "Image Registration, Optical Flow and Local Rigidity"
            },
            "tldr": {
                "abstractSimilarityScore": 65,
                "text": "This work addresses the theoretical problems of optical flow estimation and image registration in a multi-scale framework in any dimension by introducing a local rigidity hypothesis on the unknown deformation and deduce a new natural motion constraint equation (MCE) at each scale using the Dirichlet low pass operator."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of Mathematical Imaging and Vision"
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2105795"
                        ],
                        "name": "Michael J. Black",
                        "slug": "Michael-J.-Black",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Black",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michael J. Black"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145981906"
                        ],
                        "name": "P. Anandan",
                        "slug": "P.-Anandan",
                        "structuredName": {
                            "firstName": "P.",
                            "lastName": "Anandan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Anandan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 36,
                                "start": 26
                            }
                        ],
                        "text": "Coarse-to-fine strategies [3, 7, 16] as well as non-linearised models [19, 2] have been used to tackle large displacements."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 96,
                                "start": 89
                            }
                        ],
                        "text": "It is further shown that a coarse-to-fine strategy using the so-called warping technique [7, 16], implements the non-linearised optical flow constraint used in [19, 2] and in image registration."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 169,
                                "start": 162
                            }
                        ],
                        "text": "Since with quadratic penalisers, outliers get too much influence on the estimation, an increasing concave function Ψ(s(2)) is applied, leading to a robust energy [7, 16]:"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 123,
                                "start": 113
                            }
                        ],
                        "text": "Coarse-to-fine warping techniques are a frequently used tool for improving the performance of optic flow methods [3, 7, 17]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 223,
                                "start": 217
                            }
                        ],
                        "text": "Some of these ideas are close in spirit to methods for joint motion estimation and motion segmentation [10, 17], and to optical flow methods motivated from robust statistics where outliers are penalised less severely [6, 7]."
                    },
                    "intents": []
                }
            ],
            "corpusId": 14070356,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "eee90c038f43370a29b07e46f38dfe6527143a2c",
            "isKey": true,
            "numCitedBy": 1786,
            "numCiting": 86,
            "paperAbstract": {
                "fragments": [],
                "text": "Most approaches for estimating optical flow assume that, within a finite image region, only a single motion is present. Thissingle motion assumptionis violated in common situations involving transparency, depth discontinuities, independently moving objects, shadows, and specular reflections. To robustly estimate optical flow, the single motion assumption must be relaxed. This paper presents a framework based onrobust estimationthat addresses violations of the brightness constancy and spatial smoothness assumptions caused by multiple motions. We show how therobust estimation frameworkcan be applied to standard formulations of the optical flow problem thus reducing their sensitivity to violations of their underlying assumptions. The approach has been applied to three standard techniques for recovering optical flow: area-based regression, correlation, and regularization with motion discontinuities. This paper focuses on the recovery of multiple parametric motion models within a region, as well as the recovery of piecewise-smooth flow fields, and provides examples with natural and synthetic image sequences."
            },
            "slug": "The-Robust-Estimation-of-Multiple-Motions:-and-Flow-Black-Anandan",
            "title": {
                "fragments": [],
                "text": "The Robust Estimation of Multiple Motions: Parametric and Piecewise-Smooth Flow Fields"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "A framework based on robust estimation is presented that addresses violations of the brightness constancy and spatial smoothness assumptions caused by multiple motions of optical flow, and is applied to standard formulations of the optical flow problem thus reducing their sensitivity to violations of their underlying assumptions."
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Vis. Image Underst."
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1696527"
                        ],
                        "name": "S. Lai",
                        "slug": "S.-Lai",
                        "structuredName": {
                            "firstName": "Shang-Hong",
                            "lastName": "Lai",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Lai"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1733005"
                        ],
                        "name": "B. Vemuri",
                        "slug": "B.-Vemuri",
                        "structuredName": {
                            "firstName": "Baba",
                            "lastName": "Vemuri",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Vemuri"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10447863,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b1007d0467e34a3e3b7607138392166b9d937465",
            "isKey": false,
            "numCitedBy": 85,
            "numCiting": 30,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper, we present two very efficient and accurate algorithms for computing optical flow. The first is a modified gradient-based regularization method, and the other is an SSD-based regularization method. For the gradient-based method, to amend the errors in the discrete image flow equation caused by numerical differentiation as well as temporal and spatial aliasing in the brightness function, we propose to selectively combine the image flow constraint and a contour-based flow constraint into the data constraint by using a reliability measure. Each data constraint is appropriately normalized to obtain an approximate minimum distance (of the data point to the linear flow equation) constraint instead of the conventional linear flow constraint. These modifications lead to robust and accurate optical flow estimation. We propose an incomplete Cholesky preconditioned conjugate gradient algorithm to solve the resulting large and sparse linear system efficiently. Our SSD-based regularization method uses a normalized SSD measure (based on a similar reasoning as in the gradient-based scheme) as the data constraint in a regularization framework. The nonlinear conjugate gradient algorithm in conjunction with an incomplete Cholesky preconditioning is developed to solve the resulting nonlinear minimization problem. Experimental results on synthetic and real image sequences for these two algorithms are given to demonstrate their performance in comparison with competing methods reported in literature."
            },
            "slug": "Reliable-and-Efficient-Computation-of-Optical-Flow-Lai-Vemuri",
            "title": {
                "fragments": [],
                "text": "Reliable and Efficient Computation of Optical Flow"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The nonlinear conjugate gradient algorithm in conjunction with an incomplete Cholesky preconditioning is developed to solve the resulting nonlinear minimization problem."
            },
            "venue": {
                "fragments": [],
                "text": "International Journal of Computer Vision"
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1917469"
                        ],
                        "name": "Shanon X. Ju",
                        "slug": "Shanon-X.-Ju",
                        "structuredName": {
                            "firstName": "Shanon",
                            "lastName": "Ju",
                            "middleNames": [
                                "X."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Shanon X. Ju"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2105795"
                        ],
                        "name": "Michael J. Black",
                        "slug": "Michael-J.-Black",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Black",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michael J. Black"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723930"
                        ],
                        "name": "A. Jepson",
                        "slug": "A.-Jepson",
                        "structuredName": {
                            "firstName": "Allan",
                            "lastName": "Jepson",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Jepson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7771830,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "69b22ec0935d6996470a369cbd54e53548e6e2f5",
            "isKey": false,
            "numCitedBy": 176,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes a new method for estimating optical flow that strikes a balance between the flexibility of local dense computations and the robustness and accuracy of global parameterized flow models. An affine model of image motion is used within local image patches while a spatial smoothness constraint on the affine flow parameters of neighboring patches enforces continuity of the motion. We refer to this as a \"Skin and Bones\" model in which the affine patches can be thought of as rigid \"bones\" connected by a flexible \"skin\". Since local image patches may contain multiple motions we use a layered representation for the affine bones. To regularize this layered motion representation we develop a new framework for regularization with transparency."
            },
            "slug": "Skin-and-bones:-multi-layer,-locally-affine,-flow-Ju-Black",
            "title": {
                "fragments": [],
                "text": "Skin and bones: multi-layer, locally affine, optical flow and regularization with transparency"
            },
            "tldr": {
                "abstractSimilarityScore": 89,
                "text": "A new method for estimating optical flow that strikes a balance between the flexibility of local dense computations and the robustness and accuracy of global parameterized flow models is described."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings CVPR IEEE Computer Society Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32004103"
                        ],
                        "name": "S. Uras",
                        "slug": "S.-Uras",
                        "structuredName": {
                            "firstName": "Sergio",
                            "lastName": "Uras",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Uras"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1804489"
                        ],
                        "name": "F. Girosi",
                        "slug": "F.-Girosi",
                        "structuredName": {
                            "firstName": "Federico",
                            "lastName": "Girosi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Girosi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1716824"
                        ],
                        "name": "A. Verri",
                        "slug": "A.-Verri",
                        "structuredName": {
                            "firstName": "Alessandro",
                            "lastName": "Verri",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Verri"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145730992"
                        ],
                        "name": "V. Torre",
                        "slug": "V.-Torre",
                        "structuredName": {
                            "firstName": "Vincent",
                            "lastName": "Torre",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Torre"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 73,
                                "start": 65
                            }
                        ],
                        "text": "While gradient co nstancy assumptions have also been proposed in [23, 22] in order to deal with the apertu r problem in the scope of a local approach, their use within variational methods is novel."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 125,
                                "start": 121
                            }
                        ],
                        "text": "Such a criterion is the gradient of the image grey va lue, which can also be assumed not to vary due to the displacement [23]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 44399520,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "2cb72b036d11c13ea07ce95a9b946b4d88d26ea5",
            "isKey": false,
            "numCitedBy": 245,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper it is shown that the computation of the optical flow from a sequence of timevarying images is not, in general, an underconstrained problem. A local algorithm for the computation of the optical flow which uses second order derivatives of the image brightness pattern, and that avoids the aperture problem, is presented. The obtained optical flow is very similar to the true motion field — which is the vector field associated with moving features on the image plane — and can be used to recover 3D motion information. Experimental results on sequences of real images, together with estimates of relevant motion parameters, like time-to-crash for translation and angular velocity for rotation, are presented and discussed. Due to the remarkable accuracy which can be achieved in estimating motion parameters, the proposed method is likely to be very useful in a number of computer vision applications."
            },
            "slug": "A-computational-approach-to-motion-perception-Uras-Girosi",
            "title": {
                "fragments": [],
                "text": "A computational approach to motion perception"
            },
            "venue": {
                "fragments": [],
                "text": "Biological Cybernetics"
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144721252"
                        ],
                        "name": "H. Nagel",
                        "slug": "H.-Nagel",
                        "structuredName": {
                            "firstName": "Hans-Hellmut",
                            "lastName": "Nagel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Nagel"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 139,
                                "start": 124
                            }
                        ],
                        "text": "Fi ally, spatio-temporal approaches have ameliorated the results simply by using the information of an additional dimension [18, 6, 26, 10]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 34423582,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "e61e2fe16e89a443431782e84e6f61b870b5249e",
            "isKey": false,
            "numCitedBy": 113,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "Recent experimental results by Schnorr 89 with an approach based on a simplified ‘oriented smoothness constraint’ show considerable improvement at expected discontinuities of the optical flow field. It thus appears justified to study whether the local gray value variation can be exploited in the temporal as well as in the spatial domain in order to achieve further improvements at discontinuities in the optical flow field associated with the image areas of moving objects in image sequences. An extension of the oriented smoothness constraint into the temporal domain is presented. In this context, a local estimation approach for the spatio-temporal partial derivatives of optical flow has been developed. This, in turn, is used to compare two approaches for the definition of optical flow."
            },
            "slug": "Extending-the-'Oriented-Smoothness-Constraint'-into-Nagel",
            "title": {
                "fragments": [],
                "text": "Extending the 'Oriented Smoothness Constraint' into the Temporal Domain and the Estimation of Derivatives of Optical Flow"
            },
            "tldr": {
                "abstractSimilarityScore": 49,
                "text": "Whether the local gray value variation can be exploited in the temporal as well as in the spatial domain in order to achieve further improvements at discontinuities in the optical flow field associated with the image areas of moving objects in image sequences is studied."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144422657"
                        ],
                        "name": "I. Cohen",
                        "slug": "I.-Cohen",
                        "structuredName": {
                            "firstName": "Isaac",
                            "lastName": "Cohen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Cohen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 76,
                                "start": 69
                            }
                        ],
                        "text": "This is achieved by penalising the total variation of the flow field [20, 8], which can be expressed as"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 16315199,
            "fieldsOfStudy": [
                "Mathematics",
                "Physics"
            ],
            "id": "b559ff9a3863a80a5c08c8c8cbfc23ecb2cb606f",
            "isKey": false,
            "numCitedBy": 87,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a new method for optical flow computation based on the minimization of a non-quadratic functional. The solution of the obtained nonlinear differential equations is done with a time dependent approach leading to the successive solutions of linear systems. This new method allows to compute optical flow fields while insuring a unique solution and preserving the flow discontinuities. This method seems to be more appropriate since it does not enforce the optical flow to be smooth in the boundaries of moving objects and reconstruct the optical flow discontinuities without any specific processing of these points. We have applied the model on synthetical and real image sequences which illustrate the properties of this approach. Finally we give an interesting application which merges optical flow field and snake models for boundaries tracking."
            },
            "slug": "Nonlinear-Variational-Method-for-Optical-Flow-Cohen",
            "title": {
                "fragments": [],
                "text": "Nonlinear Variational Method for Optical Flow Computation"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2006
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143814637"
                        ],
                        "name": "Berthold K. P. Horn",
                        "slug": "Berthold-K.-P.-Horn",
                        "structuredName": {
                            "firstName": "Berthold",
                            "lastName": "Horn",
                            "middleNames": [
                                "K.",
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Berthold K. P. Horn"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1717435"
                        ],
                        "name": "B. G. Schunck",
                        "slug": "B.-G.-Schunck",
                        "structuredName": {
                            "firstName": "Brian",
                            "lastName": "Schunck",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. G. Schunck"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 62,
                                "start": 58
                            }
                        ],
                        "text": "Starting from the original approaches of Horn and Schunck [11] as well as Lucas and Kanade [15], research developed many new concepts for dealing with shortcomings of previous models."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 39,
                                "start": 35
                            }
                        ],
                        "text": "the famous optical flow constraint [11]"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 103,
                                "start": 87
                            }
                        ],
                        "text": "In order to handle discontinuities in the flow field, the quadratic regulariser in the Horn and Schunck model was replaced by smoothness constraints that permit piecewise smooth results [1,9,19,21,25]."
                    },
                    "intents": []
                }
            ],
            "corpusId": 1371968,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "a3229dc33ecb80c59a75b906c46b586dd059b781",
            "isKey": false,
            "numCitedBy": 11343,
            "numCiting": 54,
            "paperAbstract": {
                "fragments": [],
                "text": "Optical flow cannot be computed locally, since only one independent measurement is available from the image sequence at a point, while the flow velocity has two components. A second constraint is needed. A method for finding the optical flow pattern is presented which assumes that the apparent velocity of the brightness pattern varies smoothly almost everywhere in the image. An iterative implementation is shown which successfully computes the optical flow for a number of synthetic image sequences. The algorithm is robust in that it can handle image sequences that are quantized rather coarsely in space and time. It is also insensitive to quantization of brightness levels and additive noise. Examples are included where the assumption of smoothness is violated at singular points or along lines in the image."
            },
            "slug": "Determining-Optical-Flow-Horn-Schunck",
            "title": {
                "fragments": [],
                "text": "Determining Optical Flow"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "An iterative implementation is shown which successfully computes the optical flow for a number of synthetic image sequences and is robust in that it can handle image sequences that are quantified rather coarsely in space and time."
            },
            "venue": {
                "fragments": [],
                "text": "Other Conferences"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145865631"
                        ],
                        "name": "L. Álvarez",
                        "slug": "L.-Álvarez",
                        "structuredName": {
                            "firstName": "Luis",
                            "lastName": "Álvarez",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Álvarez"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143757530"
                        ],
                        "name": "Javier Sánchez Pérez",
                        "slug": "Javier-Sánchez-Pérez",
                        "structuredName": {
                            "firstName": "Javier",
                            "lastName": "Pérez",
                            "middleNames": [
                                "Sánchez"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Javier Sánchez Pérez"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3248618"
                        ],
                        "name": "M. Lefébure",
                        "slug": "M.-Lefébure",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Lefébure",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Lefébure"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143780668"
                        ],
                        "name": "J. Monreal",
                        "slug": "J.-Monreal",
                        "structuredName": {
                            "firstName": "Julio",
                            "lastName": "Monreal",
                            "middleNames": [
                                "Esclarín"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Monreal"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8600252,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f2cd2ac033327ed402ac8ad56d6880b36ab30d3a",
            "isKey": false,
            "numCitedBy": 109,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper we present a new model for optical ow calculation using a variational formulation which preserves discontinuities of the ow much better than classical methods We study the Euler Lagrange equations asociated to the variational problem In the case of quadratic energy we show the existence and uniqueness of the corresponding evolution problem Since our method avoid linearization in the optical ow constraint it can recover large displacement in the scene We avoid convergence to irrelevant local minima by embedding our method into a linear scale space framework and using a focusing strategy from coarse to ne scales Introduction Optical Flow computation is a key problem in arti cial vision It consists of nding the motion of objects in a sequence of images We shall consider images I x y and I x y de ned on IR to simplify the discussion which represent consecutive views in a sequence of images Determining the optical ow is then nding a function h x y u x y v x y such that I x y I x u x y y v x y x y IR In general this problem has an in nite number of solutions Take for example a sequence representing a black disk moving on a white background In this case any function x y h x y associating a point of the black disk in the rst image to a point on the black disk in the second image and a point of the background in the rst image to another point on the background in the second image satis es the last equality for all points x y Notice that we only best can compute the apparent motion i e the motion in the direction normal to the disk boundary The possible circular motion a rotation leaves the disk unchanged is totally undetectable To compute h x y the preceeding equality is usually linearized yielding the so called optical ow constraint I x I x hrI x h x i x y IR where x x y If at each point we suppose that the motion is only in the perpen dicular direction to the level line passing through this point i e h x k x rI x then we deduce from last equation that when hrI x rI x i then k x I x I x hrI x rI x i Unfortunately this last equality is too local and allows only for estimating motions of the order of one pixel Indeed in images sequences objects move with a priori unpredictable velocities and thus there can be an important displacement of the objects between two consecutive images In order to estimate these large displacements it is necessary to introduce a scale factor for the fusion of information before computing the ow h x A common way of doing this is to convolve both images with a gaussian kernel G x where is the standard deviation before computing the motion In other words we study equation G I I x hr G I x h x i x y R Notice that this model does not impose any regularity condition on the solution h x In this work we propose a new model for computing h x via the minimum of the following energy functional"
            },
            "slug": "A-PDE-model-for-computing-the-optimal-flow-Álvarez-Pérez",
            "title": {
                "fragments": [],
                "text": "A PDE model for computing the optimal flow"
            },
            "tldr": {
                "abstractSimilarityScore": 77,
                "text": "A new model for optical ow calculation is presented using a variational formulation which preserves discontinuities of the ow much better than classical methods and imposes any regularity condition on the solution h x."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2105795"
                        ],
                        "name": "Michael J. Black",
                        "slug": "Michael-J.-Black",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Black",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michael J. Black"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145981906"
                        ],
                        "name": "P. Anandan",
                        "slug": "P.-Anandan",
                        "structuredName": {
                            "firstName": "P.",
                            "lastName": "Anandan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Anandan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 225,
                                "start": 219
                            }
                        ],
                        "text": "Some of these ideas are close in spirit to methods for joint motion estimation an d motion segmentation [10, 17], and to optical flow methods motivated from robust statis tics where outliers are penalised less severely [6, 7]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 139,
                                "start": 124
                            }
                        ],
                        "text": "Fi ally, spatio-temporal approaches have ameliorated the results simply by using the information of an additional dimension [18, 6, 26, 10]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 15551602,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f5b4091691a32076c78a0f354994977230f95c23",
            "isKey": false,
            "numCitedBy": 287,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "A novel approach to incrementally estimating visual motion over a sequence of images is presented. The authors start by formulating constraints on image motion to account for the possibility of multiple motions. This is achieved by exploiting the notions of weak continuity and robust statistics in the formulation of a minimization problem. The resulting objective function is non-convex. Traditional stochastic relaxation techniques for minimizing such functions prove inappropriate for the task. A highly parallel incremental stochastic minimization algorithm is presented which has a number of advantages over previous approaches. The incremental nature of the scheme makes it dynamic and permits the detection of occlusion and disocclusion boundaries.<<ETX>>"
            },
            "slug": "Robust-dynamic-motion-estimation-over-time-Black-Anandan",
            "title": {
                "fragments": [],
                "text": "Robust dynamic motion estimation over time"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "A highly parallel incremental stochastic minimization algorithm is presented which has a number of advantages over previous approaches and the incremental nature of the scheme makes it dynamic and permits the detection of occlusion and disocclusion boundaries."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings. 1991 IEEE Computer Society Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49843309"
                        ],
                        "name": "É. Mémin",
                        "slug": "É.-Mémin",
                        "structuredName": {
                            "firstName": "Étienne",
                            "lastName": "Mémin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "É. Mémin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144565371"
                        ],
                        "name": "P. Pérez",
                        "slug": "P.-Pérez",
                        "structuredName": {
                            "firstName": "Patrick",
                            "lastName": "Pérez",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Pérez"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 95,
                                "start": 89
                            }
                        ],
                        "text": "It is further shown that a coarse-to-fine strategy using the so-called warping technique [7,16], implements the non-linearised optical flow constraint used in [19,2] and in image registration."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 166,
                                "start": 160
                            }
                        ],
                        "text": "Since with quadratic penalisers, outliers get too much influence on the estimation, an increasing concave function Ψ(s2) is applied, leading to a robust energy [7,16]:"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 34,
                                "start": 26
                            }
                        ],
                        "text": "Coarse-to-fine strategies [3,7,16] as well as non-linearised models [19,2] have been used to tackle large displacements."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 18535667,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9397849684e88ec6e75b0a552635d3fdda7bd52f",
            "isKey": true,
            "numCitedBy": 134,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper focuses on the estimation of the apparent motion field between two consecutive frames in an image sequence. The approach developed here is a tradeoff between methods based on global parameterized flow models and local dense optic flow estimators. The method relies on an adaptive multigrid minimization approach. In addition to accelerated convergence toward good estimates, it allows to mix different parameterizations of the estimate relative to adaptive partitions of the image. The performances of the resulting algorithms are demonstrated in the difficult context of a non-convex energy. Experimental results on real world Meteosat sequences are presented."
            },
            "slug": "A-multigrid-approach-for-hierarchical-motion-Mémin-Pérez",
            "title": {
                "fragments": [],
                "text": "A multigrid approach for hierarchical motion estimation"
            },
            "tldr": {
                "abstractSimilarityScore": 56,
                "text": "The approach developed here is a tradeoff between methods based on global parameterized flow models and local dense optic flow estimators and an adaptive multigrid minimization approach that allows to mix different parameterizations of the estimate relative to adaptive partitions of the image."
            },
            "venue": {
                "fragments": [],
                "text": "Sixth International Conference on Computer Vision (IEEE Cat. No.98CH36271)"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1779050"
                        ],
                        "name": "Gunnar Farnebäck",
                        "slug": "Gunnar-Farnebäck",
                        "structuredName": {
                            "firstName": "Gunnar",
                            "lastName": "Farnebäck",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Gunnar Farnebäck"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 139,
                                "start": 124
                            }
                        ],
                        "text": "Finally, spatio-temporal approaches have ameliorated the results simply by using the information of an additional dimension [18, 6, 26, 10]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 111,
                                "start": 103
                            }
                        ],
                        "text": "Some of these ideas are close in spirit to methods for joint motion estimation and motion segmentation [10, 17], and to optical flow methods motivated from robust statistics where outliers are penalised less severely [6, 7]."
                    },
                    "intents": []
                }
            ],
            "corpusId": 5744454,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "274e6c7ce31bbcbe1e4d983f06c0292f6dd1ac31",
            "isKey": false,
            "numCitedBy": 64,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "In [10] we presented a new velocity estimation algorithm, using orientation tensors and parametric motion models to provide both fast and accurate results. One of the tradeoffs between accuracy and speed was that no attempts were made to obtain regions of coherent motion when estimating the parametric models. In this paper we show how this can be improved by doing a simultaneous segmentation of the motion field. The resulting algorithm is slower than the previous one, but more accurate. This is shown by evaluation on the well-known Yosemite sequence, where already the previous algorithm showed an accuracy which was substantially better than for earlier published methods. This result has now been improved further."
            },
            "slug": "Very-High-Accuracy-Velocity-Estimation-using-Motion-Farnebäck",
            "title": {
                "fragments": [],
                "text": "Very High Accuracy Velocity Estimation using Orientation Tensors Parametric Motion and Simultaneous Segmentation of the Motion Field"
            },
            "tldr": {
                "abstractSimilarityScore": 74,
                "text": "This paper shows how a new velocity estimation algorithm, using orientation tensors and parametric motion models to provide both fast and accurate results can be improved by doing a simultaneous segmentation of the motion field."
            },
            "venue": {
                "fragments": [],
                "text": "ICCV"
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102612019"
                        ],
                        "name": "G. Farneback",
                        "slug": "G.-Farneback",
                        "structuredName": {
                            "firstName": "G.",
                            "lastName": "Farneback",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Farneback"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 112,
                                "start": 104
                            }
                        ],
                        "text": "Some of these ideas are close in spirit to methods for joint motion estimation an d motion segmentation [10, 17], and to optical flow methods motivated from robust statis tics where outliers are penalised less severely [6, 7]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 139,
                                "start": 124
                            }
                        ],
                        "text": "Fi ally, spatio-temporal approaches have ameliorated the results simply by using the information of an additional dimension [18, 6, 26, 10]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 195862488,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9af26afd8cf88c450e41fc3867125968e93c97cf",
            "isKey": false,
            "numCitedBy": 57,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "In a previous paper, the author presented a new velocity estimation algorithm, using orientation tensors and parametric motion models to provide both fast and accurate results. One of the tradeoffs between accuracy and speed was that no attempts were made to obtain regions of coherent motion when estimating the parametric models. In this paper we show how this can be improved by doing a simultaneous segmentation of the motion field. The resulting algorithm is slower than the previous one, but more accurate. This is shown by evaluation on the well-known Yosemite sequence, where already the previous algorithm showed an accuracy which was substantially better than for earlier published methods. This result has now been improved further."
            },
            "slug": "Very-high-accuracy-velocity-estimation-using-and-of-Farneback",
            "title": {
                "fragments": [],
                "text": "Very high accuracy velocity estimation using orientation tensors, parametric motion, and simultaneous segmentation of the motion field"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The resulting algorithm is slower than the previous one, but more accurate, and shown by evaluation on the well-known Yosemite sequence, where already the previous algorithm showed an accuracy which was substantially better than for earlier published methods."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings Eighth IEEE International Conference on Computer Vision. ICCV 2001"
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145981906"
                        ],
                        "name": "P. Anandan",
                        "slug": "P.-Anandan",
                        "structuredName": {
                            "firstName": "P.",
                            "lastName": "Anandan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Anandan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 36,
                                "start": 26
                            }
                        ],
                        "text": "Coarse-to-fine strategies [3, 7, 16] as well as non-linearised"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 124,
                                "start": 114
                            }
                        ],
                        "text": "Coarse-to-fine warping techniques are a frequently used too l for improving the performance of optic flow methods [3, 7, 17]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 8369403,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "eca65cc62a3fcc02f4cfce9761c2c4857ad2f262",
            "isKey": false,
            "numCitedBy": 835,
            "numCiting": 62,
            "paperAbstract": {
                "fragments": [],
                "text": "The robust measurement of visual motion from digitized image sequences has been an important but difficult problem in computer vision. This paper describes a hierarchical computational framework for the determination of dense displacement fields from a pair of images, and an algorithm consistent with that framework. Our framework is based on a scale-based separation of the image intensity information and the process of measuring motion. The large-scale intensity information is first used to obtain rough estimates of image motion, which are then refined by using intensity information at smaller scales. The estimates are in the form of displacement (or velocity) vectors for pixels and are accompanied by a direction-dependent confidence measure. A smoothness constraint is employed to propagate measurements with high confidence to neighboring areas where the confidences are low. At all levels, the computations are pixel-parallel, uniform across the image, and based on information from a small neighborhood of a pixel. Results of applying our algorithm to pairs of real images are included. In addition to our own matching algorithm, we also show that two different hierarchical gradient-based algorithms are consistent with our framework."
            },
            "slug": "A-computational-framework-and-an-algorithm-for-the-Anandan",
            "title": {
                "fragments": [],
                "text": "A computational framework and an algorithm for the measurement of visual motion"
            },
            "tldr": {
                "abstractSimilarityScore": 53,
                "text": "This paper describes a hierarchical computational framework for the determination of dense displacement fields from a pair of images, and an algorithm consistent with that framework, based on a scale-based separation of the image intensity information and the process of measuring motion."
            },
            "venue": {
                "fragments": [],
                "text": "International Journal of Computer Vision"
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "82089914"
                        ],
                        "name": "A. Bab-Hadiashar",
                        "slug": "A.-Bab-Hadiashar",
                        "structuredName": {
                            "firstName": "Alireza",
                            "lastName": "Bab-Hadiashar",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Bab-Hadiashar"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50592201"
                        ],
                        "name": "D. Suter",
                        "slug": "D.-Suter",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Suter",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Suter"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 12943274,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "67a620979ccbc262f4446c50fca17d35bf5ea793",
            "isKey": false,
            "numCitedBy": 127,
            "numCiting": 73,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper formulates the optic flow problem as a set of over-determined simultaneous linear equations. It then introduces and studies two new robust optic flow methods. The first technique is based on using the Least Median of Squares (LMedS) to detect the outliers. Then, the inlier group is solved using the least square technique. The second method employs a new robust statistical method named the Least Median of Squares Orthogonal Distances (LMSOD) to identify the outliers and then uses total least squares to solve the optic flow problem. The performance of both methods are studied by experiments on synthetic and real image sequences. These methods outperform other published methods both in accuracy and robustness."
            },
            "slug": "Robust-Optic-Flow-Computation-Bab-Hadiashar-Suter",
            "title": {
                "fragments": [],
                "text": "Robust Optic Flow Computation"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "Two new robust optic flow methods are introduced that outperform other published methods both in accuracy and robustness and uses total least squares to solve the optic flow problem."
            },
            "venue": {
                "fragments": [],
                "text": "International Journal of Computer Vision"
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49843309"
                        ],
                        "name": "É. Mémin",
                        "slug": "É.-Mémin",
                        "structuredName": {
                            "firstName": "Étienne",
                            "lastName": "Mémin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "É. Mémin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144565371"
                        ],
                        "name": "P. Pérez",
                        "slug": "P.-Pérez",
                        "structuredName": {
                            "firstName": "Patrick",
                            "lastName": "Pérez",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Pérez"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 89,
                                "start": 85
                            }
                        ],
                        "text": "For a fixedk, this system is equivalent to the Euler–Lagrange equations described in [17]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 112,
                                "start": 104
                            }
                        ],
                        "text": "Some of these ideas are close in spirit to methods for joint motion estimation an d motion segmentation [10, 17], and to optical flow methods motivated from robust statis tics where outliers are penalised less severely [6, 7]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 80,
                                "start": 76
                            }
                        ],
                        "text": "Let us also simplify the model by assuming solely spatial smoothness, as in [17]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 124,
                                "start": 114
                            }
                        ],
                        "text": "Coarse-to-fine warping techniques are a frequently used too l for improving the performance of optic flow methods [3, 7, 17]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 18483988,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "1b3744bad95d05b0d051a761053d2a5c9ceb3c43",
            "isKey": true,
            "numCitedBy": 185,
            "numCiting": 46,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper we present a comprehensive energy-based framework for the estimation and the segmentation of the apparent motion in image sequences. The robust cost functions and the associated hierarchical minimization techniques that we propose mix efficiently non-parametric (dense) representations, local interacting parametric representations, and global non-interacting parametric representations related to a partition into regions. Experimental comparisons, both on synthetic and real images, demonstrate the merit of the approach on different types of photometric and kinematic contents ranging from moving rigid objects to moving fluids."
            },
            "slug": "Hierarchical-Estimation-and-Segmentation-of-Dense-Mémin-Pérez",
            "title": {
                "fragments": [],
                "text": "Hierarchical Estimation and Segmentation of Dense Motion Fields"
            },
            "tldr": {
                "abstractSimilarityScore": 51,
                "text": "The robust cost functions and the associated hierarchical minimization techniques that are proposed mix efficiently non-parametric (dense) representations, local interacting parametric representations, and global non-interacting parametric representation related to a partition into regions."
            },
            "venue": {
                "fragments": [],
                "text": "International Journal of Computer Vision"
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144721252"
                        ],
                        "name": "H. Nagel",
                        "slug": "H.-Nagel",
                        "structuredName": {
                            "firstName": "Hans-Hellmut",
                            "lastName": "Nagel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Nagel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2677311"
                        ],
                        "name": "W. Enkelmann",
                        "slug": "W.-Enkelmann",
                        "structuredName": {
                            "firstName": "Wilfried",
                            "lastName": "Enkelmann",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Enkelmann"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 14,
                                "start": 7
                            }
                        ],
                        "text": "models [19, 2] have been used to tackle large displacements."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 206,
                                "start": 188
                            }
                        ],
                        "text": "In order to handle discont inuities in the flow field, the quadratic regulariser in the Horn and Schunck model was r eplaced by smoothness constraints that permit piecewise smooth results [1, 9, 19, 2 , 25]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 131,
                                "start": 124
                            }
                        ],
                        "text": "A second strategy to deal with large displacements has been t he usage of the nonlinearised grey value constancy assumption [19, 2]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 166,
                                "start": 159
                            }
                        ],
                        "text": "It is further shown that a coarse-to-fine strategy using the socalled warping technique [7, 16], implements the non-linearised optical flow constraint used in [19, 2] and in image registration."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 6399274,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "8454b1f86a3ad5a7b692b956fc8ef7fb4aca9377",
            "isKey": true,
            "numCitedBy": 993,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "A mapping between one frame from an image sequence and the preceding or following frame can be represented as a displacement vector field. In most situations, the mere gray value variations do not provide sufficient information in order to estimate such a displacement vector field. Supplementary constraints are necessary, for example the postulate that a displacement vector field varies smoothly as a function of the image position. Taken as a general requirement, this creates difficulties at gray value transitions which correspond to occluding contours. Nagel therefore introduced the ``oriented smoothness'' requirement which restricts variations of the displacement vector field only in directions with small or no variation of gray values. This contribution reports results of an investigation about how such an ``oriented smoothness'' constraint may be formulated and evaluated."
            },
            "slug": "An-Investigation-of-Smoothness-Constraints-for-the-Nagel-Enkelmann",
            "title": {
                "fragments": [],
                "text": "An Investigation of Smoothness Constraints for the Estimation of Displacement Vector Fields from Image Sequences"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "Results are reported of an investigation about how an ``oriented smoothness'' constraint may be formulated and evaluated about how variations of the displacement vector field only in directions with small or no variation of gray values are restricted."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144031005"
                        ],
                        "name": "Andrés Bruhn",
                        "slug": "Andrés-Bruhn",
                        "structuredName": {
                            "firstName": "Andrés",
                            "lastName": "Bruhn",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Andrés Bruhn"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7789445"
                        ],
                        "name": "J. Weickert",
                        "slug": "J.-Weickert",
                        "structuredName": {
                            "firstName": "Joachim",
                            "lastName": "Weickert",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Weickert"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1679944"
                        ],
                        "name": "C. Schnörr",
                        "slug": "C.-Schnörr",
                        "structuredName": {
                            "firstName": "Christoph",
                            "lastName": "Schnörr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Schnörr"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15374825,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "c0222b86881860bf61a5c11d39bd9254a6196633",
            "isKey": false,
            "numCitedBy": 717,
            "numCiting": 96,
            "paperAbstract": {
                "fragments": [],
                "text": "Differential methods belong to the most widely used techniques for optic flow computation in image sequences. They can be classified into local methods such as the Lucas–Kanade technique or Bigün's structure tensor method, and into global methods such as the Horn/Schunck approach and its extensions. Often local methods are more robust under noise, while global techniques yield dense flow fields. The goal of this paper is to contribute to a better understanding and the design of novel differential methods in four ways; (i) We juxtapose the role of smoothing/regularisation processes that are required in local and global differential methods for optic flow computation. (ii) This discussion motivates us to describe and evaluate a novel method that combines important advantages of local and global approaches: It yields dense flow fields that are robust against noise. (iii) Spatiotemporal and nonlinear extensions as well as multiresolution frameworks are presented for this hybrid method. (iv) We propose a simple confidence measure for optic flow methods that minimise energy functionals. It allows to sparsify a dense flow field gradually, depending on the reliability required for the resulting flow. Comparisons with experiments from the literature demonstrate the favourable performance of the proposed methods and the confidence measure."
            },
            "slug": "Lucas/Kanade-Meets-Horn/Schunck:-Combining-Local-Bruhn-Weickert",
            "title": {
                "fragments": [],
                "text": "Lucas/Kanade Meets Horn/Schunck: Combining Local and Global Optic Flow Methods"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The role of smoothing/regularisation processes that are required in local and global differential methods for optic flow computation are contrasted and a simple confidence measure is proposed that allows to sparsify a dense flow field gradually, depending on the reliability required for the resulting flow."
            },
            "venue": {
                "fragments": [],
                "text": "International Journal of Computer Vision"
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1679944"
                        ],
                        "name": "C. Schnörr",
                        "slug": "C.-Schnörr",
                        "structuredName": {
                            "firstName": "Christoph",
                            "lastName": "Schnörr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Schnörr"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 46941753,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "bffd615ef78cc18f820b9c68b7c52bcda93f5d36",
            "isKey": false,
            "numCitedBy": 97,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "A minimization problem is proposed to combine smoothing of locally computed motion data (e.g. normal flow) with the detection of motion boundaries. The continuous formulation of the cost functional allows one to incorporate arbitrary continuity-equations which locally determine apparent motion, and a nonlinear smoothing term adapts to the magnitude of the flow-gradient or to its components divergence, rotation, and shear. The approach has been designed such that gradient descent converges to a unique solution."
            },
            "slug": "Segmentation-of-visual-motion-by-minimizing-convex-Schnörr",
            "title": {
                "fragments": [],
                "text": "Segmentation of visual motion by minimizing convex non-quadratic functionals"
            },
            "tldr": {
                "abstractSimilarityScore": 76,
                "text": "A minimization problem is proposed to combine smoothing of locally computed motion data with the detection of motion boundaries and has been designed such that gradient descent converges to a unique solution."
            },
            "venue": {
                "fragments": [],
                "text": "ICPR"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40246285"
                        ],
                        "name": "L. Rudin",
                        "slug": "L.-Rudin",
                        "structuredName": {
                            "firstName": "Leonid",
                            "lastName": "Rudin",
                            "middleNames": [
                                "I."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Rudin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1782265"
                        ],
                        "name": "S. Osher",
                        "slug": "S.-Osher",
                        "structuredName": {
                            "firstName": "S.",
                            "lastName": "Osher",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Osher"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143749693"
                        ],
                        "name": "E. Fatemi",
                        "slug": "E.-Fatemi",
                        "structuredName": {
                            "firstName": "Emad",
                            "lastName": "Fatemi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Fatemi"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 76,
                                "start": 69
                            }
                        ],
                        "text": "This is achieved by penalising the total variation of the flow field [20, 8], which can be expressed as"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 13133466,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "54205667c1f65a320f667d73c354ed8e86f1b9d9",
            "isKey": false,
            "numCitedBy": 13754,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Nonlinear-total-variation-based-noise-removal-Rudin-Osher",
            "title": {
                "fragments": [],
                "text": "Nonlinear total variation based noise removal algorithms"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "15808204"
                        ],
                        "name": "J. Barron",
                        "slug": "J.-Barron",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Barron",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Barron"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1793739"
                        ],
                        "name": "David J. Fleet",
                        "slug": "David-J.-Fleet",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Fleet",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "David J. Fleet"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46818737"
                        ],
                        "name": "S. Beauchemin",
                        "slug": "S.-Beauchemin",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Beauchemin",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Beauchemin"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 90,
                                "start": 87
                            }
                        ],
                        "text": "Yosemite with clouds Yosemite without clouds Technique AAE STD Technique AAE STD Nagel [5] 10."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 59,
                                "start": 56
                            }
                        ],
                        "text": "The presented angular errors were computed according to [5]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 93,
                                "start": 90
                            }
                        ],
                        "text": "Often an image sequence is preprocessed by Gaussian convolution with standard deviation σ [5]."
                    },
                    "intents": []
                }
            ],
            "corpusId": 1290100,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "400f4afb2a055d95483d83c4bedab10281a8639d",
            "isKey": true,
            "numCitedBy": 4068,
            "numCiting": 125,
            "paperAbstract": {
                "fragments": [],
                "text": "While different optical flow techniques continue to appear, there has been a lack of quantitative evaluation of existing methods. For a common set of real and synthetic image sequences, we report the results of a number of regularly cited optical flow techniques, including instances of differential, matching, energy-based, and phase-based methods. Our comparisons are primarily empirical, and concentrate on the accuracy, reliability, and density of the velocity measurements; they show that performance can differ significantly among the techniques we implemented."
            },
            "slug": "Performance-of-optical-flow-techniques-Barron-Fleet",
            "title": {
                "fragments": [],
                "text": "Performance of optical flow techniques"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "These comparisons are primarily empirical, and concentrate on the accuracy, reliability, and density of the velocity measurements; they show that performance can differ significantly among the techniques the authors implemented."
            },
            "venue": {
                "fragments": [],
                "text": "International Journal of Computer Vision"
            },
            "year": 2005
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4929024"
                        ],
                        "name": "J. Bezdek",
                        "slug": "J.-Bezdek",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Bezdek",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Bezdek"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2227139"
                        ],
                        "name": "J. Keller",
                        "slug": "J.-Keller",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Keller",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Keller"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69427318"
                        ],
                        "name": "R. Krisnapuram",
                        "slug": "R.-Krisnapuram",
                        "structuredName": {
                            "firstName": "Raghu",
                            "lastName": "Krisnapuram",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Krisnapuram"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1708545"
                        ],
                        "name": "N. Pal",
                        "slug": "N.-Pal",
                        "structuredName": {
                            "firstName": "Nikhil",
                            "lastName": "Pal",
                            "middleNames": [
                                "Ranjan"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Pal"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 59850376,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f7eba8a3faf711981bfdd72ba88a0934cfd73395",
            "isKey": false,
            "numCitedBy": 36,
            "numCiting": 42,
            "paperAbstract": {
                "fragments": [],
                "text": "Digital image processing is the study of theories, models and algorithms for the manipulation of images (usually by computer). It spans a wide variety of topics such as digitization, histogram manipulation, warping, filtering, segmentation, restoration and compression. Computer vision deals with theories and algorithms for automating the process of visual perception, and involves tasks such as noise removal, smoothing, and sharpening of edges (low-level vision); segmentation of images to isolate object regions, and description of the segmented regions (intermediate-level vision); and finally, interpretation of the scene (high-level vision). Thus, there is much overlap between these two fields. In this chapter, we concentrate on some of the aspects of image processing and computer vision in which a fuzzy approach has had an impact. We begin with some notation and definitions used throughout the chapter."
            },
            "slug": "Image-Processing-and-Computer-Vision-Bezdek-Keller",
            "title": {
                "fragments": [],
                "text": "Image Processing and Computer Vision"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "This chapter concentrates on some of the aspects of image processing and computer vision in which a fuzzy approach has had an impact."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40588702"
                        ],
                        "name": "B. D. Lucas",
                        "slug": "B.-D.-Lucas",
                        "structuredName": {
                            "firstName": "Bruce",
                            "lastName": "Lucas",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. D. Lucas"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1733113"
                        ],
                        "name": "T. Kanade",
                        "slug": "T.-Kanade",
                        "structuredName": {
                            "firstName": "Takeo",
                            "lastName": "Kanade",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Kanade"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 90,
                                "start": 74
                            }
                        ],
                        "text": "Starting from the original approaches of Horn and Schunck [11] as well as Lucas and Kanade [15], research developed many new concepts for dealing with shortcomings of previous models."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 96,
                                "start": 92
                            }
                        ],
                        "text": "Starting from the original approaches of Hor n and Schunck [11] as well as Lucas and Kanade [15], research developed many new concep ts for dealing with shortcomings of previous models."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 2121536,
            "fieldsOfStudy": [
                "Computer Science",
                "Physics"
            ],
            "id": "a06547951c97b2a32f23a6c2b5f79c8c75c9b9bd",
            "isKey": false,
            "numCitedBy": 13329,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "Image registration finds a variety of applications in computer vision. Unfortunately, traditional image registration techniques tend to be costly. We present a new image registration technique that makes use of the spatial intensity gradient of the images to find a good match using a type of Newton-Raphson iteration. Our technique is taster because it examines far fewer potential matches between the images than existing techniques Furthermore, this registration technique can be generalized to handle rotation, scaling and shearing. We show how our technique can be adapted tor use in a stereo vision system."
            },
            "slug": "An-Iterative-Image-Registration-Technique-with-an-Lucas-Kanade",
            "title": {
                "fragments": [],
                "text": "An Iterative Image Registration Technique with an Application to Stereo Vision"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "This work presents a new image registration technique that makes use of the spatial intensity gradient of the images to find a good match using a type of Newton-Raphson iteration, and can be generalized to handle rotation, scaling and shearing."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1725688"
                        ],
                        "name": "M. Tistarelli",
                        "slug": "M.-Tistarelli",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Tistarelli",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Tistarelli"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 7,
                                "start": 0
                            }
                        ],
                        "text": "[22,26]), we have shown that their combination outperforms all methods from the literature so far."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 71,
                                "start": 64
                            }
                        ],
                        "text": "While gradient constancy assumptions have also been proposed in [23,22] in order to deal with the aperture problem in the scope of a local approach, their use within variational methods is novel."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 31835751,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "bcc35b9fe8e2aaeedd8f32a715286e5fa14225ff",
            "isKey": false,
            "numCitedBy": 36,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "The computation of the optical flow field from an image sequences requires the definition of constraints on the temporal change of image features. In general, these constraints limit the motion of the body in space and/or of the features on the image plane."
            },
            "slug": "Multiple-Constraints-for-Optical-Flow-Tistarelli",
            "title": {
                "fragments": [],
                "text": "Multiple Constraints for Optical Flow"
            },
            "tldr": {
                "abstractSimilarityScore": 87,
                "text": "The computation of the optical flow field from an image sequences requires the definition of constraints on the temporal change of image features to limit the motion of the body in space and of the features on the image plane."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 1994
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 36,
                                "start": 26
                            }
                        ],
                        "text": "Coarse-to-fine strategies [3, 7, 16] as well as non-linearised"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 169,
                                "start": 162
                            }
                        ],
                        "text": "Since with quadrat ic penalisers, outliers get too much influence on the estimation, an increasing co cave functionΨ(s(2)) is applied, leading to a robust energy [7, 16]:"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 124,
                                "start": 114
                            }
                        ],
                        "text": "Coarse-to-fine warping techniques are a frequently used too l for improving the performance of optic flow methods [3, 7, 17]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 225,
                                "start": 219
                            }
                        ],
                        "text": "Some of these ideas are close in spirit to methods for joint motion estimation an d motion segmentation [10, 17], and to optical flow methods motivated from robust statis tics where outliers are penalised less severely [6, 7]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 95,
                                "start": 88
                            }
                        ],
                        "text": "It is further shown that a coarse-to-fine strategy using the socalled warping technique [7, 16], implements the non-linearised optical flow constraint used in [19, 2] and in image registration."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The robust estimation of multip  le motions: parametric and piecewise smooth flow fields.  Computer Vision and Image Understanding"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1390908654"
                        ],
                        "name": "Stan Z. Li",
                        "slug": "Stan-Z.-Li",
                        "structuredName": {
                            "firstName": "Stan Z.",
                            "lastName": "Li",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Stan Z. Li"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144725854"
                        ],
                        "name": "D. Mital",
                        "slug": "D.-Mital",
                        "structuredName": {
                            "firstName": "Dinesh",
                            "lastName": "Mital",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Mital"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1714572"
                        ],
                        "name": "E. Teoh",
                        "slug": "E.-Teoh",
                        "structuredName": {
                            "firstName": "Eam",
                            "lastName": "Teoh",
                            "middleNames": [
                                "Khwang"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Teoh"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2113289981"
                        ],
                        "name": "Han Wang",
                        "slug": "Han-Wang",
                        "structuredName": {
                            "firstName": "Han",
                            "lastName": "Wang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Han Wang"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 26604272,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "829c41cf5bc33e6cfd7ffafd1799fcd2cf401bad",
            "isKey": false,
            "numCitedBy": 27,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Recent-Developments-in-Computer-Vision-Li-Mital",
            "title": {
                "fragments": [],
                "text": "Recent Developments in Computer Vision"
            },
            "venue": {
                "fragments": [],
                "text": "Lecture Notes in Computer Science"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2270435"
                        ],
                        "name": "J. Eklundh",
                        "slug": "J.-Eklundh",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Eklundh",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Eklundh"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 19460790,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a374c6fb55d7a2f356a51fc47a88cb8903214059",
            "isKey": false,
            "numCitedBy": 154,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Computer-Vision-—-ECCV-'94-Eklundh",
            "title": {
                "fragments": [],
                "text": "Computer Vision — ECCV '94"
            },
            "venue": {
                "fragments": [],
                "text": "Lecture Notes in Computer Science"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33726225"
                        ],
                        "name": "O. Faugeras",
                        "slug": "O.-Faugeras",
                        "structuredName": {
                            "firstName": "Olivier",
                            "lastName": "Faugeras",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Faugeras"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 42997098,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e5c1f5b44c81e77475dc1df629610f86ca822740",
            "isKey": false,
            "numCitedBy": 31,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Computer-Vision-—-ECCV-90-Faugeras",
            "title": {
                "fragments": [],
                "text": "Computer Vision — ECCV 90"
            },
            "venue": {
                "fragments": [],
                "text": "Lecture Notes in Computer Science"
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 81,
                                "start": 77
                            }
                        ],
                        "text": "It should be noted that – apart from a very nice paper by Lefébure and Cohen [14] – not many theoretical results on warping are available so far."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 74,
                                "start": 56
                            }
                        ],
                        "text": "It should be noted that – apart from a very nice paper by Lefébure and Cohen [14] – not many theoretical results on warping are available so far."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Image registration, optica l flow and local rigidity.Journal of Mathematical Imaging and Vision"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2001
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Reliable and efficient computa  tion of optical flow.International"
            },
            "venue": {
                "fragments": [],
                "text": "Journal of Computer Vision  ,"
            },
            "year": 1998
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 95,
                                "start": 88
                            }
                        ],
                        "text": "It is further shown that a coarse-to-fine strategy using the socalled warping technique [7, 16], implements the non-linearised optical flow constraint used in [19, 2] and in image registration."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 36,
                                "start": 26
                            }
                        ],
                        "text": "Coarse-to-fine strategies [3, 7, 16] as well as non-linearised"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 169,
                                "start": 162
                            }
                        ],
                        "text": "Since with quadrat ic penalisers, outliers get too much influence on the estimation, an increasing co cave functionΨ(s(2)) is applied, leading to a robust energy [7, 16]:"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A multigrid approach for hierarc  hical motion estimation"
            },
            "venue": {
                "fragments": [],
                "text": "InProc. Sixth International Conference on Computer Vision ,"
            },
            "year": 1998
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 206,
                                "start": 188
                            }
                        ],
                        "text": "In order to handle discont inuities in the flow field, the quadratic regulariser in the Horn and Schunck model was r eplaced by smoothness constraints that permit piecewise smooth results [1, 9, 19, 2 , 25]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A theoretical framework for  c nvex regularizers in PDE-based computation of image motion.International Journal of Computer Vision"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2001
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 204,
                                "start": 186
                            }
                        ],
                        "text": "In order to handle discontinuities in the flow field, the quadratic regulariser in the Horn and Schunck model was replaced by smoothness constraints that permit piecewise smooth results [1, 9, 19, 21, 25]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Ś  anchez. A PDE model for computing the optical flow"
            },
            "venue": {
                "fragments": [],
                "text": "In Proc. XVI Congreso de Ecuaciones Diferenciales y Aplicaciones  ,"
            },
            "year": 1999
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 13,
            "methodology": 20
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 37,
        "totalPages": 4
    },
    "page_url": "https://www.semanticscholar.org/paper/High-Accuracy-Optical-Flow-Estimation-Based-on-a-Brox-Bruhn/91228e00fe33ed6072cfe849ab9e98160461549d?sort=total-citations"
}