{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "118988170"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "Dale",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 120306234,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "ab46fdac0a3b484cd58978ba71dc71631b49f70a",
            "isKey": false,
            "numCitedBy": 989,
            "numCiting": 57,
            "paperAbstract": {
                "fragments": [],
                "text": "An algorithm is proposed for solving the stereoscopic matching problem. The algorithm consists of five steps: (1) Each image is filtered at different orientations with bar masks of four sizes that increase with eccentricity; the equivalent filters are one or two octaves wide. (2) Zero-crossings in the filtered images, which roughly correspond to edges, are localized. Positions of the ends of lines and edges are also found. (3) For each mask orientation and size, matching takes place between pairs of zero-crossings or terminations of the same sign in the two images, for a range of disparities up to about the width of the mask’s central region. (4) Wide masks can control vergence movements, thus causing small masks to come into correspondence. (5) When a correspondence is achieved, it is stored in a dynamic buffer, called the 2½-D sketch. It is shown that this proposal provides a theoretical framework for most existing psychophysical and neurophysiological data about stereopsis. Several critical experimental predictions are also made, for instance about the size of Panum’s area under various conditions. The results of such experiments would tell us whether, for example, co-operativity is necessary for the matching process."
            },
            "slug": "A-computational-theory-of-human-stereo-vision-Marr-Poggio",
            "title": {
                "fragments": [],
                "text": "A computational theory of human stereo vision"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60545300,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "75d5b6239679642070a29859ec009874f3be9a4a",
            "isKey": false,
            "numCitedBy": 380,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "An Algorithm is proposed for solving the stereoscopic matching problem. The algorithm consists of five steps: (1) Each image is filtered with bar masks of four sizes that vary with eccentricity; the equivalent filters are about one octave wide. (2) Zero-crossings of the mask values are localized, and positions that correspond to terminations are found; (3) For each mask size, matching takes place between pairs of zero- crossings or terminations of the same sign in the two images, for a range of disparities up to about the vergence movements, thus causing small masks to come into correspondence; (5) When a correspondence is achieved, it is written into a dynamic buffer, called the 2 1/2 D sketch. It is shown that this proposal provides a theoretical framework for most existing phychophysical and neurophysiological data about stereopsis. Several critical experimental predictions are also made, for instance, about the wsize of Panum?s area under various conditions. The results of such experiments would tell us whether, for example, cooperativity is necessary for the fusion process."
            },
            "slug": "A-Theory-of-Human-Stereo-Vision-Marr-Poggio",
            "title": {
                "fragments": [],
                "text": "A Theory of Human Stereo Vision"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This proposal provides a theoretical framework for most existing phychophysical and neurophysiological data about stereopsis, and several critical experimental predictions are made, for instance, about the wsize of Panum?s area under various conditions."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1719838"
                        ],
                        "name": "W. Grimson",
                        "slug": "W.-Grimson",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Grimson",
                            "middleNames": [
                                "Eric",
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Grimson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Details oftheoriginally proposed model maybefound in[28] . Thefirst computer implementation ofthis model wasreported in[ 11 ](recently anindependent reimplementation ofthe algorithm hasbeenreported in[20] ).Theoriginal implementation differed slightly fromtheMarr-Poggio model, dueto observations madewhile transferring themodeltoaworking algorithm, since theprocess ofexplicitly detailing thealgorithm illuminated somepreviously unforeseen ..."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Wealso consider anexample ofarobotics application andinvestigate theaccuracy ofthealgorithm in reconstructing thedistance toobjects inthescene, given measurements fortheparameters oftheimaging geometry.  11 .THEMARR-POGGIO STEREOMODEL"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Following theoriginal testingtotheMarr-Poggio-Grimson algorithm, asreported previously ([ 11 ],[12]withsomemodifications proposed in[29] ), extensive additional computational experiments withthealgorithm havebeenperformed, especially onnatural images."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Iftheregion does lie within thedisparity range ±w,, thenexcluding thecase ofoccluded points, every zero-crossing intheregion will haveatleast onecandidate match intheother filtered image.Ontheother hand, iftheregion lies beyond thedisparity range±w,, thentheprobability ofagiven zerocrossing having atleast onecandidate match will beroughly 0.7[28], [ 11 ], [12]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "A computer implementation oftheir algorithm wasthendeveloped andtested [ 11 ], [12]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Note, however, that many ofthezero-crossings are shallow unstable zero-crossings, corresponding tosmall fluctuations inthephogometric process,asillustrated byFig. 3.If Fig.  11 .Contour map(Fort Sill) based onmatching before consistency check."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Details of handling morethanonematchwithin this search region are given in[ 11 ]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Thus, we let10,  11 , and12denote thecontour lengths required bycontours of0,1,and2gaps, respectively."
                    },
                    "intents": []
                }
            ],
            "corpusId": 10762887,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "f7aa07fa42e67d43aa58dd107da856b98235863c",
            "isKey": true,
            "numCitedBy": 307,
            "numCiting": 31,
            "paperAbstract": {
                "fragments": [],
                "text": "Recently, Marr & Poggio (1979) presented a theory of human stereo vision. An implementation of that theory is presented, and consists of five steps. (i) The left and right images are each filtered with masks of four sizes that increase with eccentricity; the shape of these masks is given by delta 2G, the Laplacian of a Gaussian function. (ii) Zero crossings in the filtered images are found along horizontal scan lines. (iii) For each mask size, matching takes place between zero crossings of the same sign and roughly the same orientation in the two images, for a range of disparities up to about the width of the mask's central region. Within this disparity range, it can be shown that false targets pose only a simple problem. (iv) The output of the wide masks can control vergence movements, thus causing small masks to come into correspondence. In this way, the matching process gradually moves from dealing with large disparities at a low resolution to dealing with small disparities at a high resolution. (v) When a correspondence is achieved, it is stored in a dynamic buffer, called the 2 1/2-dimensional sketch. To support the adequacy of the Marr-Poggio model of human stereo vision, the implementation was tested on a wide range of stereograms from the human stereopsis literature. The performance of the implementation is illustrated and compared with human perception. Also statistical assumptions made by Marr & Poggio are supported by comparison with statistics found in practice. Finally, the process of implementing the theory has led to the clarification and refinement of a number of details within the theory; these are discussed in detail."
            },
            "slug": "A-computer-implementation-of-a-theory-of-human-Grimson",
            "title": {
                "fragments": [],
                "text": "A computer implementation of a theory of human stereo vision."
            },
            "tldr": {
                "abstractSimilarityScore": 51,
                "text": "To support the adequacy of the Marr-Poggio model of human stereo vision, the implementation was tested on a wide range of stereograms from the human stereopsis literature and was illustrated and compared with human perception."
            },
            "venue": {
                "fragments": [],
                "text": "Philosophical transactions of the Royal Society of London. Series B, Biological sciences"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144117609"
                        ],
                        "name": "J. Mayhew",
                        "slug": "J.-Mayhew",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Mayhew",
                            "middleNames": [
                                "E.",
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mayhew"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2544594"
                        ],
                        "name": "J. Frisby",
                        "slug": "J.-Frisby",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Frisby",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Frisby"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 43122532,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "5d206bde2f0613b54708913c2c99c44314a8d8d1",
            "isKey": false,
            "numCitedBy": 415,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Psychophysical-and-Computational-Studies-Towards-a-Mayhew-Frisby",
            "title": {
                "fragments": [],
                "text": "Psychophysical and Computational Studies Towards a Theory of Human Stereopsis"
            },
            "venue": {
                "fragments": [],
                "text": "Artif. Intell."
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1719838"
                        ],
                        "name": "W. Grimson",
                        "slug": "W.-Grimson",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Grimson",
                            "middleNames": [
                                "Eric",
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Grimson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 34577439,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "daafb0ccc53b15973ae26992922dd22b1102628b",
            "isKey": false,
            "numCitedBy": 187,
            "numCiting": 27,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "An-implementation-of-a-computational-theory-of-Grimson",
            "title": {
                "fragments": [],
                "text": "An implementation of a computational theory of visual surface interpolation"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Vis. Graph. Image Process."
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1719838"
                        ],
                        "name": "W. Grimson",
                        "slug": "W.-Grimson",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Grimson",
                            "middleNames": [
                                "Eric",
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Grimson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 46108912,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "d27b1205d722be5ec477c476770b7e2753d26b17",
            "isKey": false,
            "numCitedBy": 151,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": "Computational theories of structure-from-motion and stereo vision only specify the computation of three-dimensional surface information at special points in the image. Yet the visual perception is clearly of complete surfaces. To account for this a computational theory of the interpolation of surfaces from visual information is presented. The problem is constrained by the fact that the surface must agree with the information from stereo or motion correspondence, and not vary radically between these points. Using the image irradiance equation, an explicit form of this surface consistency constraint can be derived. To determine which of two possible surfaces is more consistent with the surface consistency constraint, one must be able to compare the two surfaces. To do this, a functional from the space of possible functions to the real numbers is required. In this way, the surface most consistent with the visual information will be that which minimizes the functional. To ensure that the functional has a unique minimal surface, conditions on the form of the functional are derived. In particular, if the functional is a complete semi-norm that satisfies the parallelogram law, or the space of functions is a semi-Hilbert space and the functional is a semi-inner product, then there is a unique (to within possibly an element of the null space of the functional) surface that is most consistent with the visual information. It can be shown, based on the above conditions plus a condition of rotational symmetry, that there is a vector space of possible functionals that measure surface consistency, this vector space being spanned by the functional of quadratic variation and the functional of square Laplacian. Arguments based on the null spaces of the respective functionals are used to justify the choice of the quadratic variation as the optimal functional. Possible refinements to the theory, concerning the role of discontinuities in depth and the effects of applying the interpolation process to scenes containing more than one object, are discussed."
            },
            "slug": "A-computational-theory-of-visual-surface-Grimson",
            "title": {
                "fragments": [],
                "text": "A computational theory of visual surface interpolation."
            },
            "tldr": {
                "abstractSimilarityScore": 50,
                "text": "A computational theory of the interpolation of surfaces from visual information is presented, and it is shown that there is a vector space of possible functionals that measure surface consistency, this vector space being spanned by thefunctional of quadratic variation and the functional of square Laplacian."
            },
            "venue": {
                "fragments": [],
                "text": "Philosophical transactions of the Royal Society of London. Series B, Biological sciences"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2210169"
                        ],
                        "name": "S. Barnard",
                        "slug": "S.-Barnard",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Barnard",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Barnard"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144816086"
                        ],
                        "name": "W. Thompson",
                        "slug": "W.-Thompson",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Thompson",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Thompson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 173,
                                "start": 170
                            }
                        ],
                        "text": "…applications of the algorithm to domains other than modeling of the human system, as are nonbiologically based studies of feature-point stereo vision systems (e.g., [1]-[4], [34], [35], [39]) (see also the technique of Kass [21], [22], which may also be applicable to feature point stereo)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 10132470,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "22d262e5dfd45776f5616fe405cf153c8466e965",
            "isKey": false,
            "numCitedBy": 900,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "An algorithm for matching images of real world scenes is presented. The matching is a specification of the geometrical disparity between the images and may be used to partially reconstruct the three-dimensional structure of the scene. Sets of candidate matching points are selected independently in each image. These points are the locations of small, distinct features which are likely to be detectable in both images. An initial network of possible matches between the two sets of candidates is constructed. Each possible match specifies a possible disparity of a candidate point in a selected reference image. An initial estimate of the probability of each possible disparity is made, based on the similarity of subimages surrounding the points. These estimates are iteratively improved by a relaxation labeling technique making use of the local continuity property of disparity that is a consequence of the continuity of real world surfaces. The algorithm is effective for binocular parallax, motion parallax, and object motion. It quickly converges to good estimates of disparity, which reflect the spatial organization of the scene."
            },
            "slug": "Disparity-Analysis-of-Images-Barnard-Thompson",
            "title": {
                "fragments": [],
                "text": "Disparity Analysis of Images"
            },
            "tldr": {
                "abstractSimilarityScore": 65,
                "text": "An algorithm for matching images of real world scenes is presented, which quickly converges to good estimates of disparity, which reflect the spatial organization of the scene."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1719838"
                        ],
                        "name": "W. Grimson",
                        "slug": "W.-Grimson",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Grimson",
                            "middleNames": [
                                "Eric",
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Grimson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 22285797,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8c6d96e450f65c7adc63fceffa238fe7eb8c6966",
            "isKey": false,
            "numCitedBy": 39,
            "numCiting": 39,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Surface-consistency-constraints-in-vision-Grimson",
            "title": {
                "fragments": [],
                "text": "Surface consistency constraints in vision"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Vis. Graph. Image Process."
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144901036"
                        ],
                        "name": "H. Nishihara",
                        "slug": "H.-Nishihara",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Nishihara",
                            "middleNames": [
                                "Keith"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Nishihara"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40808201"
                        ],
                        "name": "N. Larson",
                        "slug": "N.-Larson",
                        "structuredName": {
                            "firstName": "N.",
                            "lastName": "Larson",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Larson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62766357,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "95e128575f9bff4d36390d9a8323511a6ca8bcf1",
            "isKey": false,
            "numCitedBy": 36,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper reports on research--primarily at Marr and Poggio's [9] mechanism level--to design a practical hardware stereo-matcher and on the interaction this study has had with our understanding of the problem, at the computational theory and algorithm levels. The stereo-matching algorithm proposed by Marr and Poggio [10] and implemented by Grimson and Marc [3] is consistent with what is presently known about human stereo vision [2]. Their research has been concerned with understanding the principles underlying the stereo-matching problem. Our objective has been to produce a stereo-matcher that operates reliably at near real time rates as a tool to facilitate further research in vision and for possible application in robotics and stereo-photogrammetry. At present the design and construction of the camera and convolution modules of this project have been completed and the design of the zero-crossing and matching modules is progressing. The remainder of this section provides a brief description of the Marr and Poggio stereo algorithm. We then dis-cuss our general approach and sonic of the issues that have come up concerning the design of the individual modules."
            },
            "slug": "Towards-A-Real-Time-Implementation-Of-The-Marr-And-Nishihara-Larson",
            "title": {
                "fragments": [],
                "text": "Towards A Real Time Implementation Of The Marr And Poggio Stereo Matcher"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The objective has been to produce a stereo-matcher that operates reliably at near real time rates as a tool to facilitate further research in vision and for possible application in robotics and stereo-photogrammetry."
            },
            "venue": {
                "fragments": [],
                "text": "Other Conferences"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145337347"
                        ],
                        "name": "H. Baker",
                        "slug": "H.-Baker",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Baker",
                            "middleNames": [
                                "Harlyn"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Baker"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1738591"
                        ],
                        "name": "T. Binford",
                        "slug": "T.-Binford",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Binford",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Binford"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11002139,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "278618251450aaeb334227ec82bacabfc1c266de",
            "isKey": false,
            "numCitedBy": 545,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "The past few years have seen a growing interest in the application\" of three-dimensional image processing. With the increasing demand for 3-D spatial information for tasks of passive navigation [7,12], automatic surveillance [9], aerial cartography [10,13], and inspection in industrial automation, the importance of effective stereo analysis has been made quite clear. A particular challenge is to provide reliable and accurate depth data for input to object or terrain modelling systems (such as [5]. This paper describes an algorithm for such stereo sensing It uses an edge-based line-by-line stereo correlation scheme, and appears to be fast, robust, and parallel implementable. The processing consists of extracting edge descriptions for a stereo pair of images, linking these edges to their nearest neighbors to obtain the edge connectivity structure, correlating the edge descriptions on the basis of local edge properties, then cooperatively removmg those edge correspondences determined to be in error - those which violate the connectivity structure of the two images. A further correlation process, using a technique similar to that used for the edges, is applied to the image intensity values over intervals defined by the previous correlation The result of the processing is a full image array disparity map of the scene viewed."
            },
            "slug": "Depth-from-Edge-and-Intensity-Based-Stereo-Baker-Binford",
            "title": {
                "fragments": [],
                "text": "Depth from Edge and Intensity Based Stereo"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This paper describes an algorithm for stereo sensing that uses an edge-based line-by-line stereo correlation scheme, and appears to be fast, robust, and parallel implementable."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "71058586"
                        ],
                        "name": "R. D. Arnold",
                        "slug": "R.-D.-Arnold",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Arnold",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. D. Arnold"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1738591"
                        ],
                        "name": "T. Binford",
                        "slug": "T.-Binford",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Binford",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Binford"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 157,
                                "start": 154
                            }
                        ],
                        "text": "This is essentially the figural continuity constraint of Mayhew and Frisby [32] and has been suggested in a slightly different form in Arnold and Binford [1]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 169,
                                "start": 166
                            }
                        ],
                        "text": "…applications of the algorithm to domains other than modeling of the human system, as are nonbiologically based studies of feature-point stereo vision systems (e.g., [1]-[4], [34], [35], [39]) (see also the technique of Kass [21], [22], which may also be applicable to feature point stereo)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 120151178,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a658164fd27833871973053d60ae94376e768fb4",
            "isKey": false,
            "numCitedBy": 75,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "The correspondence problem, matching the same feature in two views, is a central problem of stereo vision. We examine geometric constraints on stereo correspondence and describe progress toward formulation from first principles of an evaluation function for selection of the best among alternative correspondences. Within a surface interpretation, conditions on correspondence of edges and surface intervals are shown. These conditions are useful with wide angle stereo and provide particularly tight constraints for narrow angle stereo. We invoke the general assumption that edge and surface orientations are not related to observer position. We are combining these general constraints with ongoing work in scene modeling of known regularities which include distributions with respect to the gravity vector (horizontal and vertical edges and surfaces), parallelism and alignment with local coordinate systems, and orthogonal corners. We will use them to calculate a likelihood measure for correspondences."
            },
            "slug": "Geometric-Constraints-In-Stereo-Vision-Arnold-Binford",
            "title": {
                "fragments": [],
                "text": "Geometric Constraints In Stereo Vision"
            },
            "tldr": {
                "abstractSimilarityScore": 54,
                "text": "Geometric constraints on stereo correspondence are examined and progress toward formulation from first principles of an evaluation function for selection of the best among alternative correspondences is described, using a likelihood measure for correspondences."
            },
            "venue": {
                "fragments": [],
                "text": "Optics & Photonics"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31846677"
                        ],
                        "name": "C. Tyler",
                        "slug": "C.-Tyler",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Tyler",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Tyler"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 63793071,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d8df37e5aa7a9d095bfc4fe54ea74eeb611c586e",
            "isKey": false,
            "numCitedBy": 20,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "For the design of three-dimensional displays of information obtained in image processing systems it is important to know the spatial resolution of human stereoscopic vision. This knowledge allows presentation of the 3-D information in the format optimal for image visibility, without wasting processing bandwidth on unusable information. (In just such a way, the poor spatial resolution of human color vision was exploited to save transmission bandwidth for color television.) The series of studies reported here establish that the spatial resolution of stereoscopic vision is far poorer than monocular pattern resolution."
            },
            "slug": "Spatial-Limitations-Of-Human-Stereoscopic-Vision-Tyler",
            "title": {
                "fragments": [],
                "text": "Spatial Limitations Of Human Stereoscopic Vision"
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "The series of studies reported here establish that the spatial resolution of stereoscopic vision is far poorer than monocular pattern resolution."
            },
            "venue": {
                "fragments": [],
                "text": "Optics & Photonics"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144117609"
                        ],
                        "name": "J. Mayhew",
                        "slug": "J.-Mayhew",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Mayhew",
                            "middleNames": [
                                "E.",
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mayhew"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "92269846"
                        ],
                        "name": "H. C. Longuet-Higgins",
                        "slug": "H.-C.-Longuet-Higgins",
                        "structuredName": {
                            "firstName": "Hugh",
                            "lastName": "Longuet-Higgins",
                            "middleNames": [
                                "Christopher"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. C. Longuet-Higgins"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 4367587,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "511c0e70cb0f7c7f39cfe3071818ec9469135222",
            "isKey": false,
            "numCitedBy": 290,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "We point out that the horizontal disparities between a pair of retinal images are inadequate for computing the three-dimensional structure of a scene unless supplemented by independent information about the distance and direction of the fixation point. We suggest that this supplementary information is derived not from non-visual sources, but from the vertical disparities of a few non-meridional image points. This hypothesis is shown to account quantitatively for Ogle's induced effect—the marked distortion of a scene by a vertically magnifying lens placed in front of one eye."
            },
            "slug": "A-computational-model-of-binocular-depth-perception-Mayhew-Longuet-Higgins",
            "title": {
                "fragments": [],
                "text": "A computational model of binocular depth perception"
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "The vertical disparities of a few non-meridional image points are shown to account quantitatively for Ogle's induced effect—the marked distortion of a scene by a vertically magnifying lens placed in front of one eye."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144117609"
                        ],
                        "name": "J. Mayhew",
                        "slug": "J.-Mayhew",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Mayhew",
                            "middleNames": [
                                "E.",
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mayhew"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 27417700,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "493ce1be809e1a65c0030696f2767fdc80ab7882",
            "isKey": false,
            "numCitedBy": 87,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "Two methods for interpreting disparity information are described. Neither requires extraretinal information to scale for distance: one method uses horizontal disparities to solve for the viewing distance, the other uses the vertical disparities. Method 1 requires the assumption that the disparities derive from a locally planar surface. Then from the horizontal disparities measured at four retinal locations the viewing distance and the equation of local surface ‘patch’ can be obtained. Method 2 does not need this assumption. The vertical disparities are first used to obtain the values of the gaze and viewing distance. These are then used to interpret the horizontal disparity information. An algorithm implementing the methods has been tested and is found to be subject to a perceptual phenomenon known as the ‘induced effect’."
            },
            "slug": "The-Interpretation-of-Stereo-Disparity-Information:-Mayhew",
            "title": {
                "fragments": [],
                "text": "The Interpretation of Stereo-Disparity Information: The Computation of Surface Orientation and Depth"
            },
            "tldr": {
                "abstractSimilarityScore": 59,
                "text": "Two methods for interpreting disparity information are described and an algorithm implementing the methods has been tested and is found to be subject to a perceptual phenomenon known as the ‘induced effect’."
            },
            "venue": {
                "fragments": [],
                "text": "Perception"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32733837"
                        ],
                        "name": "H. Wilson",
                        "slug": "H.-Wilson",
                        "structuredName": {
                            "firstName": "Hugh",
                            "lastName": "Wilson",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Wilson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 142899731,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "f45dae1312d6d21ef9c34872c6cceb23a6d7c8c9",
            "isKey": false,
            "numCitedBy": 44,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "More than a decade of research spawned by the work of CAMPBELL and ROBSON [1] and GRAHAM and NACHMIAS [2] has led to a general consensus that the human visual system contains several different classes of spatial mechanisms or channels that process the retinal image in parallel. Thus, elucidation of the spatiotemporal filtering characteristics of these mechanisms has become one of the major tasks of psychophysics. In general, of course, it is to be expected that complex interactions will occur between mechanisms responding to neighboring portions of the retinal image; and we know this to be true for the processing of movement and depth information. Fortunately, experimental paradigms have been developed which have enabled us to estimate mechanism characteristics at a lower level than that at which these interactions occur. This article will focus on two of these techniques and the resulting characterization of human spatiotemporal mechanisms."
            },
            "slug": "Psychophysical-Evidence-for-Spatial-Channels-Wilson",
            "title": {
                "fragments": [],
                "text": "Psychophysical Evidence for Spatial Channels"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": " 18  GRIMSON:COMPUTATIONAL EXPERIMENTSWITH FEATURE BASED STEREO ALGORITHM"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Thisledustoinmplement V2G operators withwidths ofwv=9, 18 ,36,and72picture elements (pixels) each.Thecoefficients oftheoperators wererepresented toaprecision ofIpart in2048.Coefficients ofmagnitudeless than48thofthemaximumvalue oftheoperator weresettozero.Thus, thetruncation radius oftheoperator (the point atwhichallfurther operator values weretreated as zero) wasapproximately 1.8w."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 122868787,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "8c698a0e0e54ef70bdb5a41585598b84400db178",
            "isKey": false,
            "numCitedBy": 736,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "The perception of depth involves monocular and binocular depth cues. The latter seem simpler and more suitable for investigation. Particularly important is the problem of finding binocular parallax, which involves matching patterns of the left and right visual fields. Stereo pictures of familiar objects or line drawings preclude the separation of interacting cues, and thus this pattern-matching process is difficult to investigate. More insight into the process can be gained by using unfamiliar picture material devoid of all cues except binocular parallax. To this end, artificial stereo picture pairs were generated on a digital computer. When viewed monocularly, they appear completely random, but if viewed binocularly, certain correlated point domains are seen in depth. By introducing distortions in this material and testing for perception of depth, it is possible to show that pattern-matching of corresponding points of the left and right visual fields can be achieved by first combining the two fields and then searching for patterns in the fused field. By this technique, some interesting properties of this fused binocular field are revealed, and a simple analog model is derived. The interaction between the monocular and binocular fields is also describea. A number of stereo images that demonstrate these and other findings are presented."
            },
            "slug": "Binocular-depth-perception-of-computer-generated-Julesz",
            "title": {
                "fragments": [],
                "text": "Binocular depth perception of computer-generated patterns"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1960
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2544594"
                        ],
                        "name": "J. Frisby",
                        "slug": "J.-Frisby",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Frisby",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Frisby"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144117609"
                        ],
                        "name": "J. Mayhew",
                        "slug": "J.-Mayhew",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Mayhew",
                            "middleNames": [
                                "E.",
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mayhew"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 232,
                                "start": 228
                            }
                        ],
                        "text": "Since the original presentation of the Marr-Poggio model, a number of additional psychophysical predictions of the model have been tested, and consequently, several modifications and improvements have been proposed (e.g., [32], [10], [36], [42])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 5473877,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "b31231e21cb6a4f75ac84ecaa534e9b2e2d0432d",
            "isKey": false,
            "numCitedBy": 22,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-role-of-spatial-frequency-tuned-channels-in-Frisby-Mayhew",
            "title": {
                "fragments": [],
                "text": "The role of spatial frequency tuned channels in vergence control"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1750924"
                        ],
                        "name": "Demetri Terzopoulos",
                        "slug": "Demetri-Terzopoulos",
                        "structuredName": {
                            "firstName": "Demetri",
                            "lastName": "Terzopoulos",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Demetri Terzopoulos"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 118219842,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "503989518696578f2b4e389709ae5158d7388f39",
            "isKey": false,
            "numCitedBy": 86,
            "numCiting": 90,
            "paperAbstract": {
                "fragments": [],
                "text": "Computational modules early in the human vision system typically generate sparse information about the shapes of visible surfaces in the scene. Moreover, visual processes such as stereopsis can provide such information at a number of levels spanning a range of resolutions. In this paper, we extend this multi-level structure to encompass the subsequent task of reconstructing full surface descriptions from the sparse information. The mathematical development proceeds in three steps. First, the surface most consistent with the sparse constraints is characterized as the solution to an equilibrium state of a thin flexible plate. Second, local, finite element representations of surfaces are introduced and, by applying the finite element method, the continuous variational principle is transformed into a discrete problem in the form of a large system of linear algebraic equations whose solution is computable by local-support, cooperative mechanisms. Third, to exploit the information available at each level of resolution, a hierarchy of discrete problems is formulated and a highly efficient multi-level algorithm, involving both intra-level relaxation processes and bi-directional inter-level algorithm, involving both intra- level relaxation processes and bidirectional inter-level local interpolation processes is applied to their simultaneous solution.. Examples of the generation of hierarchies of surface representations from stereo constraints are given. Finally, the basic surface approximation problem is revisited in a broader mathematical context whose implications are of relevance to vision."
            },
            "slug": "Multi-Level-Reconstruction-of-Visual-Surfaces:-and-Terzopoulos",
            "title": {
                "fragments": [],
                "text": "Multi-Level Reconstruction of Visual Surfaces: Variational Principles and Finite Element Representations"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "A multi-level structure is extended to encompass the subsequent task of reconstructing full surface descriptions from the sparse information, and the basic surface approximation problem is revisited in a broader mathematical context whose implications are of relevance to vision."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 118909327,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c4acae182d7282dcef9973231f06b1fca55090e7",
            "isKey": false,
            "numCitedBy": 150,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : Vision is the construction of efficient symbolic descriptions from images of the world. An important aspect of vision is the choice of representations for the different kinds of information in a visual scene. In the early stages of the analysis of an image, the representations used depend more on what it is possible to compute from an image than on what is ultimately desirable, but later representations can be more sensitive to the specific needs of recognition. This essay surveys recent work in vision at M.I.T. from a perspective in which the representational problems assume a primary importance. An overall framework is suggested for visual information processing, in which the analysis proceeds through three representations; (1) the primal sketch, which makes explicit the intensity changes and local two-dimensional geometry of an image, (2) the 2 1/2-D sketch, which is a viewer-centered representation of the depth, orientation and discontinuities of the visible surfaces, and (3) the 3-D model representation, which allows an object-centered description of the three-dimensional structure and organization of a viewed shape. Recent results concerning processes for constructing and maintaining these representations are summarized and discussed. (Author)"
            },
            "slug": "Representing-Visual-Information-Marr",
            "title": {
                "fragments": [],
                "text": "Representing Visual Information"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This essay surveys recent work in vision at M.I.T. from a perspective in which the representational problems assume a primary importance."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "92269846"
                        ],
                        "name": "H. C. Longuet-Higgins",
                        "slug": "H.-C.-Longuet-Higgins",
                        "structuredName": {
                            "firstName": "Hugh",
                            "lastName": "Longuet-Higgins",
                            "middleNames": [
                                "Christopher"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. C. Longuet-Higgins"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 24721194,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "4c94c6bd45fc81a33b5a9fca42bd5a6166079325",
            "isKey": false,
            "numCitedBy": 94,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "It is shown how the full three-dimensional structure of a scene may in principle be computed from a correlated pair of retinal images, when all that is known about the orientations of the two eyes is that the planes of their horizontal meridians accurately coincide. The vertical dimension plays a crucial role in the theory; visible points which lie on the horizontal meridian supply no information about the angle of convergence or the direction of gaze. (i) If the scene contains three or more nonmeridional points, not all lying in a vertical plane, then their positions in space are fully determined by the horizontal and vertical coordinates of their images on the two retinas. (ii) If just two nonmeridional points are visible, or more than two, lying in a vertical plane, then their retinal images admit, in general, just two distinct three-dimensional interpretations. One of these is usually unrealistic; but a choice between them may be perceptually difficult if the vertical plane containing the points is nearly perpendicular to the interocular axis. These results suggest that vertical disparities may play an important role in the binocular perception of absolute depth. Elsewhere (Mayhew, this issue) this suggestion is found to provide a quantitative explanation of Ogle's ‘induced effect’."
            },
            "slug": "The-Role-of-the-Vertical-Dimension-in-Stereoscopic-Longuet-Higgins",
            "title": {
                "fragments": [],
                "text": "The Role of the Vertical Dimension in Stereoscopic Vision"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "This suggestion is found to provide a quantitative explanation of Ogle's ‘induced effect’ and suggest that vertical disparities may play an important role in the binocular perception of absolute depth."
            },
            "venue": {
                "fragments": [],
                "text": "Perception"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1722219"
                        ],
                        "name": "Y. Ohta",
                        "slug": "Y.-Ohta",
                        "structuredName": {
                            "firstName": "Yuichi",
                            "lastName": "Ohta",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Ohta"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1733113"
                        ],
                        "name": "T. Kanade",
                        "slug": "T.-Kanade",
                        "structuredName": {
                            "firstName": "Takeo",
                            "lastName": "Kanade",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Kanade"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 191,
                                "start": 187
                            }
                        ],
                        "text": "…applications of the algorithm to domains other than modeling of the human system, as are nonbiologically based studies of feature-point stereo vision systems (e.g., [1]-[4], [34], [35], [39]) (see also the technique of Kass [21], [22], which may also be applicable to feature point stereo)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 9691638,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ffacc9e5144f0efed41fd49b2a388939afff5db9",
            "isKey": false,
            "numCitedBy": 1113,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents a stereo matching algorithm using the dynamic programming technique. The stereo matching problem, that is, obtaining a correspondence between right and left images, can be cast as a search problem. When a pair of stereo images is rectified, pairs of corresponding points can be searched for within the same scanlines. We call this search intra-scanline search. This intra-scanline search can be treated as the problem of finding a matching path on a two-dimensional (2D) search plane whose axes are the right and left scanlines. Vertically connected edges in the images provide consistency constraints across the 2D search planes. Inter-scanline search in a three-dimensional (3D) search space, which is a stack of the 2D search planes, is needed to utilize this constraint. Our stereo matching algorithm uses edge-delimited intervals as elements to be matched, and employs the above mentioned two searches: one is inter-scanline search for possible correspondences of connected edges in right and left images and the other is intra-scanline search for correspondences of edge-delimited intervals on each scanline pair. Dynamic programming is used for both searches which proceed simultaneously: the former supplies the consistency constraint to the latter while the latter supplies the matching score to the former. An interval-based similarity metric is used to compute the score. The algorithm has been tested with different types of images including urban aerial images, synthesized images, and block scenes, and its computational requirement has been discussed."
            },
            "slug": "Stereo-by-Intra-and-Inter-Scanline-Search-Using-Ohta-Kanade",
            "title": {
                "fragments": [],
                "text": "Stereo by Intra- and Inter-Scanline Search Using Dynamic Programming"
            },
            "tldr": {
                "abstractSimilarityScore": 60,
                "text": "This paper presents a stereo matching algorithm using the dynamic programming technique that uses edge-delimited intervals as elements to be matched, and employs the above mentioned two searches: one is inter-scanline search for possible correspondences of connected edges in right and left images and the other is intra-scanlines search for correspondence of edge-Delimited interval on each scanline pair."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31857045"
                        ],
                        "name": "E. Hildreth",
                        "slug": "E.-Hildreth",
                        "structuredName": {
                            "firstName": "Ellen",
                            "lastName": "Hildreth",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Hildreth"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 266,
                                "start": 262
                            }
                        ],
                        "text": "The left and right images of a stereo pair are convolved with a series of two-dimensional operators, whose shape is given by the Laplacian of a Gaussian V2G(x, y)= [ Y 2 ] exp or by an approximation to this operator, using a difference of two Gaussian functions [27]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 2150419,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "9009c9685754346deb93f316144a9da1f70ffcd8",
            "isKey": false,
            "numCitedBy": 7031,
            "numCiting": 62,
            "paperAbstract": {
                "fragments": [],
                "text": "A theory of edge detection is presented. The analysis proceeds in two parts. (1) Intensity changes, which occur in a natural image over a wide range of scales, are detected separately at different scales. An appropriate filter for this purpose at a given scale is found to be the second derivative of a Gaussian, and it is shown that, provided some simple conditions are satisfied, these primary filters need not be orientation-dependent. Thus, intensity changes at a given scale are best detected by finding the zero values of ∇2G(x, y)* I(x, y) for image I, where G(x, y) is a two-dimensional Gaussian distribution and ∇2 is the Laplacian. The intensity changes thus discovered in each of the channels are then represented by oriented primitives called zero-crossing segments, and evidence is given that this representation is complete. (2) Intensity changes in images arise from surface discontinuities or from reflectance or illumination boundaries, and these all have the property that they are spatially localized. Because of this, the zero-crossing segments from the different channels are not independent, and rules are deduced for combining them into a description of the image. This description is called the raw primal sketch. The theory explains several basic psychophysical findings, and the operation of forming oriented zero-crossing segments from the output of centre-surround ∇2G filters acting on the image forms the basis for a physiological model of simple cells (see Marr & Ullman 1979)."
            },
            "slug": "Theory-of-edge-detection-Marr-Hildreth",
            "title": {
                "fragments": [],
                "text": "Theory of edge detection"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The theory of edge detection explains several basic psychophysical findings, and the operation of forming oriented zero-crossing segments from the output of centre-surround ∇2G filters acting on the image forms the basis for a physiological model of simple cells."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32733837"
                        ],
                        "name": "H. Wilson",
                        "slug": "H.-Wilson",
                        "structuredName": {
                            "firstName": "Hugh",
                            "lastName": "Wilson",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Wilson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "116003860"
                        ],
                        "name": "J. Bergen",
                        "slug": "J.-Bergen",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Bergen",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Bergen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 1573287,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "b45c9da1e49cce9f37976d9187f85fb217d8d092",
            "isKey": false,
            "numCitedBy": 751,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-four-mechanism-model-for-threshold-spatial-vision-Wilson-Bergen",
            "title": {
                "fragments": [],
                "text": "A four mechanism model for threshold spatial vision"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1753317"
                        ],
                        "name": "P. Mowforth",
                        "slug": "P.-Mowforth",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Mowforth",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Mowforth"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144117609"
                        ],
                        "name": "J. Mayhew",
                        "slug": "J.-Mayhew",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Mayhew",
                            "middleNames": [
                                "E.",
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mayhew"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2544594"
                        ],
                        "name": "J. Frisby",
                        "slug": "J.-Frisby",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Frisby",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Frisby"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 22977284,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "086a6c69f1733f03800c2ad986f7a227991fdefa",
            "isKey": false,
            "numCitedBy": 46,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Vergence responses were recorded from practised observers viewing narrow-band spatial-frequency-filtered planar random-dot stereograms. It was found that low spatial frequencies of 1·75–3·5 cycles deg−1 could trigger appropriate vergence responses to larger disparities than could the relatively high spatial frequency of 7·0 cycles deg−1. Nevertheless, appropriate vergence shifts were observed reliably for spatial-frequency/disparity combinations well outside the range predicted by Marr and Poggio's (1979) model of stereo vision. It was also found that for large-disparity/high-spatial-frequency combinations which the subjects could not fuse, the vergence system went into oscillation with the eyes diverging and converging at a frequency of about 1·5 Hz and with an amplitude of about 10–20 min arc. Finally, it was demonstrated that when a prominent monocular cue was superimposed upon a large-disparity/high-spatial-frequency stereogram then a speedy vergence response occurred which resulted in successful fusion. This latter finding supports the hypothesis advanced earlier that monocular cues can facilitate stereopsis by triggering appropriate vergence shifts."
            },
            "slug": "Vergence-Eye-Movements-Made-in-Response-to-Mowforth-Mayhew",
            "title": {
                "fragments": [],
                "text": "Vergence Eye Movements Made in Response to Spatial-Frequency-Filtered Random-Dot Stereograms"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "It was demonstrated that when a prominent monocular cue was superimposed upon a large-disparity/high-spatial-frequency stereogram then a speedy vergence response occurred which resulted in successful fusion, which supports the hypothesis advanced earlier that monocular cues can facilitate stereopsis by triggering appropriate vergence shifts."
            },
            "venue": {
                "fragments": [],
                "text": "Perception"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1729041"
                        ],
                        "name": "J. Canny",
                        "slug": "J.-Canny",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Canny",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Canny"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 119706616,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9cbd5a66c1198d5a14f13e03483b69321024444b",
            "isKey": false,
            "numCitedBy": 1030,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : The problem of detecting intensity changes in images is canonical in vision. Edge detection operators are typically designed to optimally estimate first or second derivative over some (usually small) support. Other criteria such as output signal to noise ratio or bandwidth have also been been argued for. This thesis is an attempt to formulate a set of edge detection criteria that capture as directly as possible the desirable properties of an edge operator. Variational techniques are used to find a solution over the space of all linear shift invariant operators. The first criterion is that the detector have low probability of error i.e. failing to mark edges or falsely marking non-edges. The second is that the marked points should b The third criterion is that there should be low probability of more than one response to a single edge. The technique is used to find optimal operators for step edges and for extended impulse profiles (ridges or valleys in two dimensions). The extension of the one dimensional operators to two dimensions is then discussed. The result is a set of operators of varying width, length and orientation. The problem of combining these outputs into a single description is discussed, and a set of heuristics for the integration are given. (Author)"
            },
            "slug": "Finding-Edges-and-Lines-in-Images-Canny",
            "title": {
                "fragments": [],
                "text": "Finding Edges and Lines in Images"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This thesis is an attempt to formulate a set of edge detection criteria that capture as directly as possible the desirable properties of an edge operator."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2645098"
                        ],
                        "name": "A. Duwaer",
                        "slug": "A.-Duwaer",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Duwaer",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Duwaer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50574530"
                        ],
                        "name": "G. Brink",
                        "slug": "G.-Brink",
                        "structuredName": {
                            "firstName": "Gert",
                            "lastName": "Brink",
                            "middleNames": [
                                "van",
                                "den"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Brink"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 43850229,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "825793016a70a79fa989030ff890e3904f915f78",
            "isKey": false,
            "numCitedBy": 42,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "The magnitude and nature of the diplopia threshold, that is, the value of the retinal disparity at which binocular single vision ends, were studied in four experiments. The results show that the magnitude of the diplopia threshold is highly dependent on the subject tested (differences up to a factor of 6), the amount of training the subject has received (differences up to a factor of 2.5), the criterion used for diplopia (limits for unequivocal singleness of vision were up to a factor of 3 lower than those for unequivocal doubleness of vision), and the conspicuousness of disparity that can be influenced both by the surrounding stimuli (differences up to a factor of 3.5) and stereoscopic depth (differences up to a factor of 4.5). Our data do not confirm previous findings of interference effects associated with the initial appearance of binocular disparity when test stimuli are presented tachistoscopically. A remarkable finding was that the magnitude of the diplopia threshold seems to be determined by the amount of intrinsic noise in the disparity domain, as revealed by the standard deviations of the thresholds for tachistoscopically presented test stimuli. The overall results suggest that the diplopia threshold is, in essence, not the rigid boundary of a dead zone, but, rather, a disparity level corresponding to a lenient criterion for singleness of vision which leads touseful interpretation of the percept of the stimulus without disparity, given the variability of this percept due to intrinsic noise in the disparity domain."
            },
            "slug": "What-is-the-diplopia-threshold-Duwaer-Brink",
            "title": {
                "fragments": [],
                "text": "What is the diplopia threshold?"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "The overall results suggest that the diplopia threshold is, in essence, not the rigid boundary of a dead zone, but, rather, a disparity level corresponding to a lenient criterion for singleness of vision which leads touseful interpretation of the percept of the stimulus without disparity, given the variability of this percept due to intrinsic noise in the disparity domain."
            },
            "venue": {
                "fragments": [],
                "text": "Perception & psychophysics"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31857045"
                        ],
                        "name": "E. Hildreth",
                        "slug": "E.-Hildreth",
                        "structuredName": {
                            "firstName": "Ellen",
                            "lastName": "Hildreth",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Hildreth"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 40802930,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "e736f8c5c2008aa8c3733ffacc75fc906b9925dc",
            "isKey": false,
            "numCitedBy": 96,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "We suggest from the psychophysical data on two-point and line acuity that the smallest foveal channel in human vision must have an excitatory center with a diameter of around 1' 20\". Taking into account the optics of the eye and the finite size of the receptors, we show that this would correspond well to the properties of a retinal ganglion cell receiving excitatory input from a single cone."
            },
            "slug": "Smallest-channel-in-early-human-vision.-Marr-Poggio",
            "title": {
                "fragments": [],
                "text": "Smallest channel in early human vision."
            },
            "tldr": {
                "abstractSimilarityScore": 96,
                "text": "It is suggested from the psychophysical data on two-point and line acuity that the smallest foveal channel in human vision must have an excitatory center with a diameter of around 1' 20\"."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2066894"
                        ],
                        "name": "Hans P. Moravec",
                        "slug": "Hans-P.-Moravec",
                        "structuredName": {
                            "firstName": "Hans",
                            "lastName": "Moravec",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Hans P. Moravec"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 43,
                                "start": 39
                            }
                        ],
                        "text": "The idea (first used by Moravec [34] , [35] ) is to use a sparse representation of the images, with a coarse spatial sampling, for the initial matching of points."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 185,
                                "start": 181
                            }
                        ],
                        "text": "…applications of the algorithm to domains other than modeling of the human system, as are nonbiologically based studies of feature-point stereo vision systems (e.g., [1]-[4], [34], [35], [39]) (see also the technique of Kass [21], [22], which may also be applicable to feature point stereo)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 128525458,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "93b376bd451db8ed94a18c556da16f25a3e7961b",
            "isKey": false,
            "numCitedBy": 1054,
            "numCiting": 36,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : The Stanford AI Lab cart is a card-table sized mobile robot controlled remotely through a radio link, and equipped with a TV camera and transmitter. A computer has been programmed to drive the cart through cluttered indoor and outdoor spaces, gaining its knowledge of the world entirely from images broadcast by the onboard TV system. The cart uses several kinds of stereo to locate objects around it in 3D and to deduce its own motion. It plans an obstacle avoiding path to a desired destination on the basis of a model built with this information. The plan changes as the cart perceives new obstacles on its journey. The system is reliable for short runs, but slow. The cart moves one meter every ten to fifteen minutes, in lurches. After rolling a meter it stops, takes some pictures and thinks about them for a long time. Then it plans a new path, executes a little of it, and pauses again. The program has successfully driven the cart through several 20 meter indoor courses (each taking about five hours) complex enough to necessitate three or four avoiding swerves. A less successful outdoor run, in which the cart skirted two obstacles but collided with a third, was also done. Harsh lighting (very bright surfaces next to very dark shadows) giving poor pictures and movement of shadows during the cart's creeping progress were major reasons for the poorer outdoor performance. The action portions of these runs were filmed by computer controlled cameras. (Author)"
            },
            "slug": "Obstacle-avoidance-and-navigation-in-the-real-world-Moravec",
            "title": {
                "fragments": [],
                "text": "Obstacle avoidance and navigation in the real world by a seeing robot rover"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8028300"
                        ],
                        "name": "E. Grimson",
                        "slug": "E.-Grimson",
                        "structuredName": {
                            "firstName": "Eric",
                            "lastName": "Grimson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Grimson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 151,
                                "start": 147
                            }
                        ],
                        "text": "THE MARR-POGGIO STEREO MODEL In this section, we present a brief review of the original Marr- Poggio model [28], its original implementation [111, [12], and suggested modifications based on psychophysical and computational studies (e.g., [32] )."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 187,
                                "start": 183
                            }
                        ],
                        "text": "On the other hand, if the region lies beyond the disparity range ±w,, then the probability of a given zerocrossing having at least one candidate match will be roughly 0.7 [28], [11], [12]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 85,
                                "start": 81
                            }
                        ],
                        "text": "A computer implementation of their algorithm was then developed and tested [11], [12]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 61610981,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "b6c7a051ce690a913bac9c447500e035138c333e",
            "isKey": true,
            "numCitedBy": 439,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Based on the author's thesis (Ph.D.--Massachusetts Institute of Technology) Includes indexes."
            },
            "slug": "From-Images-to-Surfaces:-A-Computational-Study-of-Grimson",
            "title": {
                "fragments": [],
                "text": "From Images to Surfaces: A Computational Study of the Human Early Visual System"
            },
            "tldr": {
                "abstractSimilarityScore": 61,
                "text": "Based on the author's thesis (Ph.D.--Massachusetts Institute of Technology), this list of major indexes for the period of May 21 to 29, 1991 is based on the data available at the time of that date."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2645098"
                        ],
                        "name": "A. Duwaer",
                        "slug": "A.-Duwaer",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Duwaer",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Duwaer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50574530"
                        ],
                        "name": "G. Brink",
                        "slug": "G.-Brink",
                        "structuredName": {
                            "firstName": "Gert",
                            "lastName": "Brink",
                            "middleNames": [
                                "van",
                                "den"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Brink"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 9041224,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "4460f7f55c8e02355a945a679c5622c76cad773f",
            "isKey": false,
            "numCitedBy": 29,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Diplopia-thresholds-and-the-initiation-of-vergence-Duwaer-Brink",
            "title": {
                "fragments": [],
                "text": "Diplopia thresholds and the initiation of vergence eye-movements"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "72629875"
                        ],
                        "name": "Hans P. Morevec",
                        "slug": "Hans-P.-Morevec",
                        "structuredName": {
                            "firstName": "Hans",
                            "lastName": "Morevec",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Hans P. Morevec"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Theidea(first usedbyMoravec [ 34 ], [35] )istouseasparse representation oftheimages, withacoarse spatial sampling, fortheinitial matching ofpoints."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Hildreth ([161, seealso [7] )hasdemonstrated that inthecaseofanisolated zero-crossing, asimple linear interpolation between convolution values serves tolocalizethezero-crossing tosubpixel precision (see also [ 24 ] ).It hasbeenobserved incomputational experiments that strong isolated zero-crossings, suchasthose corresponding tooccludingboundaries orshadows forexample, canbereliably matched tosubpixel precision."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Suchexperiments arealso ofimportance whenconsidering applications of thealgorithm todomains other thanmodeling ofthehuman system, asarenonbiologically based studies offeature-point stereo vision systems (e.g., [1]-[4], [ 34 ], [35], [39]) (see alsothetechnique ofKass[21], [22], whichmayalsobe applicable tofeature point stereo)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 62213506,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "272a80e9c8039489a235236ac0cea3beeeb6734b",
            "isKey": true,
            "numCitedBy": 662,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This report describes ongoing research on a working system which drives a vehicle through cluttered environments under computer control, guided by images perceived through an onboard television camera. The emphasis is on reliable and fast low level visual techniques which determine the existence and location of objects in the world, but do not identify them"
            },
            "slug": "Towards-automatic-visual-obstacle-avoidance-Morevec",
            "title": {
                "fragments": [],
                "text": "Towards automatic visual obstacle avoidance"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "This report describes ongoing research on a working system which drives a vehicle through cluttered environments under computer control, guided by images perceived through an onboard television camera."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI 1977"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2066894"
                        ],
                        "name": "Hans P. Moravec",
                        "slug": "Hans-P.-Moravec",
                        "structuredName": {
                            "firstName": "Hans",
                            "lastName": "Moravec",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Hans P. Moravec"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 36,
                                "start": 32
                            }
                        ],
                        "text": "The idea (first used by Moravec [34] , [35] ) is to use a sparse representation of the images, with a coarse spatial sampling, for the initial matching of points."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 179,
                                "start": 175
                            }
                        ],
                        "text": "…applications of the algorithm to domains other than modeling of the human system, as are nonbiologically based studies of feature-point stereo vision systems (e.g., [1]-[4], [34], [35], [39]) (see also the technique of Kass [21], [22], which may also be applicable to feature point stereo)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 15630760,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "3b4a713d67a0a4f7099bdc40d818311b8827b8b7",
            "isKey": false,
            "numCitedBy": 739,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This report describes ongoing research on a working system which drives a vehicle through cluttered environments under computer control, guided by images perceived through an onboard television camera. The emphasis is on reliable and fast low level visual techniques which determine the existence and location of objects in the world, but do not identify them"
            },
            "slug": "Towards-Automatic-Visual-Obstacle-Avoidance-Moravec",
            "title": {
                "fragments": [],
                "text": "Towards Automatic Visual Obstacle Avoidance"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "This report describes ongoing research on a working system which drives a vehicle through cluttered environments under computer control, guided by images perceived through an onboard television camera."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1403827636"
                        ],
                        "name": "P. J. MacVicar-Whelan",
                        "slug": "P.-J.-MacVicar-Whelan",
                        "structuredName": {
                            "firstName": "P.",
                            "lastName": "MacVicar-Whelan",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. J. MacVicar-Whelan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1738591"
                        ],
                        "name": "T. Binford",
                        "slug": "T.-Binford",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Binford",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Binford"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 2152798,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "8c69c6977041ce1ea673d26b5f262f22dc684f96",
            "isKey": false,
            "numCitedBy": 22,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "Lateral inhibition processing of an image yields subpixel precision in the location of intensity discontinuity edges in a digitized image. The method is illustrated using a 512 × 512 × 8 bit image."
            },
            "slug": "Intensity-Discontinuity-Location-to-SubPixel-MacVicar-Whelan-Binford",
            "title": {
                "fragments": [],
                "text": "Intensity Discontinuity Location to SubPixel Precision"
            },
            "tldr": {
                "abstractSimilarityScore": 85,
                "text": "This work has shown thatateral inhibition processing of an image yields subpixel precision in the location of intensity discontinuity edges in a digitized image."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46351744"
                        ],
                        "name": "H. Howard",
                        "slug": "H.-Howard",
                        "structuredName": {
                            "firstName": "Harvey",
                            "lastName": "Howard",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Howard"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 143,
                                "start": 139
                            }
                        ],
                        "text": "It suggests that for stimuli with isolated zero-crossings, (for example, line drawings), stereo acuity could lie within the subpixel range [17], [46], [5], [45] , but for textured stimuli (for example, random dot stereograms), stereo acuity might be expected to decrease."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 36584213,
            "fieldsOfStudy": [
                "Medicine"
            ],
            "id": "0319d0e8b8726a27775f2ab0168abb0d9b5f9711",
            "isKey": false,
            "numCitedBy": 151,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-Test-for-the-Judgment-of-Distance.-Howard",
            "title": {
                "fragments": [],
                "text": "A Test for the Judgment of Distance."
            },
            "venue": {
                "fragments": [],
                "text": "Transactions of the American Ophthalmological Society"
            },
            "year": 1919
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "73968177"
                        ],
                        "name": "L. S. Woodburne",
                        "slug": "L.-S.-Woodburne",
                        "structuredName": {
                            "firstName": "Lloyd",
                            "lastName": "Woodburne",
                            "middleNames": [
                                "Stuart"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. S. Woodburne"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 145746479,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "400adaf5215b4ba9bd3eae921fc65f3641c149a0",
            "isKey": false,
            "numCitedBy": 18,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-effect-of-a-constant-visual-angle-upon-the-of-Woodburne",
            "title": {
                "fragments": [],
                "text": "The effect of a constant visual angle upon the binocular discrimination of depth differences"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1934
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31857045"
                        ],
                        "name": "E. Hildreth",
                        "slug": "E.-Hildreth",
                        "structuredName": {
                            "firstName": "Ellen",
                            "lastName": "Hildreth",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Hildreth"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 118271750,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "1d4ab6798f0492606a7dea9b3db07d0b2c7013cb",
            "isKey": false,
            "numCitedBy": 90,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Implementation-Of-A-Theory-Of-Edge-Detection-Hildreth",
            "title": {
                "fragments": [],
                "text": "Implementation Of A Theory Of Edge Detection"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46438571"
                        ],
                        "name": "J. Pokorny",
                        "slug": "J.-Pokorny",
                        "structuredName": {
                            "firstName": "Joel",
                            "lastName": "Pokorny",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Pokorny"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 131,
                                "start": 127
                            }
                        ],
                        "text": "Initially, the implementation was evaluated on standard psychological test images, in particular, random dot stereograms 118], [19]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 70797394,
            "fieldsOfStudy": [
                "Medicine"
            ],
            "id": "e38bbb7ca14d88dc24b6192e1ce90c5c3ffdcac2",
            "isKey": false,
            "numCitedBy": 745,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Foundations-of-Cyclopean-Perception-Pokorny",
            "title": {
                "fragments": [],
                "text": "Foundations of Cyclopean Perception"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62067893,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "52d761994496abd791996727208c281a65523cc4",
            "isKey": false,
            "numCitedBy": 9,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Some-Comments-on-a-Recent-Theory-of-Stereopsis-Marr-Poggio",
            "title": {
                "fragments": [],
                "text": "Some Comments on a Recent Theory of Stereopsis"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4113648"
                        ],
                        "name": "F. Crick",
                        "slug": "F.-Crick",
                        "structuredName": {
                            "firstName": "Francis",
                            "lastName": "Crick",
                            "middleNames": [
                                "H.",
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Crick"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60667221,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "a35cb763da6077d40fa9e1331ef2533c98cf6f1b",
            "isKey": false,
            "numCitedBy": 98,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "An-Information-Processing-Approach-to-Understanding-Crick-Marr",
            "title": {
                "fragments": [],
                "text": "An Information Processing Approach to Understanding the Visual Cortex"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144382622"
                        ],
                        "name": "R. N. Berry",
                        "slug": "R.-N.-Berry",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Berry",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. N. Berry"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 154,
                                "start": 151
                            }
                        ],
                        "text": "It suggests that for stimuli with isolated zero-crossings, (for example, line drawings), stereo acuity could lie within the subpixel range [17], [46], [5], [45] , but for textured stimuli (for example, random dot stereograms), stereo acuity might be expected to decrease."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 389779,
            "fieldsOfStudy": [
                "Psychology",
                "Medicine"
            ],
            "id": "be74949b2ad57623f209e1f683842cf03cf02d3c",
            "isKey": false,
            "numCitedBy": 139,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Quantitative-relations-among-vernier,-real-depth,-Berry",
            "title": {
                "fragments": [],
                "text": "Quantitative relations among vernier, real depth, and stereoscopic depth acuities."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of experimental psychology"
            },
            "year": 1948
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1750924"
                        ],
                        "name": "Demetri Terzopoulos",
                        "slug": "Demetri-Terzopoulos",
                        "structuredName": {
                            "firstName": "Demetri",
                            "lastName": "Terzopoulos",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Demetri Terzopoulos"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 26705393,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "efadad5b0d52daa3b31b26f0b988bda73ec0e923",
            "isKey": false,
            "numCitedBy": 117,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Multiresolution-computation-of-visible-surface-Terzopoulos",
            "title": {
                "fragments": [],
                "text": "Multiresolution computation of visible-surface representations"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2476541"
                        ],
                        "name": "K. Prazdny",
                        "slug": "K.-Prazdny",
                        "structuredName": {
                            "firstName": "K.",
                            "lastName": "Prazdny",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Prazdny"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 34237307,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8660941f4c5eec582d54956d969299860dcdff99",
            "isKey": false,
            "numCitedBy": 3,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Computing-Convergence-Angle-From-Random-Dot-Prazdny",
            "title": {
                "fragments": [],
                "text": "Computing Convergence Angle From Random Dot Stereograms"
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143602141"
                        ],
                        "name": "M. Kass",
                        "slug": "M.-Kass",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Kass",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Kass"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 42472388,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c4a6797ba62cbd9f727be4748f64c04f0a7ed466",
            "isKey": false,
            "numCitedBy": 19,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-Computational-Framework-for-the-Visual-Problem-Kass",
            "title": {
                "fragments": [],
                "text": "A Computational Framework for the Visual Correspondence Problem"
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1983
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The role of eye position information in algorithms for stereoscopic depth"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. AAAI"
            },
            "year": 1982
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "From June 1980 to June 1984 he was a Research Scientist at the Massachnsetts Irstitute of Technology Artificial Intelligence Laboratory. Since Julv 1984 he has been an Assistant Professor"
            },
            "venue": {
                "fragments": [],
                "text": "From June 1980 to June 1984 he was a Research Scientist at the Massachnsetts Irstitute of Technology Artificial Intelligence Laboratory. Since Julv 1984 he has been an Assistant Professor"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 244,
                                "start": 240
                            }
                        ],
                        "text": "Since the original presentation of the Marr-Poggio model, a number of additional psychophysical predictions of the model have been tested, and consequently, several modifications and improvements have been proposed (e.g., [32], [10], [36], [42])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Disparity limits for random-dot cinematograms for movement and form detection, and a learning effect"
            },
            "venue": {
                "fragments": [],
                "text": "Suppi Invest. Ophthal. Visual Sci"
            },
            "year": 1982
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Eng. Comput. Sci., Mass. Inst. Technol"
            },
            "venue": {
                "fragments": [],
                "text": "Eng. Comput. Sci., Mass. Inst. Technol"
            },
            "year": 1984
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 238,
                                "start": 234
                            }
                        ],
                        "text": "Since the original presentation of the Marr-Poggio model, a number of additional psychophysical predictions of the model have been tested, and consequently, several modifications and improvements have been proposed (e.g., [32], [10], [36], [42])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "JANUARY 1985 movements made in response to spatial-frequency-filtered randomdot stereograms"
            },
            "venue": {
                "fragments": [],
                "text": "Vergence eye IEEE TRANSACTIONS ON PATTERN ANALYSIS AND MACHINE INTELLIGENCE Perception"
            },
            "year": 1981
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 36,
                                "start": 32
                            }
                        ],
                        "text": "In the absence of eye movements [37], only about 2-4 min of vertical disparity can be tolerated."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Vertical image registration in human stereopsis"
            },
            "venue": {
                "fragments": [],
                "text": "Artif. Intell. Lab., Mass. Inst. Technol"
            },
            "year": 1983
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 153,
                                "start": 149
                            }
                        ],
                        "text": "The first computer implementation of this model was reported in [11] (recently an independent reimplementation of the algorithm has been reported in [20] )."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Depth perception for robots Purdue UniversityDepth perception for robots"
            },
            "venue": {
                "fragments": [],
                "text": "Handbook ofIndustrialRobotics"
            },
            "year": 1983
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 235,
                                "start": 231
                            }
                        ],
                        "text": "…applications of the algorithm to domains other than modeling of the human system, as are nonbiologically based studies of feature-point stereo vision systems (e.g., [1]-[4], [34], [35], [39]) (see also the technique of Kass [21], [22], which may also be applicable to feature point stereo)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Computing stereo correspondence"
            },
            "venue": {
                "fragments": [],
                "text": "Computing stereo correspondence"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Grimson is a member of the Association for Computing Machinery"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Computer Society, the American Mathematical Society, and is an Associate of the Behavioral and Brain Sciences Society"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "What is the diplopia threshold?\" Perception Psychophys"
            },
            "venue": {
                "fragments": [],
                "text": "What is the diplopia threshold?\" Perception Psychophys"
            },
            "year": 1981
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Vertical image registration in human stereopsis"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 11,
            "methodology": 11
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 54,
        "totalPages": 6
    },
    "page_url": "https://www.semanticscholar.org/paper/Computational-Experiments-with-a-Feature-Based-Grimson/1c20229805d6f239c2374546aa8109015df9e25a?sort=total-citations"
}