{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 85,
                                "start": 75
                            }
                        ],
                        "text": "The first primitive description of the image was called the primal sketch (Marr 1976b) and it is formed in two parts."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 278,
                                "start": 268
                            }
                        ],
                        "text": "The model does, however, make explicit certain nonlinear features that we regard as critical, and it forms the starting point for the more complete proposal of Marr & A major difficulty with natural images is that changes can and do occur over a wide range of scales (Marr 1976a, b)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 22,
                                "start": 10
                            }
                        ],
                        "text": "Following Marr (1976b), the closed contours we call BLOBS, and assign to them a length, width, orientation and (average) contrast; and the terminations are assigned a position and orientation (see figure 7c)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 285,
                                "start": 276
                            }
                        ],
                        "text": "…idea is that if a simple cell truly signals either the positive or the negative part of the linear convolution of its bar-shaped receptive field with the image intensity, it can hardly be thought of as making some symbolic assertion about the presence of a bar in the image (Marr 1976~3, p. 648)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 40175393,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "aa4b60b5847999c2f778e3e67ca1f2201e396abb",
            "isKey": false,
            "numCitedBy": 1004,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "An introduction is given to a theory of early visual information processing. The theory has been implemented, and examples are given of images at various stages of analysis. It is argued that the first step of consequence is to compute a primitive but rich description of the grey-level changes present in an image. The description is expressed in a vocabulary of kinds of intensity change (EDGE, SHADING-EDGE, EXTENDED-EDGE, LINE, BLOB etc.). Modifying parameters are bound to the elements in the description, specifying their POSITION, ORIENTATION, TERMINATION points, CONTRAST, SIZE and FUZZINESS. This description is obtained from the intensity array by fixed techniques, and it is called the primal sketch. For most images, the primal sketch is large and unwieldy. The second important step in visual information processing is to group its contents in a way that is appropriate for later recognition. From our ability to interpret drawings with little semantic content, one may infer the presence in our perceptual equipment of symbolic processes that can define \"place-tokens\" in an image in various ways, and can group them according to certain rules. Homomorphic techniques fail to account for many of these grouping phenomena, whose explanations require mechanisms of construction rather than mechanisms of detection. The necessary grouping of elements in the primal sketch may be achieved by a mechanism that has available the processes inferred from above, together with the ability to select items by first order discriminations acting on the elements' parameters. Only occasionally do these mechanisms use downward-flowing information about the contents of the particular image being processed. It is argued that \"non-attentive\" vision is in practice implemented by these grouping operations and first order discriminations acting on the primal sketch. The class of computations so obtained differs slightly from the class of second order operations on the intensity array. The extraction of a form from the primal sketch using these techniques amounts to the separation of figure from ground. It is concluded that most of the separation can be carried out by using techniques that do not depend upon the particular image in question. Therefore, figure-ground separation can normally precede the description of the shape of the extracted form. Up to this point, higher-level knowledge and purpose are brought to bear on only a few of the decisions taken during the processing. This relegates the widespread use of downward-flowing information to a later stage than is found in current machine-vision programs, and implies that such knowledge should influence the control of, rather than interfering with, the actual data-processing that is taking place lower down."
            },
            "slug": "Early-processing-of-visual-information.-Marr",
            "title": {
                "fragments": [],
                "text": "Early processing of visual information."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is argued that \"non-attentive\" vision is in practice implemented by these grouping operations and first order discriminations acting on the primal sketch, and implies that such knowledge should influence the control of, rather than interfering with, the actual data-processing that is taking place lower down."
            },
            "venue": {
                "fragments": [],
                "text": "Philosophical transactions of the Royal Society of London. Series B, Biological sciences"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 220,
                                "start": 202
                            }
                        ],
                        "text": "…Graham 1977; Wilson & Giese 1977; Wilson & Bergen 1979) ; (b) Marr & Poggio's (1979) theory of human vision (especially the framework within which it was written) ; and (c) the related observations of Marr et al. (1979) about the relevance of a result like Logan's (1977) theorem to early vision."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 135,
                                "start": 115
                            }
                        ],
                        "text": "I n fact, the idea of using narrow bandpass differential operators did not appear until the human stereo theory of Marr & Poggio (1979), which was also the first theory to depend primarily on zero-crossings."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 223,
                                "start": 205
                            }
                        ],
                        "text": "Wherever an intensity change occurs, there will be a corresponding peak in the first directional derivative, or equivalently, a zero-crossing in the second directional derivative of intensity (Marr 19768; Marr & Poggio 1979)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 32069137,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "94645777d9ace911a1be34c7147c52bce1a17534",
            "isKey": false,
            "numCitedBy": 1097,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-computational-theory-of-human-stereo-vision.-Marr-Poggio",
            "title": {
                "fragments": [],
                "text": "A computational theory of human stereo vision."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B, Biological sciences"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743045"
                        ],
                        "name": "S. Ullman",
                        "slug": "S.-Ullman",
                        "structuredName": {
                            "firstName": "Shimon",
                            "lastName": "Ullman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ullman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 9630018,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "2dcffe8606e9fd3fb611be6f1c9571f49664b263",
            "isKey": false,
            "numCitedBy": 713,
            "numCiting": 127,
            "paperAbstract": {
                "fragments": [],
                "text": "The construction of directionally selective units, and their use in the processing of visual motion, are considered. The zero crossings of ∇2G(x, y) ∗ I(x, y) are located, as in Marr & Hildreth (1980). That is, the image is filtered through centre-surround receptive fields, and the zero values in the output are found. In addition, the time derivative ∂[∇2G(x, y) ∗ l(x, y)]/∂t is measured at the zero crossings, and serves to constrain the local direction of motion to within 180°. The direction of motion can be determined in a second stage, for example by combining the local constraints. The second part of the paper suggests a specific model of the information processing by the X and Y cells of the retina and lateral geniculate nucleus, and certain classes of cortical simple cells. A number of psychophysical and neurophysiological predictions are derived from the theory."
            },
            "slug": "Directional-selectivity-and-its-use-in-early-visual-Marr-Ullman",
            "title": {
                "fragments": [],
                "text": "Directional selectivity and its use in early visual processing"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The second part of the paper suggests a specific model of the information processing by the X and Y cells of the retina and lateral geniculate nucleus, and certain classes of cortical simple cells."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 118909327,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c4acae182d7282dcef9973231f06b1fca55090e7",
            "isKey": false,
            "numCitedBy": 150,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : Vision is the construction of efficient symbolic descriptions from images of the world. An important aspect of vision is the choice of representations for the different kinds of information in a visual scene. In the early stages of the analysis of an image, the representations used depend more on what it is possible to compute from an image than on what is ultimately desirable, but later representations can be more sensitive to the specific needs of recognition. This essay surveys recent work in vision at M.I.T. from a perspective in which the representational problems assume a primary importance. An overall framework is suggested for visual information processing, in which the analysis proceeds through three representations; (1) the primal sketch, which makes explicit the intensity changes and local two-dimensional geometry of an image, (2) the 2 1/2-D sketch, which is a viewer-centered representation of the depth, orientation and discontinuities of the visible surfaces, and (3) the 3-D model representation, which allows an object-centered description of the three-dimensional structure and organization of a viewed shape. Recent results concerning processes for constructing and maintaining these representations are summarized and discussed. (Author)"
            },
            "slug": "Representing-Visual-Information-Marr",
            "title": {
                "fragments": [],
                "text": "Representing Visual Information"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This essay surveys recent work in vision at M.I.T. from a perspective in which the representational problems assume a primary importance."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "52555257"
                        ],
                        "name": "J. Kulikowski",
                        "slug": "J.-Kulikowski",
                        "structuredName": {
                            "firstName": "Janus",
                            "lastName": "Kulikowski",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Kulikowski"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1401361228"
                        ],
                        "name": "P. King-Smith",
                        "slug": "P.-King-Smith",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "King-Smith",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. King-Smith"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 30385084,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "0951dc665d1c9067a30b6937852be1049442f6e5",
            "isKey": false,
            "numCitedBy": 312,
            "numCiting": 30,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Spatial-arrangement-of-line,-edge-and-grating-by-Kulikowski-King-Smith",
            "title": {
                "fragments": [],
                "text": "Spatial arrangement of line, edge and grating detectors revealed by subthreshold summation."
            },
            "venue": {
                "fragments": [],
                "text": "Vision research"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32733837"
                        ],
                        "name": "H. Wilson",
                        "slug": "H.-Wilson",
                        "structuredName": {
                            "firstName": "Hugh",
                            "lastName": "Wilson",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Wilson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "51925280"
                        ],
                        "name": "Stephen C. Giese",
                        "slug": "Stephen-C.-Giese",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Giese",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Stephen C. Giese"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 51,
                                "start": 30
                            }
                        ],
                        "text": "Recent psychophysical work by Wilson & Giese (1977), FVilson & Bergen (1979) (see also Macleod & Rosenfeld 1974), has led to a precise quantitative model of the orientation-dependent spatial-frequency-tuned channels discovered by Campbell & Robson (1968)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 143,
                                "start": 124
                            }
                        ],
                        "text": "(2) As Campbell & Robson found, early visual information processing is not linear (e.g. probability summation (Graham 1977; Wilson & Giese 1977), and failure of superposition (Maffei& Fiorentini 1972 a))."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 165,
                                "start": 146
                            }
                        ],
                        "text": "…made this possible now: (a) the emergence of quantitative information about the channels present in early human vision (Cowan 1977; Graham 1977; Wilson & Giese 1977; Wilson & Bergen 1979) ; (b) Marr & Poggio's (1979) theory of human vision (especially the framework within which it was written)…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 34051727,
            "fieldsOfStudy": [
                "Physics",
                "Environmental Science"
            ],
            "id": "4af0b5b557b4067a22a9c4c59fdf7bf0ff938eae",
            "isKey": false,
            "numCitedBy": 139,
            "numCiting": 31,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Threshold-visibility-of-frequency-gradient-patterns-Wilson-Giese",
            "title": {
                "fragments": [],
                "text": "Threshold visibility of frequency gradient patterns"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1993085645"
                        ],
                        "name": "P. Schiller",
                        "slug": "P.-Schiller",
                        "structuredName": {
                            "firstName": "P",
                            "lastName": "Schiller",
                            "middleNames": [
                                "H"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Schiller"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33760699"
                        ],
                        "name": "B. Finlay",
                        "slug": "B.-Finlay",
                        "structuredName": {
                            "firstName": "Barbara",
                            "lastName": "Finlay",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Finlay"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6849044"
                        ],
                        "name": "S. Volman",
                        "slug": "S.-Volman",
                        "structuredName": {
                            "firstName": "Susan",
                            "lastName": "Volman",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Volman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15065592,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "0be7a5abe126b799d1820b321326f92ba42c65a3",
            "isKey": false,
            "numCitedBy": 519,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The properties of single cells in striate cortex of the rhesus monkey, representing the visual field 2 degrees -5 degrees from the fovea, were examined quantitatively with stationary and moving stimuli. Three distinct classes of cells were identified: S type, CX type, and T type. 2. S-type cells were defined as those oriented cells which to the optimal direction of movement in their receptive fields exhibited one or more spatially separate subfields within each of which a response was obtained to either a light or dark edge, but not to both. Several different types of S-cells were distinguished: a) S1-type cells for which moving edges revealed a single excitatory area within which a response was elicited by either a light or a dark edge but not by both. Most of these cells were unidirectional. b) S2-type cells for which moving edges revealed two spatially separate response areas, one of which was excited by a light edge and the other by a dark edge. Both regions responded to the same direction of movement. c) S3-type cells which had two response areas, one of which was excited by a stimulus moving in one direction (at right angles to the axis of orientation) and the other, of opposite contrast, which responded in the opposite direction, d) S4-type cells which to one direction of movement showed two spatially separate regions sensitive to a light and dark edge and which in the other direction of movement had only one responsive area (either light or dark). e) Cells which had multiple spatially separate subfields (S5-7 types). 3. CX-type cells were defined as those oriented cells which in their receptive fields exhibited no spatial separation for light- and dark-edge responses; they discharged to both edges in the same direction of movement and in the same spatial area. Flashing stimuli elicited both on and off responses throughout the receptive field. CX-type cells were predominantly of two types: those which were selective for direction of stimulus movement and those which were not. 4. A third class of cells (T-type) were those which were excited by only one sign of contrast change and responded in a sustained fashion even when there was no contour within the receptive field. These cells were poorly or not at all oriented; some of them were selective to wavelength. 5. Quantitative comparisons showed the following differences between S-type and CX-type cells: a) S-type cells had smaller receptive fields than CX-type cells but the populations over-lapped considerably. Receptive-field size was smallest in layer 4c. In all other layers S-type cells had the same size fields. CX-type cells, by contrast, tended to have larger fields in layer 5-6 than 2-3. b) The spatial separation between light and dark response areas was the best criterion for distinguishing S-type and CX-type cells. The distribution of this measure disclosed two populations of cells with relatively limited overlap. c) In layers 2 and 3, both S-type and CX-type cells had low spontaneous activity..."
            },
            "slug": "Quantitative-studies-of-single-cell-properties-in-Schiller-Finlay",
            "title": {
                "fragments": [],
                "text": "Quantitative studies of single-cell properties in monkey striate cortex. I. Spatiotemporal organization of receptive fields."
            },
            "tldr": {
                "abstractSimilarityScore": 87,
                "text": "The properties of single cells in striate cortex of the rhesus monkey, representing the visual field 2 degrees -5 degrees from the fovea, were examined quantitatively with stationary and moving stimuli and showed differences between S-type and CX-type cells."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3422501"
                        ],
                        "name": "G. Westheimer",
                        "slug": "G.-Westheimer",
                        "structuredName": {
                            "firstName": "Gerald",
                            "lastName": "Westheimer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Westheimer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "37436997"
                        ],
                        "name": "S. McKee",
                        "slug": "S.-McKee",
                        "structuredName": {
                            "firstName": "Suzanne",
                            "lastName": "McKee",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. McKee"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 42919795,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "c3fa02b3b89c497d669e8baa3d5605f8f219b2b8",
            "isKey": false,
            "numCitedBy": 361,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Spatial-configurations-for-visual-hyperacuity-Westheimer-McKee",
            "title": {
                "fragments": [],
                "text": "Spatial configurations for visual hyperacuity"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7351757"
                        ],
                        "name": "L. D. Harmon",
                        "slug": "L.-D.-Harmon",
                        "structuredName": {
                            "firstName": "Leon",
                            "lastName": "Harmon",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. D. Harmon"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1778001,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "9f283c86bb4b2421b0caf2ae746d6487fcd3898c",
            "isKey": false,
            "numCitedBy": 357,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "It is difficult to recognize portraits that have been coarsely sampled and quantized. Blurring such images improves recognition. A simple, straightforward explanation is that high-frequency noise introduced by the sampling and quantizing must be removed by low-pass filtering to improve the signal-to-noise ratio and hence signal detectability or recognition. Experiments reported here, suggested on the basis of a different model, show instead that noise bands that are spectrally adjacent to the picture's spectrum are considerably more effective in suppressing recognition."
            },
            "slug": "Masking-in-Visual-Recognition:-Effects-of-Filtered-Harmon-Julesz",
            "title": {
                "fragments": [],
                "text": "Masking in Visual Recognition: Effects of Two-Dimensional Filtered Noise"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "Experiments reported here show instead that noise bands that are spectrally adjacent to the picture's spectrum are considerably more effective in suppressing recognition."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "71335571"
                        ],
                        "name": "G. J. Burton",
                        "slug": "G.-J.-Burton",
                        "structuredName": {
                            "firstName": "Geoffrey",
                            "lastName": "Burton",
                            "middleNames": [
                                "John"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. J. Burton"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4507832"
                        ],
                        "name": "K. Ruddock",
                        "slug": "K.-Ruddock",
                        "structuredName": {
                            "firstName": "Keith",
                            "lastName": "Ruddock",
                            "middleNames": [
                                "Harrhy"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Ruddock"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 9809477,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "928f31e3b425c4fcba577b07fdd56cad74a90a24",
            "isKey": false,
            "numCitedBy": 18,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Visual-adaptation-to-patterns-containing-spatial-Burton-Ruddock",
            "title": {
                "fragments": [],
                "text": "Visual adaptation to patterns containing two-dimensional spatial structure"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33413038"
                        ],
                        "name": "M. Sachs",
                        "slug": "M.-Sachs",
                        "structuredName": {
                            "firstName": "Murray",
                            "lastName": "Sachs",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Sachs"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4734126"
                        ],
                        "name": "J. Nachmias",
                        "slug": "J.-Nachmias",
                        "structuredName": {
                            "firstName": "Jacob",
                            "lastName": "Nachmias",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Nachmias"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "36155815"
                        ],
                        "name": "J. Robson",
                        "slug": "J.-Robson",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Robson",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Robson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 31588018,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "7814bc82bcf959e6b5870264df5a653d2fa6a600",
            "isKey": false,
            "numCitedBy": 557,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "Psychometric functions were determined concurrently for detection of simple gratings (luminance sinusoidally modulated with spatial frequency f) and complex gratings (luminance modulated by the sum of two sinusoids, with frequencies f and f′). Results were used to test the hypothesis that the two components of a complex grating may be detected independently. In an extensive experiment with f = 14 cycles/deg, the independence hypothesis was consistently rejected only when f/f′=54 or 45, but rarely rejected when the value of f/f′ lay outside this range. In other experiments, f was between 1.9 and 22.4 cycles/deg. All results are compatible with the assumption that the human visual system contains sensory channels, each selectively sensitive to different narrow ranges of spatial frequencies, whose outputs are detected independently."
            },
            "slug": "Spatial-frequency-channels-in-human-vision.-Sachs-Nachmias",
            "title": {
                "fragments": [],
                "text": "Spatial-frequency channels in human vision."
            },
            "tldr": {
                "abstractSimilarityScore": 58,
                "text": "Psychometric functions were determined concurrently for detection of simple gratings and complex gratings, compatible with the assumption that the human visual system contains sensory channels, each selectively sensitive to different narrow ranges of spatial frequencies, whose outputs are detected independently."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2060382380"
                        ],
                        "name": "I. D. Macleod",
                        "slug": "I.-D.-Macleod",
                        "structuredName": {
                            "firstName": "Iain",
                            "lastName": "Macleod",
                            "middleNames": [
                                "Donald"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. D. Macleod"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152310678"
                        ],
                        "name": "A. Rosenfeld",
                        "slug": "A.-Rosenfeld",
                        "structuredName": {
                            "firstName": "Alfred",
                            "lastName": "Rosenfeld",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rosenfeld"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 111,
                                "start": 87
                            }
                        ],
                        "text": "Recent psychophysical work by Wilson & Giese (1977), FVilson & Bergen (1979) (see also Macleod & Rosenfeld 1974), has led to a precise quantitative model of the orientation-dependent spatial-frequency-tuned channels discovered by Campbell & Robson (1968)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 23106641,
            "fieldsOfStudy": [
                "Economics"
            ],
            "id": "bc52f66a62dab9fb006a1c57959501d4eb4d0fa5",
            "isKey": false,
            "numCitedBy": 52,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-visibility-of-gratings:-spatial-frequency-or-Macleod-Rosenfeld",
            "title": {
                "fragments": [],
                "text": "The visibility of gratings: spatial frequency channels or bar-detecting units?"
            },
            "venue": {
                "fragments": [],
                "text": "Vision research"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5612985"
                        ],
                        "name": "L. Peichl",
                        "slug": "L.-Peichl",
                        "structuredName": {
                            "firstName": "Leo",
                            "lastName": "Peichl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Peichl"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4846633"
                        ],
                        "name": "H. Wässle",
                        "slug": "H.-Wässle",
                        "structuredName": {
                            "firstName": "Heinz",
                            "lastName": "Wässle",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Wässle"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 131,
                                "start": 111
                            }
                        ],
                        "text": "Interestingly, there is little scatter in receptive field sizes of X-cells a t a given location in the retina (Peichl & Wassle 1979)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 33098771,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "79e67d616ffc761af1c9b10d4f64d3fa8483db47",
            "isKey": false,
            "numCitedBy": 281,
            "numCiting": 47,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Receptive field centre sizes of brisk‐sustained (X) and brisk‐transient (Y) ganglion cells of the cat retina were assessed by three different methods: small spot mapping, area threshold method and spatial resolution. 2. Centre sizes of brisk‐sustained (X) cells increased from 20' in the central area to about 70' at an eccentricity of 4.5 mm, centre sizes of brisk‐transient (Y) cells from 50' in the central area to about 140' at 5 mm eccentricity. 3. The scatter of centre sizes at one retinal location was measured by recording as many ganglion cells as possible in one cat in a small field of retina. The centre sizes of the individual classes were homogeneous and exhibited only a small amount of scatter. 4. The coverage of the retina by the different ganglion cell classes was assessed from their density and their receptive field centre area. At every retinal location the receptive field centres of seven to twenty brisk‐sustained (X) cells and of three to six brisk‐transient (Y) cells were found to overlap. Sluggish concentric and non‐concentric cells taken together have a coverage factor of about 60."
            },
            "slug": "Size,-scatter-and-coverage-of-ganglion-cell-field-Peichl-Wässle",
            "title": {
                "fragments": [],
                "text": "Size, scatter and coverage of ganglion cell receptive field centres in the cat retina."
            },
            "tldr": {
                "abstractSimilarityScore": 99,
                "text": "Receptive field centre sizes of brisk‐sustained (X) and brisk‐transient (Y) ganglion cells of the cat retina were assessed by three different methods: small spot mapping, area threshold method and spatial resolution."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 88,
                                "start": 67
                            }
                        ],
                        "text": "This state of affairs is consistent with the neurophysiology since Hubel & Wiesel (1962) originally defined simple cells by the linearity of their response, and they reported many bar-shaped receptive fields."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                }
            ],
            "corpusId": 17055992,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6b4fe4aa4d66fecc7b2869569002714d91d0b3f7",
            "isKey": false,
            "numCitedBy": 12428,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "What chiefly distinguishes cerebral cortex from other parts of the central nervous system is the great diversity of its cell types and interconnexions. It would be astonishing if such a structure did not profoundly modify the response patterns of fibres coming into it. In the cat's visual cortex, the receptive field arrangements of single cells suggest that there is indeed a degree of complexity far exceeding anything yet seen at lower levels in the visual system. In a previous paper we described receptive fields of single cortical cells, observing responses to spots of light shone on one or both retinas (Hubel & Wiesel, 1959). In the present work this method is used to examine receptive fields of a more complex type (Part I) and to make additional observations on binocular interaction (Part II). This approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours. In the past, the technique of recording evoked slow waves has been used with great success in studies of functional anatomy. It was employed by Talbot & Marshall (1941) and by Thompson, Woolsey & Talbot (1950) for mapping out the visual cortex in the rabbit, cat, and monkey. Daniel & Whitteiidge (1959) have recently extended this work in the primate. Most of our present knowledge of retinotopic projections, binocular overlap, and the second visual area is based on these investigations. Yet the method of evoked potentials is valuable mainly for detecting behaviour common to large populations of neighbouring cells; it cannot differentiate functionally between areas of cortex smaller than about 1 mm2. To overcome this difficulty a method has in recent years been developed for studying cells separately or in small groups during long micro-electrode penetrations through nervous tissue. Responses are correlated with cell location by reconstructing the electrode tracks from histological material. These techniques have been applied to"
            },
            "slug": "Receptive-fields,-binocular-interaction-and-in-the-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields, binocular interaction and functional architecture in the cat's visual cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This method is used to examine receptive fields of a more complex type and to make additional observations on binocular interaction and this approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1962
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2707896"
                        ],
                        "name": "B. Logan",
                        "slug": "B.-Logan",
                        "structuredName": {
                            "firstName": "Benjamin",
                            "lastName": "Logan",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Logan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1636877,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "ecc6cdfe63a5803e71cc1eae3c52ac1e4b036e49",
            "isKey": false,
            "numCitedBy": 281,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "An interesting subclass of bandpass signals {h} is described wherein the zero crossings of h determine h within a multiplicative constant. The members may have complex zeros, but it is necessary that h should have no zeros in common with its Hilbert transform h other than real simple zeros. It is then sufficient that the band be less than an octave in width. The subclass is shown to include full-carrier upper-sideband signals (of less than an octave bandwidth). Also it is shown that full-carrier lower-sideband signals have only real simple zeros (for any ratio of upper and tower frequencies) and, hence, are readily identified by their zero crossings. However, under the most general conditions for uniqueness, the problem of actually recovering h from its sign changes appears to be very difficult and impractical."
            },
            "slug": "Information-in-the-zero-crossings-of-bandpass-Logan",
            "title": {
                "fragments": [],
                "text": "Information in the zero crossings of bandpass signals"
            },
            "venue": {
                "fragments": [],
                "text": "The Bell System Technical Journal"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32733837"
                        ],
                        "name": "H. Wilson",
                        "slug": "H.-Wilson",
                        "structuredName": {
                            "firstName": "Hugh",
                            "lastName": "Wilson",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Wilson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "116003860"
                        ],
                        "name": "J. Bergen",
                        "slug": "J.-Bergen",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Bergen",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Bergen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 137,
                                "start": 117
                            }
                        ],
                        "text": "The main points against a Fourier interpretation are : (1) The bandwidth of the channels is not narrow (1.6 octaves, Wilson & Bergen 1979)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 250,
                                "start": 230
                            }
                        ],
                        "text": "The parsing of sets of zero-crossing segments Figure 6 shows the zero-crossings obtained from two channels whose dimensions are approximately the same as the two sustained channels present at the fovea in the human visual system (Wilson & Bergen 1979)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 283,
                                "start": 263
                            }
                        ],
                        "text": "These channels can be realized by linear units with bar-shaped receptive fields made of the difference of two Gaussian distributions, with excitatory to inhibitory space constants in the ratio of 1: 1.75 for the sustained, and 1: 3.0 for the transient, channels (Wilson & Bergen 1979)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 168,
                                "start": 148
                            }
                        ],
                        "text": "…now: (a) the emergence of quantitative information about the channels present in early human vision (Cowan 1977; Graham 1977; Wilson & Giese 1977; Wilson & Bergen 1979) ; (b) Marr & Poggio's (1979) theory of human vision (especially the framework within which it was written) ; and (c) the…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 1573287,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "b45c9da1e49cce9f37976d9187f85fb217d8d092",
            "isKey": true,
            "numCitedBy": 751,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-four-mechanism-model-for-threshold-spatial-vision-Wilson-Bergen",
            "title": {
                "fragments": [],
                "text": "A four mechanism model for threshold spatial vision"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2041558"
                        ],
                        "name": "L. Maffei",
                        "slug": "L.-Maffei",
                        "structuredName": {
                            "firstName": "Lamberto",
                            "lastName": "Maffei",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Maffei"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145406237"
                        ],
                        "name": "A. Fiorentini",
                        "slug": "A.-Fiorentini",
                        "structuredName": {
                            "firstName": "Adriana",
                            "lastName": "Fiorentini",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Fiorentini"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 130,
                                "start": 106
                            }
                        ],
                        "text": "There is some controversy about the way in which lateral geniculate receptive fields are constructed (cf. Maffei & Fiorentini 1972 b), but it seems most likely that the on-centre geniculate X-cell fields are formed by combining a small number of on-centre retinal ganglion X-cell fields of which the…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 2819214,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "782eb27569ffd21fe7371b21deae7931e0fb76a6",
            "isKey": false,
            "numCitedBy": 41,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "ANY spatial distribution of luminance can be considered as the sum of its sinusoidal Fourier components, which are defined when their amplitudes and phases are given. Recently Fourier theory has been applied in describing the transmission of spatial information in the visual system. Indeed neurones selectively sensitive to a narrow band of spatial frequencies have been found in the visual cortex of the cat and monkey1,2. With psychophysical methods, using an adaptation effect, spatial frequency channels have been observed also in the visual system of man3,4."
            },
            "slug": "Processes-of-Synthesis-in-Visual-Perception-Maffei-Fiorentini",
            "title": {
                "fragments": [],
                "text": "Processes of Synthesis in Visual Perception"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This work has shown that neurones selectively sensitive to a narrow band of spatial frequencies have been found in the visual cortex of the cat and monkey and using psychophysical methods, using an adaptation effect, spatial frequency channels have been observed also in theVisual system of man."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 172,
                                "start": 163
                            }
                        ],
                        "text": "Apart from the occasional diffraction pattern, the visual world is not constructed of ripply, wave-like primitives that extend and add together over an area (c.f. Marr 1970, p. 169), but of contours, creases, scratches, marks, shadows and shading."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 13248803,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "ffdbf3958ca2cf325c78ab314034b0543226cd1f",
            "isKey": false,
            "numCitedBy": 453,
            "numCiting": 48,
            "paperAbstract": {
                "fragments": [],
                "text": "It is proposed that the learning of many tasks by the cerebrum is based on using a very few fundamental techniques for organizing information. It is argued that this is made possible by the prevalence in the world of a particular kind of redundancy, which is characterized by a ‘Fundamental Hypothesis’. This hypothesisis used to found a theory of the basic operations which, it is proposed, are carried out by the cerebral neocortex. They involve the use of past experience to form so-called ‘classificatory units’ with which to interpret subsequent experience. Such classificatory units are imagined to be created whenever either something occurs frequently in the brain’s experience, or enough redundancy appears in the form of clusters of slightly differing inputs. A(non-Bayesian) information theoretic account is given of the diagnosis of an input as an instance of an existing classificatory unit, and of the interpretation as such of an incompletely specified input. Neural models are devised to implement the two operations of diagnosis and interpretation, and it is found that the performance of the second is an automatic consequence of the model’s ability to perform the first. The discovery and formation of new classificatory units is discussed within the context of these neural models. It is shown how a climbing fibre input (of the kind described by Cajal) to the correct cell can cause that cell to perform a mountain-climbing operation in an underlying probability space, that will lead it to respond to a class of events for which it is appropriate to code. This is called the ‘spatial recognizer effect’. The structure of the cerebral neocortex is reviewed in the light of the model which the theory establishes. It is found that many elements in the cortex have a natural identification with elements in the model. This enables many predictions, with specified degrees of firmness, to be made concerning the connexions and synapses of the following cortical cells and fibres: Martinotti cells; cerebral granule cells; pyramidal cells of layers III, V and II; short axon cells of all layers, especially I, IV and VI; cerebral climbing fibres and those cells of the cortex which give rise to them; cerebral basket cells; fusiform cells of layers VI and VII. It is shown that if rather little information about the classificatory units to be formed has been coded genetically, it may be necessary to use a technique called codon formation to organize structure in a suitable way to represent a new unit. It is shown that under certain conditions, it is necessary to carry out a part of this organization during sleep. A prediction is made about the effect of sleep on learning of a certain kind."
            },
            "slug": "A-theory-for-cerebral-neocortex-Marr",
            "title": {
                "fragments": [],
                "text": "A theory for cerebral neocortex"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "It is shown how a climbing fibre input to the correct cell can cause that cell to perform a mountain-climbing operation in an underlying probability space, that will lead it to respond to a class of events for which it is appropriate to code."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1970
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1993085645"
                        ],
                        "name": "P. Schiller",
                        "slug": "P.-Schiller",
                        "structuredName": {
                            "firstName": "P",
                            "lastName": "Schiller",
                            "middleNames": [
                                "H"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Schiller"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33760699"
                        ],
                        "name": "B. Finlay",
                        "slug": "B.-Finlay",
                        "structuredName": {
                            "firstName": "Barbara",
                            "lastName": "Finlay",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Finlay"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6849044"
                        ],
                        "name": "S. Volman",
                        "slug": "S.-Volman",
                        "structuredName": {
                            "firstName": "Susan",
                            "lastName": "Volman",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Volman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15167329,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "5c214d8da3406d4c3f1de47ed6f3bc43ee92c877",
            "isKey": false,
            "numCitedBy": 344,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Quantitative analyses of orientation specificity and ocular dominance were carried out in striate cortex of the rhesus monkey. 2. Sharpness of orientation selectivity was greater for simple (S type) than for complex (CX type) cells. CX-type cells became more broadly tuned in the deeper cortical layers: S-type cells were equally well tuned throughout the cortex. 3. Sharpness of orientation selectivity for S-type cells was similar at all retinal eccentricities studied (0 degrees - 20 degrees from the fovea):in CX-type cells orientation selectivity decreased slightly with increasing eccentricity. 4. The orientation tuning of binocular cells was similar when mapped separately through each eye. 5. Orientation selectivity and direction selectivity are independent of each other, suggesting that separate neural mechanisms give rise to them. 6. More CX-type cells can be binocularly activated than S-type cells (88% versus 49%). The ocular dominance of S-type cells is similar in all cortical layers: for CX-type cells there is an increase in the number of cells in ocular-dominance category 4 in layers 5 and 6."
            },
            "slug": "Quantitative-studies-of-single-cell-properties-in-Schiller-Finlay",
            "title": {
                "fragments": [],
                "text": "Quantitative studies of single-cell properties in monkey striate cortex. II. Orientation specificity and ocular dominance."
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "Orientation selectivity and direction selectivity are independent of each other, suggesting that separate neural mechanisms give rise to them."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "117594543"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 184,
                                "start": 173
                            }
                        ],
                        "text": "Hubel & Wiesel's description of simple cells as linear with bar-or edge-shaped receptive fields led to a view of the cortex as containing a population of feature detectors (Barlow 1969, p. 881) tuned to edges and bars of various widths and orientations."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 19601948,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "abbd5229eb8e767ed94f54a5ed35826b0919ced2",
            "isKey": false,
            "numCitedBy": 89,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "In 1959, Lettvin and his associates announced to the electrical engineering world that the five classes of retinal ganglion cell in the frog each responded to a different, specific, spatiotemporal pattern of excitation. These cells were, in fact, performing “feature extraction,” which at that time was coming to be recognized as a necessary first step in more complex pattern recognition. I remember Keffer Hartline telling me of these claims at about the time they appeared. Both of us had worked on retinal ganglion cells in the frog, and a t first I don’t think either of us believed much of what Lettvin and his co-workers reported. Hartline had worked on movement sensitivity and was particularly surprised by “unidirectional rate sensitivity”-the claim that some ganglion cells responded to movement in one direction and not the other. At first I was also surprised by this, but uneasy memories came back of some observations I had made on on-of/ units a few years earlier. I had been reading Sperry’s experiments on optic nerve regeneration in frogs whose eyes had been excised and rotated, and I was very impressed by the incidentally mentioned fact that, in the normal frog, the left eye only evokes optokinetic movements to the right, and vice versa. I was puzzled by the movement sensitivity of on-ojj units a t the time, and I looked to see i f this optokinetic behavior was of retinal origin: Did the ganglion cells of one eye only respond to movement in the appropriate direction? I looked long enough and hard enough to convince myself that my hypothesis was wrong, for the ganglion cells certainly responded to image movements that would have failed to evoke optokinetic movements in the intact animal. But when Lettvin jogged my memory, I recalled that 1 had sometimes obtained “funny” results: Some ganglion cells did seem to show a preference for movements in a certain direction, but this direction had not usually corresponded to the direction required by my hypothesis. Beyond using these facts to throw out the hypothesis, I did not pay much attention to them, and I did not pursue the matter because it was so difficult to produce smooth movements in a variety of directions with the apparatus that was available. In retrospect, 1 think I only once or twice saw a degree of asymmetry of response that I would now accept as proof of directional selectivity, but I missed it then and only became fully convinced that retinal ganglion cells can be directionally selective when Hill and I observed this phenomenon in the rabbit (Barlow & Hill, 1963). Since then, I think we have found out something about the mechanism by which the nervous system abstracts patterns, and I shall return to"
            },
            "slug": "PATTERN-RECOGNITION-AND-THE-RESPONSES-OF-SENSORY-*-Barlow",
            "title": {
                "fragments": [],
                "text": "PATTERN RECOGNITION AND THE RESPONSES OF SENSORY NEURONS *"
            },
            "tldr": {
                "abstractSimilarityScore": 95,
                "text": "In 1959, Lettvin and his associates announced to the electrical engineering world that the five classes of retinal ganglion cell in the frog each responded to a different, specific, spatiotemporal pattern of excitation, and it was found that these cells were performing “feature extraction,” which was coming to be recognized as a necessary first step in more complex pattern recognition."
            },
            "venue": {
                "fragments": [],
                "text": "Annals of the New York Academy of Sciences"
            },
            "year": 1969
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1925241"
                        ],
                        "name": "D. Pollen",
                        "slug": "D.-Pollen",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Pollen",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Pollen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2144783000"
                        ],
                        "name": "James R. Lee",
                        "slug": "James-R.-Lee",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Lee",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "James R. Lee"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2152228141"
                        ],
                        "name": "Joseph H. Taylor",
                        "slug": "Joseph-H.-Taylor",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Taylor",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Joseph H. Taylor"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6247301,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "e0e070c3d9a16acff0b1c4bb21469082b1a796e9",
            "isKey": false,
            "numCitedBy": 153,
            "numCiting": 40,
            "paperAbstract": {
                "fragments": [],
                "text": "The striate cortex transforms the topographic representation of visual space in the lateral geniculate body into a Fourier transform or frequency representation at the complex cell level via the intermediary simple cell stage of \"strip integration.\" Each of these three stages contains essentially the same amount of information, which expresses a conservation of information principle; however, the form of the information is changed. In the transform domain, invariant descriptions of visual objects can be derived to serve as the basic sets required for pattern recognition and memory. We believe that our experimental and theoretical findings are fundamental for understanding the functional organization of the striate cortex."
            },
            "slug": "How-Does-the-Striate-Cortex-Begin-the-of-the-Visual-Pollen-Lee",
            "title": {
                "fragments": [],
                "text": "How Does the Striate Cortex Begin the Reconstruction of the Visual World?"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "This work has shown that in the transform domain, invariant descriptions of visual objects can be derived to serve as the basic sets required for pattern recognition and memory in the striate cortex."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743045"
                        ],
                        "name": "S. Ullman",
                        "slug": "S.-Ullman",
                        "structuredName": {
                            "firstName": "Shimon",
                            "lastName": "Ullman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ullman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 220,
                                "start": 202
                            }
                        ],
                        "text": "…Graham 1977; Wilson & Giese 1977; Wilson & Bergen 1979) ; (b) Marr & Poggio's (1979) theory of human vision (especially the framework within which it was written) ; and (c) the related observations of Marr et al. (1979) about the relevance of a result like Logan's (1977) theorem to early vision."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 18,
                                "start": 0
                            }
                        ],
                        "text": "Marr et al. (1979) noted that Logan's (1977) recent theorem, about the zero-crossings of one-octave bandpass signals, shows that the set of such zerocrossing segments is extremely rich in information."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 38715307,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bd32c8c89e52f5b4142b848d9b4dae2ececc2892",
            "isKey": false,
            "numCitedBy": 123,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Under appropriate conditions zero-crossings of a bandpass signal are very rich in information. The authors examine here the relevance of this result to the early stages of visual information processing, where zero-crossings in the output of independent spatial-frequency-tuned channels may contain sufficient information for much of the subsequent processing."
            },
            "slug": "Bandpass-channels,-zero-crossings,-and-early-visual-Marr-Ullman",
            "title": {
                "fragments": [],
                "text": "Bandpass channels, zero-crossings, and early visual information processing."
            },
            "tldr": {
                "abstractSimilarityScore": 75,
                "text": "Under appropriate conditions zero-crossings of a bandpass signal are very rich in information and may contain sufficient information for much of the subsequent processing in the early stages of visual information processing."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144756342"
                        ],
                        "name": "J. Atkinson",
                        "slug": "J.-Atkinson",
                        "structuredName": {
                            "firstName": "Janette",
                            "lastName": "Atkinson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Atkinson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4800025"
                        ],
                        "name": "F. Campbell",
                        "slug": "F.-Campbell",
                        "structuredName": {
                            "firstName": "Fergus",
                            "lastName": "Campbell",
                            "middleNames": [
                                "William"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Campbell"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 86,
                                "start": 62
                            }
                        ],
                        "text": "(3) Only rudimentary phase information is apparently encoded (Atkinson & Campbell 1974)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 33882159,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "aeb338c9da923a040d79773b0ba39ce111865f23",
            "isKey": false,
            "numCitedBy": 59,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-effect-of-phase-on-the-perception-of-compound-Atkinson-Campbell",
            "title": {
                "fragments": [],
                "text": "The effect of phase on the perception of compound gratings."
            },
            "venue": {
                "fragments": [],
                "text": "Vision research"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 104,
                                "start": 85
                            }
                        ],
                        "text": "I n addition, simple cell receptive field sizes increase linearly with eccentricity (Hubel & Wiesel 1974, fig."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 89,
                                "start": 70
                            }
                        ],
                        "text": "6a), and the scatter in size at each location seems to be about 4 :1 (Hubel & Wiesel 1974, fig."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 13140630,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "d1d186fe8eae26824a380f70454be04d6a756bef",
            "isKey": false,
            "numCitedBy": 895,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper is concerned with the relationship between orientation columns, ocular‐dominance columns, the topographic mapping of visual fields onto cortex, and receptive‐field size and scatter. Although the orientation columns are an order of magnitude smaller than the ocular‐dominance columns, the horizontal distance corresponding to a complete cycle of orientation columns, representing a rotation through 180°, seems to be roughly the same size as a left‐plus‐right ocular dominance set, with a thickness of about 0.5–1 mm, independent of eccentricity at least out to 15°. We use the term hypercolumn to refer to a complete set of either type (180°, or left‐plus‐right eyes)."
            },
            "slug": "Uniformity-of-monkey-striate-cortex:-A-parallel-and-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Uniformity of monkey striate cortex: A parallel relationship between field size, scatter, and magnification factor"
            },
            "tldr": {
                "abstractSimilarityScore": 63,
                "text": "The term hypercolumn is used to refer to a complete set of either type (180°, or left‐plus‐right eyes), with implications for the topographic mapping of visual fields onto cortex, and receptive‐field size and scatter."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of comparative neurology"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4138381"
                        ],
                        "name": "G. Poggio",
                        "slug": "G.-Poggio",
                        "structuredName": {
                            "firstName": "Gian",
                            "lastName": "Poggio",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Poggio"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2054056395"
                        ],
                        "name": "B. Fischer",
                        "slug": "B.-Fischer",
                        "structuredName": {
                            "firstName": "Beth",
                            "lastName": "Fischer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Fischer"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11546860,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "68637ae468286d4070b54213fb72c44a0a78d625",
            "isKey": false,
            "numCitedBy": 765,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": "2. Impulse activity was recorded from neurons in fovea1 striate (A17) and prestriate (Al@ cortex of monkeys trained to fixate monocularly and binocularly by rewarding them for detecting an abrupt change in the intensity of a small luminous spot. During periods of fixation, single bright or dark narrow bars moving across a frontoparallel plane were presented at a series of different depths. 2. Nearly all cortical neurons studied received input from both eyes. Binocular neurons were classifiedLint two categories on the basis of their monocular responses: those that gave similar responses to stimulation of right and left eye (ocular balance) and those that gave different responses (ocular unbalance). Different kinds of binocular interactions were observed. 3. Most neurons (84%) were sensitive to location of the stimulus in depth. Four types of depth-sensitive cells were recognized: a) tuned excitatory neurons, the most common type, that gave excitatory responses over a narrow range of depth about the fixation distance often with inhibitory flanks nearer and farther, and that typically received a balanced binocular input; b) tuned inhibitory neurons whose responses were largely suppressed by stimuli at or close to the plane of fixation; c) near neurons, which responded well to stimuli in front of the fixation plane and were suppressed by those behind it; d) far neurons, the opposite of near neurons. The last three types of depth cells were usually ocularly unbalanced. Peaks and steps of depthsensitivity profiles occurred at or close to the fixation distance (within t 0.4O of disparity), whereas the total range of binocular interaction, even for a single cell, could extend to more than t lo of disparity. 4. The results suggest that there are cells in fovea1 striate and prestriate which may be part of"
            },
            "slug": "Binocular-interaction-and-depth-sensitivity-in-and-Poggio-Fischer",
            "title": {
                "fragments": [],
                "text": "Binocular interaction and depth sensitivity in striate and prestriate cortex of behaving rhesus monkey."
            },
            "tldr": {
                "abstractSimilarityScore": 82,
                "text": "The results suggest that there are cells in fovea1 striate and prestriate which may be part of the cortex of monkeys trained to fixate monocularly and binocularly by rewarding them for detecting an abrupt change in the intensity of a small luminous spot."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 171,
                                "start": 152
                            }
                        ],
                        "text": "Finally, lateral geniculate cells give a smaller response to diffuse illumination than do retinal ganglion cells, sometimes giving no response a t all (Hubel & Wiesel 1961)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 3063181,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "34898b2e1cb9f7872d2d66fdfcf3a9644948463b",
            "isKey": false,
            "numCitedBy": 773,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : Cells were recorded with tungsten electrodes in the dorsal lateral geniculate body of the cat. Receptive fields of these units were mapped out, in the light-adapted state, with small sports of light. In their general arrangement geniculate receptive fields resembled those of retinal ganglion cells, having an excitatory ('on') centre and inhibitory ('off') preriphery, or reverse. The two portions of a receptive field were mutually antagonistic; the decrease in centre responses cauded by inclusion of peripheral portions of receptive fields was termed peripheral suppression. Cells recorded in layers A and B of the lateral geniculate body were driven from the contralateral eye; cells in layer A1 from the ipsilateral eye. In penetrations normal to the layers receptive fields of cells in a single layer were close together or superimposed, and from one layer to the next occupied exactly homologous positions in the two retinas. Binocular interaction was not observed in any of the cells studied. All three layers of the lateral geniculate contained both 'on'-centre and 'off'-centre units. Cells in layers A and A1 were similar both in their firing patterns and in average receptive field size. Cells in layer B were more sluggish in their responses to light stimuli, and tended to have larger receptive field centres. Cells with receptive fields within or near the area centralis tended to have smaller field centres and stronger suppression by the receptive field periphery than cells with their fields situated in more peripheral regions of the retina."
            },
            "slug": "Integrative-action-in-the-cat's-lateral-geniculate-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Integrative action in the cat's lateral geniculate body"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "Receptive fields of geniculate receptive fields resembled those of retinal ganglion cells, having an excitatory ('on') centre and inhibitory preriphery, or reverse, and cells with receptive fields within or near the area centralis tended to have smaller field centres and stronger suppression by the receptive field periphery than cells with their fields situated in more peripheral regions of the retina."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1961
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2041558"
                        ],
                        "name": "L. Maffei",
                        "slug": "L.-Maffei",
                        "structuredName": {
                            "firstName": "Lamberto",
                            "lastName": "Maffei",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Maffei"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145406237"
                        ],
                        "name": "A. Fiorentini",
                        "slug": "A.-Fiorentini",
                        "structuredName": {
                            "firstName": "Adriana",
                            "lastName": "Fiorentini",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Fiorentini"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 295,
                                "start": 271
                            }
                        ],
                        "text": "…information is processed in parallel by a number of independent orientation and spatial-frequency-tuned channels, suggested a rather different view, which, in its extreme form, would describe the visual cortex as a kind of spatial Fourier analyser (Pollen et al. 1971 ; Maffei & Fiorentini 1977)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 29301655,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "813529f3c305b017d7cbc46721039e920f9d6128",
            "isKey": false,
            "numCitedBy": 142,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Spatial-frequency-rows-in-the-striate-visual-cortex-Maffei-Fiorentini",
            "title": {
                "fragments": [],
                "text": "Spatial frequency rows in the striate visual cortex"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1932236"
                        ],
                        "name": "N. Graham",
                        "slug": "N.-Graham",
                        "structuredName": {
                            "firstName": "N.",
                            "lastName": "Graham",
                            "middleNames": [
                                "V.",
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Graham"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 122,
                                "start": 111
                            }
                        ],
                        "text": "(2) As Campbell & Robson found, early visual information processing is not linear (e.g. probability summation (Graham 1977; Wilson & Giese 1977), and failure of superposition (Maffei& Fiorentini 1972 a))."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 149,
                                "start": 138
                            }
                        ],
                        "text": "…have made this possible now: (a) the emergence of quantitative information about the channels present in early human vision (Cowan 1977; Graham 1977; Wilson & Giese 1977; Wilson & Bergen 1979) ; (b) Marr & Poggio's (1979) theory of human vision (especially the framework within which it…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 19584667,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "c448e0bc7d395c34e82eb0d4f4e27223e8bc80d9",
            "isKey": false,
            "numCitedBy": 158,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Visual-detection-of-aperiodic-spatial-stimuli-by-Graham",
            "title": {
                "fragments": [],
                "text": "Visual detection of aperiodic spatial stimuli by probability summation among narrowband channels"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1728376"
                        ],
                        "name": "K. Nakayama",
                        "slug": "K.-Nakayama",
                        "structuredName": {
                            "firstName": "Ken",
                            "lastName": "Nakayama",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Nakayama"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2113538881"
                        ],
                        "name": "D. J. Roberts",
                        "slug": "D.-J.-Roberts",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Roberts",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. J. Roberts"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 19726695,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "d436705e90b9e2d02799d0fd5daba64fcb5bb45a",
            "isKey": false,
            "numCitedBy": 26,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Line-length-detectors-in-the-human-visual-system:-Nakayama-Roberts",
            "title": {
                "fragments": [],
                "text": "Line length detectors in the human visual system: evidence from selective adaptation."
            },
            "venue": {
                "fragments": [],
                "text": "Vision research"
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3426280"
                        ],
                        "name": "K. D. De Valois",
                        "slug": "K.-D.-De-Valois",
                        "structuredName": {
                            "firstName": "Karen",
                            "lastName": "De Valois",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. D. De Valois"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 14994431,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "76c614ce7e4083b60e22d38523b33028647965dc",
            "isKey": false,
            "numCitedBy": 143,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "A~~ct-Adaptation to a high-contr~t sinusoid& ium~nan~ grating produces a temporary, bandlimited loss in sensitivity centered around the adaptation frequency. The decrease appears to be both narrower and more symmetrical than earlier reports suggest. The effect falls to zero by f f 1 octave and is not reliably present from f f 1 octave to f k 2 octaves. Enhancement of contrast sensitivity occurs for frequencies further removed. peaking at about f + 2f to 3 octaves. This suggests mutual inhibitory interactions among spatial-frequency-selective units of varying filter characteristics. Longterm practice produces significantly higber contrast sensitivity functions and narrower bandwidths of the a~p~tional ~n~ti~ty loss."
            },
            "slug": "Spatial-frequency-adaptation-can-enhance-contrast-Valois",
            "title": {
                "fragments": [],
                "text": "Spatial frequency adaptation can enhance contrast sensitivity."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "Longterm practice produces significantly higber contrast sensitivity functions and narrower bandwidths of the a~p~tional ~n~ti~ty loss and suggests mutual inhibitory interactions among spatial-frequency-selective units of varying filter characteristics."
            },
            "venue": {
                "fragments": [],
                "text": "Vision research"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8037677"
                        ],
                        "name": "K. D. Valois",
                        "slug": "K.-D.-Valois",
                        "structuredName": {
                            "firstName": "Karen",
                            "lastName": "Valois",
                            "middleNames": [
                                "K.",
                                "De"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. D. Valois"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 53178239,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "9363b15b322874aeb714ecd4f5b31694017734d5",
            "isKey": false,
            "numCitedBy": 37,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Independence-of-black-and-white:-Phase-specific-Valois",
            "title": {
                "fragments": [],
                "text": "Independence of black and white: Phase-specific adaptation"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7136759,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "c5f5311fa1f34159ab3a0a1d58da51cd0340a640",
            "isKey": false,
            "numCitedBy": 6319,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The striate cortex was studied in lightly anaesthetized macaque and spider monkeys by recording extracellularly from single units and stimulating the retinas with spots or patterns of light. Most cells can be categorized as simple, complex, or hypercomplex, with response properties very similar to those previously described in the cat. On the average, however, receptive fields are smaller, and there is a greater sensitivity to changes in stimulus orientation. A small proportion of the cells are colour coded."
            },
            "slug": "Receptive-fields-and-functional-architecture-of-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields and functional architecture of monkey striate cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 82,
                "text": "The striate cortex was studied in lightly anaesthetized macaque and spider monkeys by recording extracellularly from single units and stimulating the retinas with spots or patterns of light, with response properties very similar to those previously described in the cat."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2097116837"
                        ],
                        "name": "R. M. Shapley",
                        "slug": "R.-M.-Shapley",
                        "structuredName": {
                            "firstName": "R",
                            "lastName": "Shapley",
                            "middleNames": [
                                "M"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. M. Shapley"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2075062282"
                        ],
                        "name": "D. J. Tolhurst",
                        "slug": "D.-J.-Tolhurst",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Tolhurst",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. J. Tolhurst"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 38777492,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "68fe4986da4b0c809f6f1e1c92c6d3efc19ac76c",
            "isKey": false,
            "numCitedBy": 176,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The spatial properties of edge detectors were measured psychophysically with the technique of subthreshold addition. Subthreshold patterns used to add to an edge were lines, sine gratings, Gaussian edges, and ramps."
            },
            "slug": "Edge-detectors-in-human-vision-Shapley-Tolhurst",
            "title": {
                "fragments": [],
                "text": "Edge detectors in human vision"
            },
            "tldr": {
                "abstractSimilarityScore": 81,
                "text": "The spatial properties of edge detectors were measured psychophysically with the technique of subthreshold addition using lines, sine gratings, Gaussian edges, and ramps."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3015068"
                        ],
                        "name": "M. Alpern",
                        "slug": "M.-Alpern",
                        "structuredName": {
                            "firstName": "Mathew",
                            "lastName": "Alpern",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Alpern"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144697167"
                        ],
                        "name": "W. Rushton",
                        "slug": "W.-Rushton",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Rushton",
                            "middleNames": [
                                "A.",
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Rushton"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102841194"
                        ],
                        "name": "S. Torii",
                        "slug": "S.-Torii",
                        "structuredName": {
                            "firstName": "S",
                            "lastName": "Torii",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Torii"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 176,
                                "start": 158
                            }
                        ],
                        "text": "…the nerve signal in the retina is an adaptation term multiplied by I/(I+K), where I is the incident illumination and K = 800 quanta per receptor per second (Alpern et al. 1970), in any given image the ratio of the darkest to the brightest portion rarely exceeds 25 (a local ratio of around / --."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 40806044,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "501c7ee9f2b1fec42f86d95ac18c36befaf35b86",
            "isKey": false,
            "numCitedBy": 72,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "1. This investigation is based upon Alpern's (1965) contrast flash observations. The threshold for the test flash λ (Fig. 2a) is raised if a second flash ϕ falls on the annular surround. Moreover, if λ excites rods at threshold, it is only the rods in the surround that contribute to the threshold rise."
            },
            "slug": "The-size-of-rod-signals-Alpern-Rushton",
            "title": {
                "fragments": [],
                "text": "The size of rod signals"
            },
            "tldr": {
                "abstractSimilarityScore": 65,
                "text": "This investigation is based upon Alpern's (1965) contrast flash observations and finds that if λ excites rods at threshold, it is only the rods in the surround that contribute to the threshold rise."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1970
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2881454"
                        ],
                        "name": "B. Cleland",
                        "slug": "B.-Cleland",
                        "structuredName": {
                            "firstName": "Brian",
                            "lastName": "Cleland",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Cleland"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34115990"
                        ],
                        "name": "M. Dubin",
                        "slug": "M.-Dubin",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Dubin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Dubin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3672557"
                        ],
                        "name": "W. Levick",
                        "slug": "W.-Levick",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Levick",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Levick"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 295,
                                "start": 276
                            }
                        ],
                        "text": "…geniculate receptive fields are constructed (cf. Maffei & Fiorentini 1972 b), but it seems most likely that the on-centre geniculate X-cell fields are formed by combining a small number of on-centre retinal ganglion X-cell fields of which the centres approximately coincide (Cleland et al. 1971)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 28074342,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "be288fb06470ff76b99f17f2f07bfa261163988d",
            "isKey": false,
            "numCitedBy": 1041,
            "numCiting": 53,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Cat retinal ganglion cells may be subdivided into sustained and transient response‐types by the application of a battery of simple tests based on responses to standing contrast, fine grating patterns, size and speed of contrasting targets, and on the presence or absence of the periphery effect. The classification is equivalent to the ‘X’/‘Y’ (linear/nonlinear) subdivision of Enroth‐Cugell & Robson which is thus confirmed and extended."
            },
            "slug": "Sustained-and-transient-neurones-in-the-cat's-and-Cleland-Dubin",
            "title": {
                "fragments": [],
                "text": "Sustained and transient neurones in the cat's retina and lateral geniculate nucleus"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Cat retinal ganglion cells may be subdivided into sustained and transient response‐types by the application of a battery of simple tests based on responses to standing contrast, fine grating patterns, size and speed of contrasting targets, and on the presence or absence of the periphery effect."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4800025"
                        ],
                        "name": "F. Campbell",
                        "slug": "F.-Campbell",
                        "structuredName": {
                            "firstName": "Fergus",
                            "lastName": "Campbell",
                            "middleNames": [
                                "William"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Campbell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "36155815"
                        ],
                        "name": "J. Robson",
                        "slug": "J.-Robson",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Robson",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Robson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 73,
                                "start": 49
                            }
                        ],
                        "text": "The experiments of Hubel & TNiesel (1962) and of Campbell & Robson (1968) introduced two rather distinct notions of the function of early information processing in higher visual systems."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 254,
                                "start": 230
                            }
                        ],
                        "text": "Recent psychophysical work by Wilson & Giese (1977), FVilson & Bergen (1979) (see also Macleod & Rosenfeld 1974), has led to a precise quantitative model of the orientation-dependent spatial-frequency-tuned channels discovered by Campbell & Robson (1968)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 72,
                                "start": 48
                            }
                        ],
                        "text": "This requirement, together with the findings of Campbell & Robson (1968), leads to the basic idea, illustrated in figure 1, in which one first takes local averages of the image a t various resolutions and then detects the changes in intensity that occur at each one."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 228358,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "ddc2ea63fa69eca4aa44a4fd135543d67badcb23",
            "isKey": false,
            "numCitedBy": 3038,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The contrast thresholds of a variety of grating patterns have been measured over a wide range of spatial frequencies."
            },
            "slug": "Application-of-fourier-analysis-to-the-visibility-Campbell-Robson",
            "title": {
                "fragments": [],
                "text": "Application of fourier analysis to the visibility of gratings"
            },
            "tldr": {
                "abstractSimilarityScore": 74,
                "text": "The contrast thresholds of a variety of grating patterns have been measured over a wide range of spatial frequencies and the results show clear patterns of uniformity in the response to grating noise."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1407756324"
                        ],
                        "name": "C. Enroth-Cugell",
                        "slug": "C.-Enroth-Cugell",
                        "structuredName": {
                            "firstName": "Christina",
                            "lastName": "Enroth-Cugell",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Enroth-Cugell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "36155815"
                        ],
                        "name": "J. Robson",
                        "slug": "J.-Robson",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Robson",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Robson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 298,
                                "start": 271
                            }
                        ],
                        "text": "…X-cells carry V2G + I , and some simple cells detect and represent zero-crossing segments It is known that retinal ganglion X-cells have receptive fields that are accurately described by the difference of two Gaussian distributions (Rodieck & Stone 1965; Ratliff 1965 ; Enroth-Cugell & Robson 1966)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 3052969,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "c6609ae352d9e1c99530136e41798f337496ff27",
            "isKey": false,
            "numCitedBy": 2635,
            "numCiting": 52,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Spatial summation within cat retinal receptive fields was studied by recording from optic‐tract fibres the responses of ganglion cells to grating patterns whose luminance perpendicular to the bars varied sinusoidally about the mean level."
            },
            "slug": "The-contrast-sensitivity-of-retinal-ganglion-cells-Enroth-Cugell-Robson",
            "title": {
                "fragments": [],
                "text": "The contrast sensitivity of retinal ganglion cells of the cat"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Spatial summation within cat retinal receptive fields was studied by recording from optic‐tract fibres the responses of ganglion cells to grating patterns whose luminance perpendicular to the bars varied sinusoidally about the mean level."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1966
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143766793"
                        ],
                        "name": "A. Rosenfeld",
                        "slug": "A.-Rosenfeld",
                        "structuredName": {
                            "firstName": "Azriel",
                            "lastName": "Rosenfeld",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rosenfeld"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2375545"
                        ],
                        "name": "S. Dwyer",
                        "slug": "S.-Dwyer",
                        "structuredName": {
                            "firstName": "Samuel",
                            "lastName": "Dwyer",
                            "middleNames": [
                                "J."
                            ],
                            "suffix": "III"
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Dwyer"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60766796,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "725dfdc3f47474c276d8442d97ccc7b1b5a39c00",
            "isKey": false,
            "numCitedBy": 112,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Automatic remote sensor image processing.- On radiographic image analysis.- Image processing in high energy physics.- Digital picture analysis in cytology.- Picture analysis in character recognition."
            },
            "slug": "Digital-picture-analysis-Rosenfeld-Dwyer",
            "title": {
                "fragments": [],
                "text": "Digital picture analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 87,
                "text": "Automatic remote sensor image processing based on radiographic image analysis for high energy physics and digital picture analysis in cytology."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "101988088"
                        ],
                        "name": "R. Leipnik",
                        "slug": "R.-Leipnik",
                        "structuredName": {
                            "firstName": "Roy",
                            "lastName": "Leipnik",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Leipnik"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 84,
                                "start": 72
                            }
                        ],
                        "text": "There is, moreover, only one distribution that optimizes this relation (Leipnik 1960) The filter G thus provides the optimal trade-off between our conflicting require- ments."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 37474657,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "561c4e559f9247d2cd0696abb5533bec5b633392",
            "isKey": false,
            "numCitedBy": 25,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-Extended-Entropy-Uncertainty-Principle-Leipnik",
            "title": {
                "fragments": [],
                "text": "The Extended Entropy Uncertainty Principle"
            },
            "venue": {
                "fragments": [],
                "text": "Inf. Control."
            },
            "year": 1960
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3133875"
                        ],
                        "name": "C. Blakemore",
                        "slug": "C.-Blakemore",
                        "structuredName": {
                            "firstName": "Colin",
                            "lastName": "Blakemore",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Blakemore"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1967464"
                        ],
                        "name": "J. Pettigrew",
                        "slug": "J.-Pettigrew",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Pettigrew",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Pettigrew"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 19746685,
            "fieldsOfStudy": [
                "Psychology",
                "Biology"
            ],
            "id": "4a0ea53dd9fa5c3c9a04ae8171c9618fb6e59a2a",
            "isKey": false,
            "numCitedBy": 1243,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Binocularly driven units were investigated in the cat's primary visual cortex."
            },
            "slug": "The-neural-mechanism-of-binocular-depth-Barlow-Blakemore",
            "title": {
                "fragments": [],
                "text": "The neural mechanism of binocular depth discrimination"
            },
            "tldr": {
                "abstractSimilarityScore": 59,
                "text": "Binocularly driven units were investigated in the cat's primary visual cortex in a bid to understand why cats have good night vision and why cats with poor vision have poor daytime vision."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1967
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 137,
                                "start": 117
                            }
                        ],
                        "text": "The main points against a Fourier interpretation are : (1) The bandwidth of the channels is not narrow (1.6 octaves, Wilson & Bergen 1979)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 250,
                                "start": 230
                            }
                        ],
                        "text": "The parsing of sets of zero-crossing segments Figure 6 shows the zero-crossings obtained from two channels whose dimensions are approximately the same as the two sustained channels present at the fovea in the human visual system (Wilson & Bergen 1979)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 283,
                                "start": 263
                            }
                        ],
                        "text": "These channels can be realized by linear units with bar-shaped receptive fields made of the difference of two Gaussian distributions, with excitatory to inhibitory space constants in the ratio of 1: 1.75 for the sustained, and 1: 3.0 for the transient, channels (Wilson & Bergen 1979)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 168,
                                "start": 148
                            }
                        ],
                        "text": "…now: (a) the emergence of quantitative information about the channels present in early human vision (Cowan 1977; Graham 1977; Wilson & Giese 1977; Wilson & Bergen 1979) ; (b) Marr & Poggio's (1979) theory of human vision (especially the framework within which it was written) ; and (c) the…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A four mechanism model for spatial vision"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Res"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 85,
                                "start": 75
                            }
                        ],
                        "text": "The first primitive description of the image was called the primal sketch (Marr 1976b) and it is formed in two parts."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 278,
                                "start": 268
                            }
                        ],
                        "text": "The model does, however, make explicit certain nonlinear features that we regard as critical, and it forms the starting point for the more complete proposal of Marr & A major difficulty with natural images is that changes can and do occur over a wide range of scales (Marr 1976a, b)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 22,
                                "start": 10
                            }
                        ],
                        "text": "Following Marr (1976b), the closed contours we call BLOBS, and assign to them a length, width, orientation and (average) contrast; and the terminations are assigned a position and orientation (see figure 7c)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 285,
                                "start": 276
                            }
                        ],
                        "text": "…idea is that if a simple cell truly signals either the positive or the negative part of the linear convolution of its bar-shaped receptive field with the image intensity, it can hardly be thought of as making some symbolic assertion about the presence of a bar in the image (Marr 1976~3, p. 648)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 46466930,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "608e7b3105a732660b0b94c861f607b303ddf756",
            "isKey": false,
            "numCitedBy": 41,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Analyzing-natural-images:-a-computational-theory-of-Marr",
            "title": {
                "fragments": [],
                "text": "Analyzing natural images: a computational theory of texture vision."
            },
            "venue": {
                "fragments": [],
                "text": "Cold Spring Harbor symposia on quantitative biology"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145523037"
                        ],
                        "name": "D. Jameson",
                        "slug": "D.-Jameson",
                        "structuredName": {
                            "firstName": "Dorothea",
                            "lastName": "Jameson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Jameson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4264042"
                        ],
                        "name": "L. Hurvich",
                        "slug": "L.-Hurvich",
                        "structuredName": {
                            "firstName": "Leo",
                            "lastName": "Hurvich",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Hurvich"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4956880"
                        ],
                        "name": "F. Ratliff",
                        "slug": "F.-Ratliff",
                        "structuredName": {
                            "firstName": "Floyd",
                            "lastName": "Ratliff",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Ratliff"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 268,
                                "start": 256
                            }
                        ],
                        "text": "…X-cells carry V2G + I , and some simple cells detect and represent zero-crossing segments It is known that retinal ganglion X-cells have receptive fields that are accurately described by the difference of two Gaussian distributions (Rodieck & Stone 1965; Ratliff 1965 ; Enroth-Cugell & Robson 1966)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 62229210,
            "fieldsOfStudy": [
                "Psychology",
                "Physics"
            ],
            "id": "2a60ec48aa87b3a46d0c464b2861769edb0ea35c",
            "isKey": false,
            "numCitedBy": 555,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Mach-bands-:-quantitative-studies-on-neural-in-the-Jameson-Hurvich",
            "title": {
                "fragments": [],
                "text": "Mach bands : quantitative studies on neural networks in the retina"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1965
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4113648"
                        ],
                        "name": "F. Crick",
                        "slug": "F.-Crick",
                        "structuredName": {
                            "firstName": "Francis",
                            "lastName": "Crick",
                            "middleNames": [
                                "H.",
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Crick"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60667221,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "a35cb763da6077d40fa9e1331ef2533c98cf6f1b",
            "isKey": false,
            "numCitedBy": 98,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "An-Information-Processing-Approach-to-Understanding-Crick-Marr",
            "title": {
                "fragments": [],
                "text": "An Information Processing Approach to Understanding the Visual Cortex"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144117609"
                        ],
                        "name": "J. Mayhew",
                        "slug": "J.-Mayhew",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Mayhew",
                            "middleNames": [
                                "E.",
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mayhew"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2544594"
                        ],
                        "name": "J. Frisby",
                        "slug": "J.-Frisby",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Frisby",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Frisby"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 42099419,
            "fieldsOfStudy": [
                "Medicine",
                "Physics"
            ],
            "id": "9f6f691a413153b705ba62c304c59eca4005b15e",
            "isKey": false,
            "numCitedBy": 19,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Suprathreshold-contrast-perception-and-complex-Mayhew-Frisby",
            "title": {
                "fragments": [],
                "text": "Suprathreshold contrast perception and complex random textures"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2041558"
                        ],
                        "name": "L. Maffei",
                        "slug": "L.-Maffei",
                        "structuredName": {
                            "firstName": "Lamberto",
                            "lastName": "Maffei",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Maffei"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145406237"
                        ],
                        "name": "A. Fiorentini",
                        "slug": "A.-Fiorentini",
                        "structuredName": {
                            "firstName": "Adriana",
                            "lastName": "Fiorentini",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Fiorentini"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 36875445,
            "fieldsOfStudy": [
                "Computer Science",
                "Medicine"
            ],
            "id": "92d4238286224f0522152c4919da67e96d6f8421",
            "isKey": false,
            "numCitedBy": 99,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Retinogeniculate-convergence-and-analysis-of-Maffei-Fiorentini",
            "title": {
                "fragments": [],
                "text": "Retinogeniculate convergence and analysis of contrast."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6389940"
                        ],
                        "name": "R. W. Rodieck",
                        "slug": "R.-W.-Rodieck",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Rodieck",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. W. Rodieck"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144469587"
                        ],
                        "name": "J. Stone",
                        "slug": "J.-Stone",
                        "structuredName": {
                            "firstName": "Jonathan",
                            "lastName": "Stone",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Stone"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 254,
                                "start": 234
                            }
                        ],
                        "text": "…X-cells carry V2G + I , and some simple cells detect and represent zero-crossing segments It is known that retinal ganglion X-cells have receptive fields that are accurately described by the difference of two Gaussian distributions (Rodieck & Stone 1965; Ratliff 1965 ; Enroth-Cugell & Robson 1966)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 34598595,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "f0c540aa9eace5735d0e4fc7cf7332210c4f29ef",
            "isKey": false,
            "numCitedBy": 560,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Analysis-of-receptive-fields-of-cat-retinal-cells.-Rodieck-Stone",
            "title": {
                "fragments": [],
                "text": "Analysis of receptive fields of cat retinal ganglion cells."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1965
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3426280"
                        ],
                        "name": "K. D. De Valois",
                        "slug": "K.-D.-De-Valois",
                        "structuredName": {
                            "firstName": "Karen",
                            "lastName": "De Valois",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. D. De Valois"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 29768349,
            "fieldsOfStudy": [
                "Medicine"
            ],
            "id": "e58e6ad45c653c9aef543eff53b20e00fb422d82",
            "isKey": false,
            "numCitedBy": 33,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Independence-of-black-and-white:-phase-specific-Valois",
            "title": {
                "fragments": [],
                "text": "Independence of black and white: phase-specific adaptation."
            },
            "venue": {
                "fragments": [],
                "text": "Vision research"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 30297475,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "0b69dc1d56f80c02478a76925cda39a233126783",
            "isKey": false,
            "numCitedBy": 161,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Reconstructing-the-visual-image-in-space-and-time-Barlow",
            "title": {
                "fragments": [],
                "text": "Reconstructing the visual image in space and time"
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34138398"
                        ],
                        "name": "R. Bracewell",
                        "slug": "R.-Bracewell",
                        "structuredName": {
                            "firstName": "Ronald",
                            "lastName": "Bracewell",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Bracewell"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 119,
                                "start": 105
                            }
                        ],
                        "text": "They are, in fact, related by the uncertainty principle, which states that Ax Aw > an (see, for example, Bracewell 1965, pp. 160-163)."
                    },
                    "intents": []
                }
            ],
            "corpusId": 18010056,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "50f8aa267f38687ffda768ab0084d8434d7bda30",
            "isKey": false,
            "numCitedBy": 3673,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "1 Introduction 2 Groundwork 3 Convolution 4 Notation for Some Useful Functions 5 The Impulse Symbol 6 The Basic Theorems 7 Obtaining Transforms 8 The Two Domains 9 Waveforms, Spectra, Filters and Linearity 10 Sampling and Series 11 The Discrete Fourier Transform and the FFT 12 The Discrete Hartley Transform 13 Relatives of the Fourier Transform 14 The Laplace Transform 15 Antennas and Optics 16 Applications in Statistics 17 Random Waveforms and Noise 18 Heat Conduction and Diffusion 19 Dynamic Power Spectra 20 Tables of sinc x, sinc2x, and exp(-71x2) 21 Solutions to Selected Problems 22 Pictorial Dictionary of Fourier Transforms 23 The Life of Joseph Fourier"
            },
            "slug": "The-Fourier-Transform-and-Its-Applications-Bracewell",
            "title": {
                "fragments": [],
                "text": "The Fourier Transform and Its Applications"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1965
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Proof Consider the line segment Q = (r cos 8, r sin 8) for fixed 8 and values of r sufficiently small that Q lies entirely within N(1) (see figure 10) Now writing fxx for i32f/i3x2 etc"
            },
            "venue": {
                "fragments": [],
                "text": "Proof Consider the line segment Q = (r cos 8, r sin 8) for fixed 8 and values of r sufficiently small that Q lies entirely within N(1) (see figure 10) Now writing fxx for i32f/i3x2 etc"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 119,
                                "start": 105
                            }
                        ],
                        "text": "They are, in fact, related by the uncertainty principle, which states that Ax Aw > an (see, for example, Bracewell 1965, pp. 160-163)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "T h e Fourier transform and its applications"
            },
            "venue": {
                "fragments": [],
                "text": "T h e Fourier transform and its applications"
            },
            "year": 1965
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 183,
                                "start": 174
                            }
                        ],
                        "text": "This motivated a new approach to vision, which enquired directly about the information processing problems inherent in the task of vision itself (Marr 1 9 7 6 ~ ) b; and see Marr 1978 for the overall scheme)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Early processing of visual information . Phi l . T rans"
            },
            "venue": {
                "fragments": [],
                "text": "R . Soc . Lond . B"
            },
            "year": 1978
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 84,
                                "start": 72
                            }
                        ],
                        "text": "There is, moreover, only one distribution that optimizes this relation (Leipnik 1960) The filter G thus provides the optimal trade-off between our conflicting require- ments."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The extended entropy uncertainty principle. I n f"
            },
            "venue": {
                "fragments": [],
                "text": "The extended entropy uncertainty principle. I n f"
            },
            "year": 1960
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "As required, therefore, the above quantity is zero a t r = 0 and has maximum slope when 8 = 0"
            },
            "venue": {
                "fragments": [],
                "text": "As required, therefore, the above quantity is zero a t r = 0 and has maximum slope when 8 = 0"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 135,
                                "start": 115
                            }
                        ],
                        "text": "I n fact, the idea of using narrow bandpass differential operators did not appear until the human stereo theory of Marr & Poggio (1979), which was also the first theory to depend primarily on zero-crossings."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 223,
                                "start": 205
                            }
                        ],
                        "text": "Wherever an intensity change occurs, there will be a corresponding peak in the first directional derivative, or equivalently, a zero-crossing in the second directional derivative of intensity (Marr 19768; Marr & Poggio 1979)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Representing visual information . A . A . A . S . 143 rd Annual Meeting , Symposium on : Some mathematical questions in biology , February 1977"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "1 g 7 z a Process of synthesis in visual perception"
            },
            "venue": {
                "fragments": [],
                "text": "Nature , Lond ."
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Binocular interaction and depth sensitivity of striate and prestriate neurons of the behaving rhesus monkey"
            },
            "venue": {
                "fragments": [],
                "text": "J. Neurophysiol"
            },
            "year": 1978
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A. 1 g 7 z a Process of synthesis in visual perception"
            },
            "venue": {
                "fragments": [],
                "text": "Nature, Lond"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Representing visual information Symposium on: Some mathematical questions in biology Published in Lectures o n mathematics in the life sciences 10,101-1 80"
            },
            "venue": {
                "fragments": [],
                "text": "143rd Annual Meeting"
            },
            "year": 1977
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 154,
                                "start": 144
                            }
                        ],
                        "text": "Three developments have made this possible now: (a) the emergence of quantitative information about the channels present in early human vision (Cowan 1977; Graham 1977; Wilson & Giese 1977; Wilson & Bergen 1979) ; (b) Marr & Poggio's (1979) theory of human vision (especially the framework within…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Some remarks on channel bandwidths for visual contrast detection"
            },
            "venue": {
                "fragments": [],
                "text": "Neurosci. Res. Prog. Bull"
            },
            "year": 1977
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The raw primal sketch"
            },
            "venue": {
                "fragments": [],
                "text": "The raw primal sketch"
            }
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 28,
            "methodology": 3,
            "result": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 62,
        "totalPages": 7
    },
    "page_url": "https://www.semanticscholar.org/paper/Theory-of-edge-detection-Marr-Hildreth/9009c9685754346deb93f316144a9da1f70ffcd8?sort=total-citations"
}