{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144901036"
                        ],
                        "name": "H. Nishihara",
                        "slug": "H.-Nishihara",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Nishihara",
                            "middleNames": [
                                "Keith"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Nishihara"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 607008,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bbf9691af6a66848b5bf752ef169b061e5669f11",
            "isKey": false,
            "numCitedBy": 48,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Intensity,-Visible-Surface,-and-Volumetric-Nishihara",
            "title": {
                "fragments": [],
                "text": "Intensity, Visible-Surface, and Volumetric Representations"
            },
            "venue": {
                "fragments": [],
                "text": "Artif. Intell."
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "120971205"
                        ],
                        "name": "M. Brady",
                        "slug": "M.-Brady",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Brady",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Brady"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 109794489,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "410f8faf5a73b91059b158c82459083de6a320d8",
            "isKey": false,
            "numCitedBy": 22,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "We propose a representation of two-dimensional shape and contour that has local support. A contour and region is segmented into subparts with associated partly specified descriptions that are iteratively refined by the descriptions of adjacent subparts in a process of local frame propagation. Curved shapes are described in terms of smoothed local symmetries that combine features of generalized cylinders and the Symmetric Axis Transform. Shape descriptions, together with a local potential function, are used to determine grasp points for a parallel jaw gripper."
            },
            "slug": "Parts-Description-And-Acquisition-Using-Vision-Brady",
            "title": {
                "fragments": [],
                "text": "Parts Description And Acquisition Using Vision"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "Curved shapes are described in terms of smoothed local symmetries that combine features of generalized cylinders and the Symmetric Axis Transform to determine grasp points for a parallel jaw gripper."
            },
            "venue": {
                "fragments": [],
                "text": "Other Conferences"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144901036"
                        ],
                        "name": "H. Nishihara",
                        "slug": "H.-Nishihara",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Nishihara",
                            "middleNames": [
                                "Keith"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Nishihara"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 43759520,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bdf9b8f4de001f5f37bc844efbce1210d581d599",
            "isKey": false,
            "numCitedBy": 2323,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "The human visual process can be studied by examining the computational problems associated with deriving useful information from retinal images. In this paper, we apply this approach to the problem of representing three-dimensional shapes for the purpose of recognition. 1. Three criteria, accessibility, scope and uniqueness, and stability and sensitivity, are presented for judging the usefulness of a representation for shape recognition. 2. Three aspects of a representation’s design are considered, (i) the representation’s coordinate system, (ii) its primitives, which are the primary units of shape information used in the representation, and (iii) the organization the representation imposes on the information in its descriptions. 3. In terms of these design issues and the criteria presented, a shape representation for recognition should: (i) use an object-centred coordinate system, (ii) include volumetric primitives of varied sizes, and (iii) have a modular organization. A representation based on a shape’s natural axes (for example the axes identified by a stick figure) follows directly from these choices. 4. The basic process for deriving a shape description in this representation must involve: (i) a means for identifying the natural axes of a shape in its image and (ii) a mechanism for transforming viewer-centred axis specifications to specifications in an object-centred coordinate system. 5. Shape recognition involves: (i) a collection of stored shape descriptions, and (ii) various indexes into the collection that allow a newly derived description to be associated with an appropriate stored description. The most important of these indexes allows shape recognition to proceed conservatively from the general to the specific based on the specificity of the information available from the image. 6. New constraints supplied by a conservative recognition process can be used to extract more information from the image. A relaxation process for carrying out this constraint analysis is described."
            },
            "slug": "Representation-and-recognition-of-the-spatial-of-Marr-Nishihara",
            "title": {
                "fragments": [],
                "text": "Representation and recognition of the spatial organization of three-dimensional shapes"
            },
            "tldr": {
                "abstractSimilarityScore": 93,
                "text": "The human visual process can be studied by examining the computational problems associated with deriving useful information from retinal images by applying the approach to the problem of representing three-dimensional shapes for the purpose of recognition."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "13290124"
                        ],
                        "name": "N. Sutherland",
                        "slug": "N.-Sutherland",
                        "structuredName": {
                            "firstName": "N.",
                            "lastName": "Sutherland",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Sutherland"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 9430181,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8d8e1983d277b6182365de3c7bfac9326583bdd8",
            "isKey": false,
            "numCitedBy": 231,
            "numCiting": 30,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper lists twelve conditions that must be fulfilled by a satisfactory theory of visual pattern recognition in animals and man : such a theory must explain (1) size invariance, (2) position invariance, (3) brightness invariance, (4) the equivalence of outline and filled-in shapes, (5) lack of invariance under most rotations, (6) the known confusions made between patterns, (7) animals’ ability to disregard jitter, (8) the human ability to segment shapes in different ways, (9) the way in which man recognizes complex scenes without recognizing individual details of the scene, (10) perceptual learning, (11) the way in which the brain takes advantage of the redundancy of the visual environment; (12) finally any theory must be consistent with the physiological evidence. The outlines of a theory meeting these conditions are put forward. The model has three parts : (1) A processor that extracts local features from the input picture preserving information about the spatial relationships between the features. (2) A mechanism that induces an abstract description of the output from the processor. (3) A store in which such descriptions are held. Some suggestions are made about the language in which descriptions are framed : it must contain hierarchical elements to allow for the possibility of segmenting a picture in different ways. It is shown how the properties of such a language could account for the facts listed above. In recognizing a picture the output from the store is matched to a stored descriptive rule. What we see is the descriptive rule selected to describe an input picture—we cannot respond to details of the picture not represented in the rule. Since, however, many different rules describe the same input picture, animals and man respond to different aspects of the same picture on different occasions of presentation."
            },
            "slug": "Outlines-of-a-theory-of-visual-pattern-recognition-Sutherland",
            "title": {
                "fragments": [],
                "text": "Outlines of a theory of visual pattern recognition in animals and man"
            },
            "tldr": {
                "abstractSimilarityScore": 74,
                "text": "This paper lists twelve conditions that must be fulfilled by a satisfactory theory of visual pattern recognition in animals and man and shows how the properties of such a language could account for the facts listed above."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743045"
                        ],
                        "name": "S. Ullman",
                        "slug": "S.-Ullman",
                        "structuredName": {
                            "firstName": "Shimon",
                            "lastName": "Ullman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ullman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 146278985,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "c2d2fefc1c61298059f9a160f190e6957587b74e",
            "isKey": false,
            "numCitedBy": 2090,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This book uses the methodology of artificial intelligence to investigate the phenomena of visual motion perception: how the visual system constructs descriptions of the environment in terms of objects, their three-dimensional shape, and their motion through space, on the basis of the changing image that reaches the eye. The author has analyzed the computations performed in the course of visual motion analysis. Workable schemes able to perform certain tasks performed by the visual system have been constructed and used as vehicles for investigating the problems faced by the visual system and its methods for solving them.Two major problems are treated: first, the correspondence problem, which concerns the identification of image elements that represent the same object at different times, thereby maintaining the perceptual identity of the object in motion or in change. The second problem is the three-dimensional interpretation of the changing image once a correspondence has been established.The author's computational approach to visual theory makes the work unique, and it should be of interest to psychologists working in visual perception and readers interested in cognitive studies in general, as well as computer scientists interested in machine vision, theoretical neurophysiologists, and philosophers of science."
            },
            "slug": "The-Interpretation-of-Visual-Motion-Ullman",
            "title": {
                "fragments": [],
                "text": "The Interpretation of Visual Motion"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2259916"
                        ],
                        "name": "Donald D. Hoffman",
                        "slug": "Donald-D.-Hoffman",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "Hoffman",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Donald D. Hoffman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 3170927,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "dc6598a6fe1ad425fcee00e7f03ace958f587820",
            "isKey": false,
            "numCitedBy": 48,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Vision is a process of inference. What you see when you look around depends not only on what is there to be seen but also on how your visual system organizes and interprets the images that fall on your retinas. An intriguing demonstration of this aspect of perception is presented by the apparent surface that is formed by rotating a cosine wave around a vertical axis viewed obliquely [see illustration on this page]. When you first look at the figure, it appears to be organized into a set of raised concentric rings, with the boundaries between the rings delineated approximately by the colored circular contours. If you turn the page upside down, however, the organization changes: now each colored contour, instead of lying in a trough between two rings, appears to trace the crest of a ring. (Try it.) Evidently the visual system does more than passively transmit signals to the brain. It . actively takes part in organizing and interpreting them. This finding raises three questions. First, why does the visual system need to organize and interpret the images formed on the retinas? Second, how does it remain true to the real world in the process? Third, what rules of inference does it follow? The answers to these questions call for a closer examination of such figures."
            },
            "slug": "The-Interpretation-of-Visual-Illusions-Hoffman",
            "title": {
                "fragments": [],
                "text": "The Interpretation of Visual Illusions"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "92269846"
                        ],
                        "name": "H. C. Longuet-Higgins",
                        "slug": "H.-C.-Longuet-Higgins",
                        "structuredName": {
                            "firstName": "Hugh",
                            "lastName": "Longuet-Higgins",
                            "middleNames": [
                                "Christopher"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. C. Longuet-Higgins"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2476541"
                        ],
                        "name": "K. Prazdny",
                        "slug": "K.-Prazdny",
                        "structuredName": {
                            "firstName": "K.",
                            "lastName": "Prazdny",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Prazdny"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 28679048,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "810bd193898f9c58c93cfddd1c497eb5e2f342bc",
            "isKey": false,
            "numCitedBy": 1479,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "It is shown that from a monocular view of a rigid, textured, curved surface it is possible, in principle, to determine the gradient of the surface at any point, and the motion of the eye relative to it, from the velocity field of the changing retinal image, and its first and second spatial derivatives. The relevant equations are redundant, thus providing a test of the rigidity assumption. They involve, among other observable quantities, the components of shear of the retinal velocity field, suggesting that the visual system may possess specialized channels for computing these components."
            },
            "slug": "The-interpretation-of-a-moving-retinal-image-Longuet-Higgins-Prazdny",
            "title": {
                "fragments": [],
                "text": "The interpretation of a moving retinal image"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "It is shown that from a monocular view of a rigid, textured, curved surface it is possible, in principle, to determine the gradient of the surface at any point, and the motion of the eye relative to it, from the velocity field of the changing retinal image, and its first and second spatial derivatives."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "72419159"
                        ],
                        "name": "R. Brooks",
                        "slug": "R.-Brooks",
                        "structuredName": {
                            "firstName": "Rodney",
                            "lastName": "Brooks",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Brooks"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2326697"
                        ],
                        "name": "Russell Creiner",
                        "slug": "Russell-Creiner",
                        "structuredName": {
                            "firstName": "Russell",
                            "lastName": "Creiner",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Russell Creiner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1738591"
                        ],
                        "name": "T. Binford",
                        "slug": "T.-Binford",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Binford",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Binford"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 5570699,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "7383ddc07be0679387e890ec88ec3a3147379cdf",
            "isKey": false,
            "numCitedBy": 142,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "ACRONYM Is a model-based image understanding system. It demonstrates mechanisms for interpretation of images with generic object classes and generic viewing conditions, in a way that is generalizable. It incorporates a powerful geometric modeling capability with a high level modeling language for natural communication with the user In terms of object models. A user gives high level descriptions of both generic and specific instances of objects. A rule-based Inference system produces a viewpoint dependent symbolic summary of the predicted appearance of the objects. This geometric reasoning capability enables the system to incorporate and relate knowledge and information at different levels. This summary drives a powerful syntactic matcher to find instances of the objects in preprocessed images."
            },
            "slug": "The-ACRONYM-Model-Based-Vision-System-Brooks-Creiner",
            "title": {
                "fragments": [],
                "text": "The ACRONYM Model-Based Vision System"
            },
            "tldr": {
                "abstractSimilarityScore": 98,
                "text": "ACRONYM Is a model-based image understanding system that demonstrates mechanisms for interpretation of images with generic object classes and generic viewing conditions, in a way that is generalizable."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144456299"
                        ],
                        "name": "Adolfo Guzmán",
                        "slug": "Adolfo-Guzmán",
                        "structuredName": {
                            "firstName": "Adolfo",
                            "lastName": "Guzmán",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Adolfo Guzmán"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 195713074,
            "fieldsOfStudy": [
                "Mathematics",
                "Art"
            ],
            "id": "f3be4120894ba32a8c75d503d6c6687d93277c55",
            "isKey": false,
            "numCitedBy": 237,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "We consider visual scenes composed by the optical image of a group of bodies. When such a scene is \"seen\" by a computer through a film spot scanner, image dissector, or similar device, it can be treated as a two-dimensional array of numbers, or as a function of two variables."
            },
            "slug": "Decomposition-of-a-visual-scene-into-bodies-Guzmán",
            "title": {
                "fragments": [],
                "text": "Decomposition of a visual scene into three-dimensional bodies"
            },
            "tldr": {
                "abstractSimilarityScore": 63,
                "text": "This work considers visual scenes composed by the optical image of a group of bodies that can be treated as a two-dimensional array of numbers, or as a function of two variables."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1716904"
                        ],
                        "name": "J. Koenderink",
                        "slug": "J.-Koenderink",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Koenderink",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Koenderink"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2585959"
                        ],
                        "name": "A. V. van Doorn",
                        "slug": "A.-V.-van-Doorn",
                        "structuredName": {
                            "firstName": "Andrea",
                            "lastName": "van Doorn",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. V. van Doorn"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 39009922,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "8718bdea2c3aedc550f09d2709d2d75b25cbfab9",
            "isKey": false,
            "numCitedBy": 256,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "It is shown, by elementary mathematical reasoning, that visual contours can only be concave at their endpoints. This simple natural fact is contrasted with general mannerisms of draftsmen: in the great majority of cases contours are drawn to have convex ends. It is argued that this results from our general concept of solid shapes: a general shape is conceived of as a conglomerate of convex (‘ovoid’) elementary shapes, these shapes act as ‘figure’ and the way they are glued together is treated as the—relatively unimportant—‘ground’. The hypothesis is supported through citations from academic-art literature. An attempt is made to give a geometrical specification of just what draftsmen draw if they disregard the contour."
            },
            "slug": "The-Shape-of-Smooth-Objects-and-the-Way-Contours-Koenderink-Doorn",
            "title": {
                "fragments": [],
                "text": "The Shape of Smooth Objects and the Way Contours End"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "It is argued that a general shape is conceived of as a conglomerate of convex (‘ovoid’) elementary shapes, these shapes act as ‘figure’ and the way they are glued together is treated as the—relatively unimportant—‘ground’."
            },
            "venue": {
                "fragments": [],
                "text": "Perception"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1699200"
                        ],
                        "name": "N. Badler",
                        "slug": "N.-Badler",
                        "structuredName": {
                            "firstName": "Norman",
                            "lastName": "Badler",
                            "middleNames": [
                                "I."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Badler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1784213"
                        ],
                        "name": "R. Bajcsy",
                        "slug": "R.-Bajcsy",
                        "structuredName": {
                            "firstName": "Ruzena",
                            "lastName": "Bajcsy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Bajcsy"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 424837,
            "fieldsOfStudy": [
                "Computer Science",
                "Art"
            ],
            "id": "13a21227619b472335f9055a006565b96b2e29ad",
            "isKey": false,
            "numCitedBy": 81,
            "numCiting": 53,
            "paperAbstract": {
                "fragments": [],
                "text": "Representing complex three-dimensional objects in a computer involves more than just evaluating its display capabilities. Other factors are the uses and costs of the representation, what operations can be performed on it and, ultimately, how useful it is for computer recognition or description or three-dimensional objects. Many of the questions which are posed arise from the joint consideration of computer graphics and computer vision, and a specific representation hierarchy is proposed for complex objects which makes them amenable to display, manipulation, measurement, and analysis."
            },
            "slug": "Three-dimensional-representations-for-computer-and-Badler-Bajcsy",
            "title": {
                "fragments": [],
                "text": "Three-dimensional representations for computer graphics and computer vision"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "A specific representation hierarchy is proposed for complex objects which makes them amenable to display, manipulation, measurement, and analysis."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH '78"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47165385"
                        ],
                        "name": "M. B. Clowes",
                        "slug": "M.-B.-Clowes",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Clowes",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. B. Clowes"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 45333466,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9b99bf7362e0c790b40d6a403b25b9748d550360",
            "isKey": false,
            "numCitedBy": 499,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "On-Seeing-Things-Clowes",
            "title": {
                "fragments": [],
                "text": "On Seeing Things"
            },
            "venue": {
                "fragments": [],
                "text": "Artif. Intell."
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31913541"
                        ],
                        "name": "W. Richards",
                        "slug": "W.-Richards",
                        "structuredName": {
                            "firstName": "Whitman",
                            "lastName": "Richards",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Richards"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31678416"
                        ],
                        "name": "J. Rubin",
                        "slug": "J.-Rubin",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Rubin",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Rubin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2259916"
                        ],
                        "name": "Donald D. Hoffman",
                        "slug": "Donald-D.-Hoffman",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "Hoffman",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Donald D. Hoffman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 9760041,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "0ebcda96e3d5fb4b313b79b50c3fda0f0d40cb4c",
            "isKey": false,
            "numCitedBy": 16,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "Many problems in biological information processing require the solution to a complex system of equations in many unknown variables. An equation-counting procedure is described for determining whether such a system of equations will indeed have a unique solution, and under what conditions the solution should be interpreted as ‘correct’. Three examples of the procedure are given for illustration, one from auditory signal processing and two from vision."
            },
            "slug": "Equation-Counting-and-the-Interpretation-of-Sensory-Richards-Rubin",
            "title": {
                "fragments": [],
                "text": "Equation Counting and the Interpretation of Sensory Data"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "An equation-counting procedure is described for determining whether such a system of equations will indeed have a unique solution, and under what conditions the solution should be interpreted as ‘correct’."
            },
            "venue": {
                "fragments": [],
                "text": "Perception"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 121754405,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "1af25c587e3d7f664c9f14ed8494315418cae7f1",
            "isKey": false,
            "numCitedBy": 224,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "Almost nothing can be deduced about a general three-dimensional surface given only its occluding contours in an image, yet contour information is easily and effectively used by us to infer the shape of a surface. Therefore, implicit in the perceptual analysis of occluding contour must lie various assumptions about the viewed surfaces. The assumptions that seem most natural are (a) that the distinction between convex and concave segments reflects real properties of the viewed surface; and (b) that contiguous portions of contour arise from contiguous parts of the viewed surface – i. e. there are no invisible obscuring edges. It is proved that, for smooth surfaces, these assumptions are essentially equivalent to assuming that the viewed surface is a generalized cone. Methods are defined for finding the axis of such a cone, and for segmenting a surface constructed of several cones into its components, whose axes can then be found separately. These methods provide one link between an uninterpreted figure extracted from an image, and the 3-D representation theory of Marr & Nishihara (1977)."
            },
            "slug": "Analysis-of-occluding-contour-Marr",
            "title": {
                "fragments": [],
                "text": "Analysis of occluding contour"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2531363"
                        ],
                        "name": "R. Yin",
                        "slug": "R.-Yin",
                        "structuredName": {
                            "firstName": "Ruoxuan",
                            "lastName": "Yin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Yin"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 35557477,
            "fieldsOfStudy": [
                "Medicine",
                "Psychology"
            ],
            "id": "f367aa161bbcc36e802d07f4fd206b95402dc74e",
            "isKey": false,
            "numCitedBy": 349,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Face-recognition-by-brain-injured-patients:-a-Yin",
            "title": {
                "fragments": [],
                "text": "Face recognition by brain-injured patients: a dissociable ability?"
            },
            "venue": {
                "fragments": [],
                "text": "Neuropsychologia"
            },
            "year": 1970
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102387063"
                        ],
                        "name": "A. Macworth",
                        "slug": "A.-Macworth",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Macworth",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Macworth"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 121888158,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "e0f3891aec85e6b18d941a818f4b173aa29c216e",
            "isKey": false,
            "numCitedBy": 257,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Interpreting-pictures-of-polyhedral-scenes-Macworth",
            "title": {
                "fragments": [],
                "text": "Interpreting pictures of polyhedral scenes"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "120971205"
                        ],
                        "name": "M. Brady",
                        "slug": "M.-Brady",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Brady",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Brady"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 118184688,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "179a59e7a458d3bdfe62d562aef719ca8ac3f661",
            "isKey": false,
            "numCitedBy": 146,
            "numCiting": 49,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Criteria-for-Representations-of-Shape-Brady",
            "title": {
                "fragments": [],
                "text": "Criteria for Representations of Shape"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38663378"
                        ],
                        "name": "J. Fodor",
                        "slug": "J.-Fodor",
                        "structuredName": {
                            "firstName": "Jerry",
                            "lastName": "Fodor",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Fodor"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3194015"
                        ],
                        "name": "Z. Pylyshyn",
                        "slug": "Z.-Pylyshyn",
                        "structuredName": {
                            "firstName": "Zenon",
                            "lastName": "Pylyshyn",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Z. Pylyshyn"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17481725,
            "fieldsOfStudy": [
                "Philosophy"
            ],
            "id": "4ffa472672fbd33ecf58baf0120afe238459b7a4",
            "isKey": false,
            "numCitedBy": 603,
            "numCiting": 32,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "How-direct-is-visual-perception:-Some-reflections-Fodor-Pylyshyn",
            "title": {
                "fragments": [],
                "text": "How direct is visual perception?: Some reflections on Gibson's “ecological approach”"
            },
            "venue": {
                "fragments": [],
                "text": "Cognition"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35106875"
                        ],
                        "name": "R. Duda",
                        "slug": "R.-Duda",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Duda",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Duda"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3108177"
                        ],
                        "name": "P. Hart",
                        "slug": "P.-Hart",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Hart",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Hart"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 12946615,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b07ce649d6f6eb636872527104b0209d3edc8188",
            "isKey": false,
            "numCitedBy": 16928,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Provides a unified, comprehensive and up-to-date treatment of both statistical and descriptive methods for pattern recognition. The topics treated include Bayesian decision theory, supervised and unsupervised learning, nonparametric techniques, discriminant analysis, clustering, preprosessing of pictorial data, spatial filtering, shape description techniques, perspective transformations, projective invariants, linguistic procedures, and artificial intelligence techniques for scene analysis."
            },
            "slug": "Pattern-classification-and-scene-analysis-Duda-Hart",
            "title": {
                "fragments": [],
                "text": "Pattern classification and scene analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 66,
                "text": "The topics treated include Bayesian decision theory, supervised and unsupervised learning, nonparametric techniques, discriminant analysis, clustering, preprosessing of pictorial data, spatial filtering, shape description techniques, perspective transformations, projective invariants, linguistic procedures, and artificial intelligence techniques for scene analysis."
            },
            "venue": {
                "fragments": [],
                "text": "A Wiley-Interscience publication"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61076330,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9f3f1fdc930e2f1058c55c445875ad8a416914ba",
            "isKey": false,
            "numCitedBy": 603,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : The CNS needs to be understood at four nearly independent levels of description: (1) that at which the nature of a computation is expressed; (2) that at which the algorithms that implement a computation are characterized; (3) that at which an algorithm is committed to particular mechanisms; and (4) that at which the mechanisms are realized in hardware. In general, the nature of a computation is determined by the problem to be solved, the mechanisms that are used depend upon the available hardware, and the particular algorithms chosen depend on the problem and on the available mechanisms. Examples are given of theories at each level. (Author)"
            },
            "slug": "From-Understanding-Computation-to-Understanding-Marr-Poggio",
            "title": {
                "fragments": [],
                "text": "From Understanding Computation to Understanding Neural Circuitry"
            },
            "tldr": {
                "abstractSimilarityScore": 96,
                "text": "The CNS needs to be understood at four nearly independent levels of description: that at which the nature of a computation is expressed; that atWhich the algorithms that implement a computation are characterized; thatat which an algorithm is committed to particular mechanisms; and that atwhich the mechanisms are realized in hardware."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1809905"
                        ],
                        "name": "A. Witkin",
                        "slug": "A.-Witkin",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Witkin",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Witkin"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7096897,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a26f893c224ed6e3df1f37479de0e774a4cae237",
            "isKey": false,
            "numCitedBy": 2873,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Scale-Space-Filtering-Witkin",
            "title": {
                "fragments": [],
                "text": "Scale-Space Filtering"
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2052391642"
                        ],
                        "name": "J. O'Rourke",
                        "slug": "J.-O'Rourke",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "O'Rourke",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. O'Rourke"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1699200"
                        ],
                        "name": "N. Badler",
                        "slug": "N.-Badler",
                        "structuredName": {
                            "firstName": "Norman",
                            "lastName": "Badler",
                            "middleNames": [
                                "I."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Badler"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 14359543,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "de41855333277b5b9d9c1bf4e36f6e5cfa43202b",
            "isKey": false,
            "numCitedBy": 137,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "Algorithms are presented for converting between different three-dimensional object representations: from a collection of cross section outlines to surface points, and from surface points to a collection of overlapping spheres. The algorithms effect a conversion from surface representations (outlines or surface points) to a volume representation (spheres). The spherical representation can be useful for graphical display, and perhaps as an intermediate representation for conversions to representations with other primitives. The spherical decomposition also permits the computation of points on the symmetric surface of an object, the three-dimensional analog of Blum's symmetric axis. The algorithms work in real coordinates rather than in a discrete space, and so avoid error introduced by the quantization of the space."
            },
            "slug": "Decomposition-of-Three-Dimensional-Objects-into-O'Rourke-Badler",
            "title": {
                "fragments": [],
                "text": "Decomposition of Three-Dimensional Objects into Spheres"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "The spherical decomposition permits the computation of points on the symmetric surface of an object, the three-dimensional analog of Blum's symmetric axis, and can be useful for graphical display."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38663378"
                        ],
                        "name": "J. Fodor",
                        "slug": "J.-Fodor",
                        "structuredName": {
                            "firstName": "Jerry",
                            "lastName": "Fodor",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Fodor"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 145621611,
            "fieldsOfStudy": [
                "Psychology",
                "Philosophy"
            ],
            "id": "bef0de871be19ecfcfc7c43d5470b14c1959a5c7",
            "isKey": false,
            "numCitedBy": 2741,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "In a compelling defense of the speculative approach to the philosophy of mind, Jerry Fodor argues that, while our best current theories of cognitive psychology view many higher processes as computational, computation itself presupposes an internal medium of representation. Fodor's prime concerns are to buttress the notion of internal representation from a philosophical viewpoint, and to determine those characteristics of this conceptual construct using the empirical data available from linguistics and cognitive psychology."
            },
            "slug": "The-Language-of-Thought-Fodor",
            "title": {
                "fragments": [],
                "text": "The Language of Thought"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1716904"
                        ],
                        "name": "J. Koenderink",
                        "slug": "J.-Koenderink",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Koenderink",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Koenderink"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7977369"
                        ],
                        "name": "A. Doorn",
                        "slug": "A.-Doorn",
                        "structuredName": {
                            "firstName": "Andrea",
                            "lastName": "Doorn",
                            "middleNames": [
                                "J.",
                                "van"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Doorn"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 120192969,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "cbd5fb9fc78fc6eba7ed331177fe7ffc3b6ce669",
            "isKey": false,
            "numCitedBy": 278,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "An attempt is made to identify the structural invariants of the field of isophotes on lambertian surfaces of arbitrary shape under arbitrary illumination. It is a priori clear that such invariants play an important part in the perception of solid shape by means of chiaroscuro. We have found several such invariants. The topological structure of the field of isophotes is determined by the collection of nested, closed parabolic curves on the surface. An important class of stationary points of the field clings to these parabolic lines. The isophotes cut the parabolic lines at a constant angle, irrespective of the location of the light sources. For certain canonical surface undulations the field of isophotes is explicitly given."
            },
            "slug": "Photometric-Invariants-Related-to-Solid-Shape-Koenderink-Doorn",
            "title": {
                "fragments": [],
                "text": "Photometric Invariants Related to Solid Shape"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144994682"
                        ],
                        "name": "A. Pentland",
                        "slug": "A.-Pentland",
                        "structuredName": {
                            "firstName": "Alex",
                            "lastName": "Pentland",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Pentland"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 13938396,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "922a028ae3f282815a7db4e591fe4c3c26fd0e9f",
            "isKey": false,
            "numCitedBy": 40,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper addresses the problems of (1) representing natural shapes such as mountains, trees and clouds, and (2) computing such a description from image data. In order to solve these problems we must be able to relate natural surfaces to their images; this requires a good model of natural surface shapes. Fractal functions are good a choice for modeling natural surfaces because (1) many physical processes produce a fractal surface shape, (2) fractals are widely used as a graphics tool for generating natural-looking shapes, and (3) a survey of natural imagery has shown that the 3-D fractal surface model, transformed by the image formation process, furnishes an accurate description of both textured and shaded image regions. This characterization of image regions has been shown to be stable over transformations of scale and linear transforms of intensity. \n \nMuch work has been accomplished that is relevant to computing 3-D information from the image data, and the computation of a 3-D fractal-based representation from actual image data has been demonstrated using an image of a mountain. This example shows the potential of a fractal-based representation for efficiently computing good 3-D representations of natural shapes, including such seemingly-difficult cases as mountains, clumps of leaves and clouds."
            },
            "slug": "Fractal-Based-Description-Pentland",
            "title": {
                "fragments": [],
                "text": "Fractal-Based Description"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This example shows the potential of a fractal-based representation for efficiently computing good 3-D representations of natural shapes, including such seemingly-difficult cases as mountains, clumps of leaves and clouds."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1788375"
                        ],
                        "name": "D. Waltz",
                        "slug": "D.-Waltz",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Waltz",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Waltz"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 61975913,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "b3fba1e0774e98a4e0db83a3a0f0aeb18a8d052b",
            "isKey": false,
            "numCitedBy": 1233,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "A detailed discussion of the standard approach to computer interpretation of line drawings as three-dimensional scenes"
            },
            "slug": "Understanding-Line-drawings-of-Scenes-with-Shadows-Waltz",
            "title": {
                "fragments": [],
                "text": "Understanding Line drawings of Scenes with Shadows"
            },
            "tldr": {
                "abstractSimilarityScore": 78,
                "text": "A detailed discussion of the standard approach to computer interpretation of line drawings as three-dimensional scenes as well as some alternative approaches to this approach are discussed."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145081362"
                        ],
                        "name": "A. Yuille",
                        "slug": "A.-Yuille",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Yuille",
                            "middleNames": [
                                "Loddon"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Yuille"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14815630,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "d352cf71946e7f4b229d30c614e504424633a62a",
            "isKey": false,
            "numCitedBy": 726,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "We characterize some properties of the zero crossings of the Laplacian of signals¿in particular images¿filtered with linear filters, as a function of the scale of the filter (extending recent work by Witkin [16]). We prove that in any dimension the only filter that does not create generic zero crossings as the scale increases is the Gaussian. This result can be generalized to apply to level crossings of any linear differential operator: it applies in particular to ridges and ravines in the image intensity. In the case of the second derivative along the gradient, there is no filter that avoids creation of zero crossings, unless the filtering is performed after the derivative is applied."
            },
            "slug": "Scaling-Theorems-for-Zero-Crossings-Yuille-Poggio",
            "title": {
                "fragments": [],
                "text": "Scaling Theorems for Zero Crossings"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "It is proved that in any dimension the only filter that does not create generic zero crossings as the scale increases is the Gaussian and this result can be generalized to apply to level crossings of any linear differential operator."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145619278"
                        ],
                        "name": "H. Whitney",
                        "slug": "H.-Whitney",
                        "structuredName": {
                            "firstName": "Hassler",
                            "lastName": "Whitney",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Whitney"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 119995634,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "8c3ec9661c9ec454d2e365c2cc5065c803384c61",
            "isKey": false,
            "numCitedBy": 492,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "Let f 0 be a mapping of an open set R in n-space E n into m-space E m . Let us consider, along with f 0, all mappings f which are sufficiently good approximations to f 0. By the Weierstrass Approximation Theorem, there are such mappings f which are analytic; in fact, (see [5], Lemma 6) we may make f approximate to f 0 throughout R arbitrarily well, and if f 0 is r-smooth (i.e., has continuous partial derivatives of orders ≦r), r finite, we may make corresponding derivatives of fapproximate to those of f 0."
            },
            "slug": "On-Singularities-of-Mappings-of-Euclidean-Spaces.-Whitney",
            "title": {
                "fragments": [],
                "text": "On Singularities of Mappings of Euclidean Spaces. I. Mappings of the Plane Into the Plane"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1955
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50481099"
                        ],
                        "name": "N. Goodman",
                        "slug": "N.-Goodman",
                        "structuredName": {
                            "firstName": "Nelson",
                            "lastName": "Goodman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Goodman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 170834415,
            "fieldsOfStudy": [
                "Philosophy"
            ],
            "id": "67187948c6da7e78215efce46dcd1435faca9de7",
            "isKey": false,
            "numCitedBy": 1630,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "liELsoN Goodman's second book,1 which represents?excepting the first chapter, a reprint of the well-known paper, \"The Prob lem of Counterfactual Conditionals\"?the \"Special Lectures in Philosophy\" he delivered at the University of London in 1953, is small in volume but rich in content. There is a clear thread run ning through its four chapters: counterf actual conditionals (which in recent years have given such headaches to several ana lytic philosophers) speak about possible non-actual 2 events. But Goodman cannot accept talk about possible events or entities in good philosophical conscience; according to his \"actualist\" onto logy, as we might call it, there are no possibilities, just as for a nominalist there are no classes and other abstract entities. To put it in the formal mode of speech: he wants to find a way of trans lating all modal talk into a non-modal language. Guided by this motivation, he proceeds to examine the distinction between \"law like\" and \"accidental\" statements and, after an impressive display of analytical acumen, comes to the conclusion that the solution of this problem of explication is one with the solution of the problem of induction: what is the criterion of reasonableness of an inductive inference? How are warranted predictions to be dis tinguished from unwarranted ones? There seem to me, however, to be serious flaws in Goodman's intricate chain of argument, which I wish to examine in some detail."
            },
            "slug": "Fact,-Fiction,-and-Forecast-Goodman",
            "title": {
                "fragments": [],
                "text": "Fact, Fiction, and Forecast"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1955
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31338632"
                        ],
                        "name": "E. Riseman",
                        "slug": "E.-Riseman",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Riseman",
                            "middleNames": [
                                "M."
                            ],
                            "suffix": ""
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Riseman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1733922"
                        ],
                        "name": "A. Hanson",
                        "slug": "A.-Hanson",
                        "structuredName": {
                            "firstName": "Allen",
                            "lastName": "Hanson",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Hanson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 202767279,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c64d7a25a406fbf6fae266dc9f04f3ce796a9873",
            "isKey": false,
            "numCitedBy": 726,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Computer-Vision-Systems-Riseman-Hanson",
            "title": {
                "fragments": [],
                "text": "Computer Vision Systems"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102920774"
                        ],
                        "name": "M. D. Carmo",
                        "slug": "M.-D.-Carmo",
                        "structuredName": {
                            "firstName": "Manfredo",
                            "lastName": "Carmo",
                            "middleNames": [
                                "P.",
                                "do"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. D. Carmo"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 35089975,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "c3eb42dccf5f00e84c7087ed0e31f62bbc5b63f1",
            "isKey": false,
            "numCitedBy": 2273,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Curves: Parametrized Curves. 2. Regular Surfaces: Regular Surfaces Inverse Images of Regular Values. 3. Geometry of the Gauss Map: Definition of the Gauss Map and Its Fundamental Properties. 4. Intrinsic Geometry of Surfaces: Isometrics Conformal Maps. 5. Global Differential Geometry: Rigidity of the Sphere."
            },
            "slug": "Differential-geometry-of-curves-and-surfaces-Carmo",
            "title": {
                "fragments": [],
                "text": "Differential geometry of curves and surfaces"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This paper presents a meta-geometry of Surfaces: Isometrics Conformal Maps, which describes how the model derived from the Gauss Map changed over time to reflect the role of curvature in the model construction."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6234493"
                        ],
                        "name": "D. Hilbert",
                        "slug": "D.-Hilbert",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hilbert",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hilbert"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1451145532"
                        ],
                        "name": "S. Cohn-Vossen",
                        "slug": "S.-Cohn-Vossen",
                        "structuredName": {
                            "firstName": "S.",
                            "lastName": "Cohn-Vossen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Cohn-Vossen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 120461262,
            "fieldsOfStudy": [
                "Mathematics",
                "Physics"
            ],
            "id": "6da207686c25668967ee6891a1a64636a64bdb0f",
            "isKey": false,
            "numCitedBy": 764,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The simplest curves and surfaces Regular systems of points Projective configurations Differential geometry Kinematics Topology Index."
            },
            "slug": "Geometry-and-the-Imagination-Hilbert-Cohn-Vossen",
            "title": {
                "fragments": [],
                "text": "Geometry and the Imagination"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1952
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38663378"
                        ],
                        "name": "J. Fodor",
                        "slug": "J.-Fodor",
                        "structuredName": {
                            "firstName": "Jerry",
                            "lastName": "Fodor",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Fodor"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18395814,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "92ebd4d0e7b8e039400bd01dd81daf07e13a613f",
            "isKey": false,
            "numCitedBy": 8606,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Modularity-of-mind-Fodor",
            "title": {
                "fragments": [],
                "text": "Modularity of mind"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31338632"
                        ],
                        "name": "E. Riseman",
                        "slug": "E.-Riseman",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Riseman",
                            "middleNames": [
                                "M."
                            ],
                            "suffix": ""
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Riseman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1733922"
                        ],
                        "name": "A. Hanson",
                        "slug": "A.-Hanson",
                        "structuredName": {
                            "firstName": "Allen",
                            "lastName": "Hanson",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Hanson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 202767279,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c64d7a25a406fbf6fae266dc9f04f3ce796a9873",
            "isKey": false,
            "numCitedBy": 726,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Computer-Vision-Systems-Riseman-Hanson",
            "title": {
                "fragments": [],
                "text": "Computer Vision Systems"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2030891"
                        ],
                        "name": "B. Skyrms",
                        "slug": "B.-Skyrms",
                        "structuredName": {
                            "firstName": "Brian",
                            "lastName": "Skyrms",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Skyrms"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 215874689,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "19111c4fd84861ff9f862daf15ec058f9b0885bb",
            "isKey": false,
            "numCitedBy": 113,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Choice-And-Chance-Skyrms",
            "title": {
                "fragments": [],
                "text": "Choice And Chance"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1966
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "11502718"
                        ],
                        "name": "L. Cohen",
                        "slug": "L.-Cohen",
                        "structuredName": {
                            "firstName": "L.",
                            "lastName": "Cohen",
                            "middleNames": [
                                "Jonathan"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Cohen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49430820"
                        ],
                        "name": "J. Nicod",
                        "slug": "J.-Nicod",
                        "structuredName": {
                            "firstName": "Jean",
                            "lastName": "Nicod",
                            "middleNames": [
                                "Marc"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Nicod"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145592740"
                        ],
                        "name": "J. Bell",
                        "slug": "J.-Bell",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Bell",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Bell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143700170"
                        ],
                        "name": "M. Woods",
                        "slug": "M.-Woods",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Woods",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Woods"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 170609715,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "c4ef752bf2d6c826fcc81f0be111eb9415932f3d",
            "isKey": false,
            "numCitedBy": 35,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Geometry-and-Induction.-Cohen-Nicod",
            "title": {
                "fragments": [],
                "text": "Geometry and Induction."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145731525"
                        ],
                        "name": "I. Levi",
                        "slug": "I.-Levi",
                        "structuredName": {
                            "firstName": "Isaac",
                            "lastName": "Levi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Levi"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 166845723,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4bd7b63d5aa9252c76da8de2eddfce42d6693fb3",
            "isKey": false,
            "numCitedBy": 1050,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-Enterprise-Of-Knowledge-Levi",
            "title": {
                "fragments": [],
                "text": "The Enterprise Of Knowledge"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50241374"
                        ],
                        "name": "W. Turton",
                        "slug": "W.-Turton",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Turton",
                            "middleNames": [
                                "Harry"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Turton"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 160585536,
            "fieldsOfStudy": [
                "History"
            ],
            "id": "1c4f971e385e2596a389bc7977a54ed60af7c972",
            "isKey": false,
            "numCitedBy": 30,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-conchological-dictionary-of-the-British-Islands-Turton",
            "title": {
                "fragments": [],
                "text": "A conchological dictionary of the British Islands"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1819
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1691087"
                        ],
                        "name": "J. Hollerbach",
                        "slug": "J.-Hollerbach",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Hollerbach",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Hollerbach"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 119030960,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "778dac9d5f1a52a1d1cf7c01f9e5354e6cb2ec82",
            "isKey": false,
            "numCitedBy": 52,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Hierarchical-Shape-Description-of-Objects-by-and-of-Hollerbach",
            "title": {
                "fragments": [],
                "text": "Hierarchical Shape Description of Objects by Selection and Modification of Prototypes"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144789756"
                        ],
                        "name": "R. Gregory",
                        "slug": "R.-Gregory",
                        "structuredName": {
                            "firstName": "RICHARD L.",
                            "lastName": "Gregory",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Gregory"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 62208580,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "46daa9046cb2364122dc7a237f754d77e6d6dc36",
            "isKey": false,
            "numCitedBy": 946,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-intelligent-eye-Gregory",
            "title": {
                "fragments": [],
                "text": "The intelligent eye"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1970
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143863790"
                        ],
                        "name": "J. Beck",
                        "slug": "J.-Beck",
                        "structuredName": {
                            "firstName": "Jacob",
                            "lastName": "Beck",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Beck"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69522882"
                        ],
                        "name": "B. Hope",
                        "slug": "B.-Hope",
                        "structuredName": {
                            "firstName": "Barbara",
                            "lastName": "Hope",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Hope"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143766793"
                        ],
                        "name": "A. Rosenfeld",
                        "slug": "A.-Rosenfeld",
                        "structuredName": {
                            "firstName": "Azriel",
                            "lastName": "Rosenfeld",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rosenfeld"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60365087,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4969a400aef019c0ca64b8853a7eee5de8d80717",
            "isKey": false,
            "numCitedBy": 309,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Human-and-Machine-Vision-Beck-Hope",
            "title": {
                "fragments": [],
                "text": "Human and Machine Vision"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1691804"
                        ],
                        "name": "D. Ballard",
                        "slug": "D.-Ballard",
                        "structuredName": {
                            "firstName": "Dana",
                            "lastName": "Ballard",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Ballard"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48726084"
                        ],
                        "name": "Christopher M. Brown",
                        "slug": "Christopher-M.-Brown",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Brown",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Christopher M. Brown"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 195995446,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1e26162d70f04da2091d1aa011f6999b76cbddff",
            "isKey": false,
            "numCitedBy": 4640,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Computer-Vision-Ballard-Brown",
            "title": {
                "fragments": [],
                "text": "Computer Vision"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31489430"
                        ],
                        "name": "A. Liberman",
                        "slug": "A.-Liberman",
                        "structuredName": {
                            "firstName": "Alvin",
                            "lastName": "Liberman",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Liberman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145549314"
                        ],
                        "name": "F. Cooper",
                        "slug": "F.-Cooper",
                        "structuredName": {
                            "firstName": "Franklin",
                            "lastName": "Cooper",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Cooper"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "51072738"
                        ],
                        "name": "D. Shankweiler",
                        "slug": "D.-Shankweiler",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "Shankweiler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Shankweiler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1403941699"
                        ],
                        "name": "M. Studdert-Kennedy",
                        "slug": "M.-Studdert-Kennedy",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Studdert-Kennedy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Studdert-Kennedy"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 42296795,
            "fieldsOfStudy": [
                "Computer Science",
                "Medicine"
            ],
            "id": "e09c410be443fa9189bb448cf8150e984bed1b91",
            "isKey": false,
            "numCitedBy": 3393,
            "numCiting": 90,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Perception-of-the-speech-code.-Liberman-Cooper",
            "title": {
                "fragments": [],
                "text": "Perception of the speech code."
            },
            "venue": {
                "fragments": [],
                "text": "Psychological review"
            },
            "year": 1967
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5875328"
                        ],
                        "name": "I. Rock",
                        "slug": "I.-Rock",
                        "structuredName": {
                            "firstName": "Irvin",
                            "lastName": "Rock",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Rock"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 39441222,
            "fieldsOfStudy": [
                "Psychology",
                "Medicine"
            ],
            "id": "1a83d68f17842d6a226fabf252b355321ca89ac0",
            "isKey": false,
            "numCitedBy": 203,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-perception-of-disoriented-figures.-Rock",
            "title": {
                "fragments": [],
                "text": "The perception of disoriented figures."
            },
            "venue": {
                "fragments": [],
                "text": "Scientific American"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50359956"
                        ],
                        "name": "F. Attneave",
                        "slug": "F.-Attneave",
                        "structuredName": {
                            "firstName": "Fred",
                            "lastName": "Attneave",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Attneave"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 38212327,
            "fieldsOfStudy": [
                "Psychology",
                "Medicine"
            ],
            "id": "65ba4ae8e786bc18f99ac0e003c3748f2ae67adf",
            "isKey": false,
            "numCitedBy": 391,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Multistability-in-perception.-Attneave",
            "title": {
                "fragments": [],
                "text": "Multistability in perception."
            },
            "venue": {
                "fragments": [],
                "text": "Scientific American"
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1738591"
                        ],
                        "name": "T. Binford",
                        "slug": "T.-Binford",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Binford",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Binford"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 37551917,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ffcebfa2f4a8cc094f14d8ba68f8214246560b56",
            "isKey": false,
            "numCitedBy": 318,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Inferring-Surfaces-from-Images-Binford",
            "title": {
                "fragments": [],
                "text": "Inferring Surfaces from Images"
            },
            "venue": {
                "fragments": [],
                "text": "Artif. Intell."
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1688328"
                        ],
                        "name": "A. Bobick",
                        "slug": "A.-Bobick",
                        "structuredName": {
                            "firstName": "Aaron",
                            "lastName": "Bobick",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Bobick"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 5175051,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "37ef821e03fcc915561389f009d8e73f1328ecc0",
            "isKey": false,
            "numCitedBy": 14,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-hybrid-approach-to-structure-from-motion-Bobick",
            "title": {
                "fragments": [],
                "text": "A hybrid approach to structure-from-motion"
            },
            "venue": {
                "fragments": [],
                "text": "Workshop on Motion"
            },
            "year": 1986
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 47,
        "totalPages": 5
    },
    "page_url": "https://www.semanticscholar.org/paper/Parts-of-recognition-Hoffman-Richards/150662e38fc67ca81ac93faf981cf2151fbf6a9a?sort=total-citations"
}