{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743045"
                        ],
                        "name": "S. Ullman",
                        "slug": "S.-Ullman",
                        "structuredName": {
                            "firstName": "Shimon",
                            "lastName": "Ullman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ullman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 146278985,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "c2d2fefc1c61298059f9a160f190e6957587b74e",
            "isKey": false,
            "numCitedBy": 2090,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This book uses the methodology of artificial intelligence to investigate the phenomena of visual motion perception: how the visual system constructs descriptions of the environment in terms of objects, their three-dimensional shape, and their motion through space, on the basis of the changing image that reaches the eye. The author has analyzed the computations performed in the course of visual motion analysis. Workable schemes able to perform certain tasks performed by the visual system have been constructed and used as vehicles for investigating the problems faced by the visual system and its methods for solving them.Two major problems are treated: first, the correspondence problem, which concerns the identification of image elements that represent the same object at different times, thereby maintaining the perceptual identity of the object in motion or in change. The second problem is the three-dimensional interpretation of the changing image once a correspondence has been established.The author's computational approach to visual theory makes the work unique, and it should be of interest to psychologists working in visual perception and readers interested in cognitive studies in general, as well as computer scientists interested in machine vision, theoretical neurophysiologists, and philosophers of science."
            },
            "slug": "The-Interpretation-of-Visual-Motion-Ullman",
            "title": {
                "fragments": [],
                "text": "The Interpretation of Visual Motion"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2053178525"
                        ],
                        "name": "G. Johansson",
                        "slug": "G.-Johansson",
                        "structuredName": {
                            "firstName": "Gunnar",
                            "lastName": "Johansson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Johansson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 24237357,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "026740573cb500034952068039a757dd377364d8",
            "isKey": false,
            "numCitedBy": 713,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "In this article the author uses projective relations as the theoretical foundation of his investigations of visual space and motion. Several laboratory experiments involving perceptual vector analysis and its geometric basis are described. In most of the experiments the visual stimuli consisted of computer-controlled patterns displayed on a televisionlike screen and projected into the eyes of subjects by means of a collimating device that removed parallax as well as the possibility of seeing the screen. A common characteristics of the experiments was that the observer was evidently not free to choose between a Euclidean interpretation of the changing geometry of the figure in the display and a projective interpretation. For example, the observer could not persuade himself that what he was seeing was simply a square growing larger and smaller in the same visual plane; his visual system insisted on telling him that he was seeing a square of constant size approaching and receding. Hence he perceived rigid motion in depth, rotation in a specific slant, bending in depth and so on, paired with the highest possible degree of object constancy. Further experiments were conducted to determine if the principles of perceptual analysis hold true for the more complex paterns of motions encountered in everyday life. These experiments led to the conclusion that during locomotion the components of the human visual environment are interpreted as rigid structures in relative motion."
            },
            "slug": "Visual-motion-perception.-Johansson",
            "title": {
                "fragments": [],
                "text": "Visual motion perception."
            },
            "tldr": {
                "abstractSimilarityScore": 66,
                "text": "The author uses projective relations as the theoretical foundation of his investigations of visual space and motion and concludes that during locomotion the components of the human visual environment are interpreted as rigid structures in relative motion."
            },
            "venue": {
                "fragments": [],
                "text": "Scientific American"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2053178525"
                        ],
                        "name": "G. Johansson",
                        "slug": "G.-Johansson",
                        "structuredName": {
                            "firstName": "Gunnar",
                            "lastName": "Johansson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Johansson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 54046837,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "58ea2fa0580b2117618be6e1cc9658a5c9531dba",
            "isKey": false,
            "numCitedBy": 4094,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper reports the first phase of a research program on visual perception of motion patterns characteristic of living organisms in locomotion. Such motion patterns in animals and men are termed here as biological motion. They are characterized by a far higher degree of complexity than the patterns of simple mechanical motions usually studied in our laboratories. In everyday perceptions, the visual information from biological motion and from the corresponding figurative contour patterns (the shape of the body) are intermingled. A method for studying information from the motion pattern per se without interference with the form aspect was devised. In short, the motion of the living body was represented by a few bright spots describing the motions of the main joints. It is found that 10–12 such elements in adequate motion combinations in proximal stimulus evoke a compelling impression of human walking, running, dancing, etc. The kinetic-geometric model for visual vector analysis originally developed in the study of perception of motion combinations of the mechanical type was applied to these biological motion patterns. The validity of this model in the present context was experimentally tested and the results turned out to be highly positive."
            },
            "slug": "Visual-perception-of-biological-motion-and-a-model-Johansson",
            "title": {
                "fragments": [],
                "text": "Visual perception of biological motion and a model for its analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The kinetic-geometric model for visual vector analysis originally developed in the study of perception of motion combinations of the mechanical type was applied to biological motion patterns and the results turned out to be highly positive."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48526970"
                        ],
                        "name": "W. Reichardt",
                        "slug": "W.-Reichardt",
                        "structuredName": {
                            "firstName": "Werner",
                            "lastName": "Reichardt",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Reichardt"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 28594271,
            "fieldsOfStudy": [
                "Biology",
                "Computer Science"
            ],
            "id": "73b211cb9e09e00d94ceeb5c2ad91bebd3c855f3",
            "isKey": false,
            "numCitedBy": 240,
            "numCiting": 95,
            "paperAbstract": {
                "fragments": [],
                "text": "Visual information processing in the nervous system of flies begins with a large array of photoreceptors, which transduce a light intensity pattern, and culminates in a behavioural response that depends on that pattern. In the previous paper we have given a quantitative description of visual control of flight orientation in the fly. This description can account for fixation, tracking and some instances of spontaneous pattern preference behaviour. The phenomenological theory outlines the basic logical organization of the visual control system of the fly. It requires the neural network between the receptors and the flight muscles to perform two main computations on the visual input. One computation extracts movement information (the term r (ψ)ψ b of the phenomenological equation). The other provides position information (the term D (ψ))."
            },
            "slug": "Visual-control-of-orientation-behaviour-in-the-fly.-Poggio-Reichardt",
            "title": {
                "fragments": [],
                "text": "Visual control of orientation behaviour in the fly. Part II. Towards the underlying neural interactions."
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The phenomenological theory outlines the basic logical organization of the visual control system of the fly and describes the neural network between the receptors and the flight muscles to perform two main computations on the visual input."
            },
            "venue": {
                "fragments": [],
                "text": "Quarterly reviews of biophysics"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743045"
                        ],
                        "name": "S. Ullman",
                        "slug": "S.-Ullman",
                        "structuredName": {
                            "firstName": "Shimon",
                            "lastName": "Ullman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ullman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 9630018,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "2dcffe8606e9fd3fb611be6f1c9571f49664b263",
            "isKey": false,
            "numCitedBy": 713,
            "numCiting": 127,
            "paperAbstract": {
                "fragments": [],
                "text": "The construction of directionally selective units, and their use in the processing of visual motion, are considered. The zero crossings of ∇2G(x, y) ∗ I(x, y) are located, as in Marr & Hildreth (1980). That is, the image is filtered through centre-surround receptive fields, and the zero values in the output are found. In addition, the time derivative ∂[∇2G(x, y) ∗ l(x, y)]/∂t is measured at the zero crossings, and serves to constrain the local direction of motion to within 180°. The direction of motion can be determined in a second stage, for example by combining the local constraints. The second part of the paper suggests a specific model of the information processing by the X and Y cells of the retina and lateral geniculate nucleus, and certain classes of cortical simple cells. A number of psychophysical and neurophysiological predictions are derived from the theory."
            },
            "slug": "Directional-selectivity-and-its-use-in-early-visual-Marr-Ullman",
            "title": {
                "fragments": [],
                "text": "Directional selectivity and its use in early visual processing"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The second part of the paper suggests a specific model of the information processing by the X and Y cells of the retina and lateral geniculate nucleus, and certain classes of cortical simple cells."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1923840"
                        ],
                        "name": "W. Clocksin",
                        "slug": "W.-Clocksin",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Clocksin",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Clocksin"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 43056394,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "4d0af7859ceb6f8406ce965892b64872b78ebaf0",
            "isKey": false,
            "numCitedBy": 147,
            "numCiting": 32,
            "paperAbstract": {
                "fragments": [],
                "text": "I present here two results from investigations of a computational theory of how the human visual system may obtain information about the physical environment directly from optically sensed velocity fields (optical flow). Previous work has shown how optical flow arises when an observer moves through the static environment. The inverse problem is investigated here: how to recover intrinsic characteristics of the environment from optical flow patterns. The first result is a method for computing the local slant of surfaces relative to the moving observer. The second result is a method for detecting and discriminating among the five types of edges that form the boundaries of surfaces. The results have been formalised as mathematical equations, a physiological model, and a computer program. Properties and predictions resulting from these formal models are discussed with regard to experimental findings in psychophysics."
            },
            "slug": "Perception-of-Surface-Slant-and-Edge-Labels-from-A-Clocksin",
            "title": {
                "fragments": [],
                "text": "Perception of Surface Slant and Edge Labels from Optical Flow: A Computational Approach"
            },
            "tldr": {
                "abstractSimilarityScore": 94,
                "text": "Two results from investigations of a computational theory of how the human visual system may obtain information about the physical environment directly from optically sensed velocity fields (optical flow) are presented."
            },
            "venue": {
                "fragments": [],
                "text": "Perception"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17055992,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6b4fe4aa4d66fecc7b2869569002714d91d0b3f7",
            "isKey": false,
            "numCitedBy": 12432,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "What chiefly distinguishes cerebral cortex from other parts of the central nervous system is the great diversity of its cell types and interconnexions. It would be astonishing if such a structure did not profoundly modify the response patterns of fibres coming into it. In the cat's visual cortex, the receptive field arrangements of single cells suggest that there is indeed a degree of complexity far exceeding anything yet seen at lower levels in the visual system. In a previous paper we described receptive fields of single cortical cells, observing responses to spots of light shone on one or both retinas (Hubel & Wiesel, 1959). In the present work this method is used to examine receptive fields of a more complex type (Part I) and to make additional observations on binocular interaction (Part II). This approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours. In the past, the technique of recording evoked slow waves has been used with great success in studies of functional anatomy. It was employed by Talbot & Marshall (1941) and by Thompson, Woolsey & Talbot (1950) for mapping out the visual cortex in the rabbit, cat, and monkey. Daniel & Whitteiidge (1959) have recently extended this work in the primate. Most of our present knowledge of retinotopic projections, binocular overlap, and the second visual area is based on these investigations. Yet the method of evoked potentials is valuable mainly for detecting behaviour common to large populations of neighbouring cells; it cannot differentiate functionally between areas of cortex smaller than about 1 mm2. To overcome this difficulty a method has in recent years been developed for studying cells separately or in small groups during long micro-electrode penetrations through nervous tissue. Responses are correlated with cell location by reconstructing the electrode tracks from histological material. These techniques have been applied to"
            },
            "slug": "Receptive-fields,-binocular-interaction-and-in-the-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields, binocular interaction and functional architecture in the cat's visual cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This method is used to examine receptive fields of a more complex type and to make additional observations on binocular interaction and this approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1962
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "118988170"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "Dale",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 120306234,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "ab46fdac0a3b484cd58978ba71dc71631b49f70a",
            "isKey": false,
            "numCitedBy": 989,
            "numCiting": 57,
            "paperAbstract": {
                "fragments": [],
                "text": "An algorithm is proposed for solving the stereoscopic matching problem. The algorithm consists of five steps: (1) Each image is filtered at different orientations with bar masks of four sizes that increase with eccentricity; the equivalent filters are one or two octaves wide. (2) Zero-crossings in the filtered images, which roughly correspond to edges, are localized. Positions of the ends of lines and edges are also found. (3) For each mask orientation and size, matching takes place between pairs of zero-crossings or terminations of the same sign in the two images, for a range of disparities up to about the width of the mask’s central region. (4) Wide masks can control vergence movements, thus causing small masks to come into correspondence. (5) When a correspondence is achieved, it is stored in a dynamic buffer, called the 2½-D sketch. It is shown that this proposal provides a theoretical framework for most existing psychophysical and neurophysiological data about stereopsis. Several critical experimental predictions are also made, for instance about the size of Panum’s area under various conditions. The results of such experiments would tell us whether, for example, co-operativity is necessary for the matching process."
            },
            "slug": "A-computational-theory-of-human-stereo-vision-Marr-Poggio",
            "title": {
                "fragments": [],
                "text": "A computational theory of human stereo vision"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31035897"
                        ],
                        "name": "David N. Lee",
                        "slug": "David-N.-Lee",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Lee",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "David N. Lee"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16516362"
                        ],
                        "name": "P. E. Reddish",
                        "slug": "P.-E.-Reddish",
                        "structuredName": {
                            "firstName": "Paul",
                            "lastName": "Reddish",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. E. Reddish"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 4317387,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "de248ea394319218db6c3cfaa92c490e670e04e3",
            "isKey": false,
            "numCitedBy": 692,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "Getting around the environment and doing things requires precise timing of body movements. Moreover, there is often little time available to pick up the visual information to organize the action. Consider, for instance, a batsman hitting a fast bowler or a bird alighting on a twig swaying in the wind. The visual and motor systems evidently work in close harmony, vision rapidly and directly providing the information for controlling the action. Here, we present evidence in support of a theory to explain how actions are visually tuned. The evidence derives from a film analysis of the spectacular plunge dive of one of Britain's largest seabirds, the gannet (Sula bassana)."
            },
            "slug": "Plummeting-gannets:-a-paradigm-of-ecological-optics-Lee-Reddish",
            "title": {
                "fragments": [],
                "text": "Plummeting gannets: a paradigm of ecological optics"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "Evidence is presented in support of a theory to explain how actions are visually tuned, derived from a film analysis of the spectacular plunge dive of one of Britain's largest seabirds, the gannet."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153720178"
                        ],
                        "name": "J. Potter",
                        "slug": "J.-Potter",
                        "structuredName": {
                            "firstName": "Jerry",
                            "lastName": "Potter",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Potter"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 10963011,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "bd98ad91d611a940f62b6b6d9cfa9303da6e75b6",
            "isKey": false,
            "numCitedBy": 37,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "Although motion is one of the most fundamental aspects of the visual world, its use has not been widely explored in the field of scene description. This correspondence describes a program that demonstrates the feasibility of segmenting a scene into regions on the basis of velocity. A velocity measure is obtained by determining the amount of displacement of a reference feature between two pictures of the same scene. The pictures are taken only a short time apart so that the reference features can be correlated between the pictures on the basis of spatial position alone. This velocity measurement is associated with absolute reference points superimposed over the scene. It is assumed that all parts of an object have the same velocity measurement. Thus the velocity measurements associated with the reference points provide a means of classifying them as ``belonging'' to the same object. Points ``inside'' moving objects fall into either of two velocity measurement classes, which are easily correlated. Since the velocity of an object is independent of its color, a scene is segmented into regions that contain complete objects even if the objects are not monochromatic."
            },
            "slug": "Velocity-as-a-Cue-to-Segmentation-Potter",
            "title": {
                "fragments": [],
                "text": "Velocity as a Cue to Segmentation"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "A program is described that demonstrates the feasibility of segmenting a scene into regions on the basis of velocity by determining the amount of displacement of a reference feature between two pictures of the same scene."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Systems, Man, and Cybernetics"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "92269846"
                        ],
                        "name": "H. C. Longuet-Higgins",
                        "slug": "H.-C.-Longuet-Higgins",
                        "structuredName": {
                            "firstName": "Hugh",
                            "lastName": "Longuet-Higgins",
                            "middleNames": [
                                "Christopher"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. C. Longuet-Higgins"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2476541"
                        ],
                        "name": "K. Prazdny",
                        "slug": "K.-Prazdny",
                        "structuredName": {
                            "firstName": "K.",
                            "lastName": "Prazdny",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Prazdny"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 28679048,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "810bd193898f9c58c93cfddd1c497eb5e2f342bc",
            "isKey": false,
            "numCitedBy": 1479,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "It is shown that from a monocular view of a rigid, textured, curved surface it is possible, in principle, to determine the gradient of the surface at any point, and the motion of the eye relative to it, from the velocity field of the changing retinal image, and its first and second spatial derivatives. The relevant equations are redundant, thus providing a test of the rigidity assumption. They involve, among other observable quantities, the components of shear of the retinal velocity field, suggesting that the visual system may possess specialized channels for computing these components."
            },
            "slug": "The-interpretation-of-a-moving-retinal-image-Longuet-Higgins-Prazdny",
            "title": {
                "fragments": [],
                "text": "The interpretation of a moving retinal image"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "It is shown that from a monocular view of a rigid, textured, curved surface it is possible, in principle, to determine the gradient of the surface at any point, and the motion of the eye relative to it, from the velocity field of the changing retinal image, and its first and second spatial derivatives."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49314602"
                        ],
                        "name": "H. Wallach",
                        "slug": "H.-Wallach",
                        "structuredName": {
                            "firstName": "Hans",
                            "lastName": "Wallach",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Wallach"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1444543493"
                        ],
                        "name": "D. O'connell",
                        "slug": "D.-O'connell",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "O'connell",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. O'connell"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11979303,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "6cf482e76ce91934c9069fd3768e2c4ccdf9fb38",
            "isKey": false,
            "numCitedBy": 691,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "The problem of how three-dimensional form is perceived in spite of the fact that pertinent stimulation consists only in two-dimensional retinal images has been only partly solved. Much is known about the impressive effectiveness of binocular disparity. However, the excellent perception of threedimensional form in monocular vision has remained essentially unexplained. It has been proposed that some patterns of stimulation on the retina give rise to three-dimensional experiences, because visual processes differ in the spontaneous organization that results from certain properties of the retinal pattern. Rules of organization are supposed to exist according to which most retinal projections of three-dimensional forms happen to produce three-dimensional percepts and most retinal images of flat forms lead to flat forms in experience also. This view has been held mainly by gestalt psychologists. Another approach to this problem maintains that the projected stimulus patterns are interpreted on the basis of previous experience, either visual"
            },
            "slug": "The-kinetic-depth-effect.-Wallach-O'connell",
            "title": {
                "fragments": [],
                "text": "The kinetic depth effect."
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "The problem of how three-dimensional form is perceived in spite of the fact that pertinent stimulation consists only in two-dimensional retinal images has been only partly solved."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of experimental psychology"
            },
            "year": 1953
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2544594"
                        ],
                        "name": "J. Frisby",
                        "slug": "J.-Frisby",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Frisby",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Frisby"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 27375727,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "c76b161eb3e3121c7481a8d7e3301aebfdc7aaa2",
            "isKey": false,
            "numCitedBy": 26,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-effect-of-stimulus-orientation-on-the-phi-Frisby",
            "title": {
                "fragments": [],
                "text": "The effect of stimulus orientation on the phi phenomenon."
            },
            "venue": {
                "fragments": [],
                "text": "Vision research"
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5647202"
                        ],
                        "name": "J. Lettvin",
                        "slug": "J.-Lettvin",
                        "structuredName": {
                            "firstName": "Jerome",
                            "lastName": "Lettvin",
                            "middleNames": [
                                "Y."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Lettvin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2701850"
                        ],
                        "name": "H. Maturana",
                        "slug": "H.-Maturana",
                        "structuredName": {
                            "firstName": "Humberto",
                            "lastName": "Maturana",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Maturana"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4605464"
                        ],
                        "name": "W. McCulloch",
                        "slug": "W.-McCulloch",
                        "structuredName": {
                            "firstName": "Warren",
                            "lastName": "McCulloch",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. McCulloch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50314979"
                        ],
                        "name": "W. Pitts",
                        "slug": "W.-Pitts",
                        "structuredName": {
                            "firstName": "Walter",
                            "lastName": "Pitts",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Pitts"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8739509,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "bc4e084831b9f987826b2cf184356e347ee155f8",
            "isKey": false,
            "numCitedBy": 1756,
            "numCiting": 37,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper, we analyze the activity of single fibers in the optic nerve of a frog. Our method is to find what sort of stimulus causes the largest activity in one nerve fiber and then what is the exciting aspect of that stimulus such that variations in everything else cause little change in the response. It has been known for the past 20 years that each fiber is connected not to a few rods and cones in the retina but to very many over a fair area. Our results show that for the most part within that area, it is not the light intensity itself but rather the pattern of local variation of intensity that is the exciting factor. There are four types of fibers, each type concerned with a different sort of pattern. Each type is uniformly distributed over the whole retina of the frog. Thus, there are four distinct parallel distributed channels whereby the frog's eye informs his brain about the visual image in terms of local pattern independent of average illumination. We describe the patterns and show the functional and anatomical separation of the channels. This work has been done on the frog, and our interpretation applies only to the frog."
            },
            "slug": "What-the-Frog's-Eye-Tells-the-Frog's-Brain-Lettvin-Maturana",
            "title": {
                "fragments": [],
                "text": "What the Frog's Eye Tells the Frog's Brain"
            },
            "tldr": {
                "abstractSimilarityScore": 52,
                "text": "The results show that for the most part within that area of the optic nerve of a frog, it is not the light intensity itself but rather the pattern of local variation of intensity that is the exciting factor."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the IRE"
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3251943"
                        ],
                        "name": "S. Anstis",
                        "slug": "S.-Anstis",
                        "structuredName": {
                            "firstName": "Stuart",
                            "lastName": "Anstis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Anstis"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 38460928,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "149bb3471d98bb9168c0f71aa2f83176df144c95",
            "isKey": false,
            "numCitedBy": 354,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "When two similar pictures, overlapping but slightly displaced, were projected on a screen in alternation, apparent movement could be seen. How similar must successive pictures be to give apparent movement? This is the 'correspondence problem'. Manipulations of the local and global correspondences between pictures included motion phenomena such as reversed apparent movement; a four-stroke oscillatory cycle which gave an illusion of continuous motion in one direction; edges defined by texture, stereoscopic depth, or flicker, kinetic edges; and wave motion. It was concluded that human motion perception may comprise two separate mechanisms. Local point-by-point correlations between pictures are detected by a relatively peripheral system, probably based on directonally selective neural units. More subtle global correspondences are analysed by a more cognitive system which extracts edges before it process motion."
            },
            "slug": "The-perception-of-apparent-movement.-Anstis",
            "title": {
                "fragments": [],
                "text": "The perception of apparent movement."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "Manipulations of the local and global correspondences between pictures included motion phenomena such as reversed apparent movement; a four-stroke oscillatory cycle which gave an illusion of continuous motion in one direction; edges defined by texture, stereoscopic depth, or flicker, kinetic edges; and wave motion."
            },
            "venue": {
                "fragments": [],
                "text": "Philosophical transactions of the Royal Society of London. Series B, Biological sciences"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3672557"
                        ],
                        "name": "W. Levick",
                        "slug": "W.-Levick",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Levick",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Levick"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2958177,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "e11827caa9565f1b126f97865ebc1e28501dba01",
            "isKey": false,
            "numCitedBy": 1562,
            "numCiting": 30,
            "paperAbstract": {
                "fragments": [],
                "text": "Directionally selective single units have recently been found in the cerebral cortex of cats (Hubel, 1959; Hubel & Wiesel, 1959, 1962), the optic tectum of frogs and pigeons (Lettvin, Maturana, McCulloch & Pitts, 1959; Maturana & Frenk, 1963), and the retinae of rabbits (Barlow & Hill, 1963; Barlow, Hill & Levick, 1964). The term 'directionally selective' means that a unit gives a vigorous discharge of impulses when a stimulus object is moved through its receptive field in one direction (called the preferred direction), whereas motion in the reverse direction (called null) evokes little or no response. The preferred direction differs in different units, and the activity of a set of such units signals the direction of movement of objects in the visual field. In the rabbit the preferred and null directions cannot be predicted from a map of the receptive field showing the regions yielding on or off-responses to stationary spots. Furthermore, the preferred direction is unchanged by changing the stimulus; in particular, reversing the contrast of a spot or a black-white border does not reverse the preferred direction. Hubel & Wiesel (1962) thought that the directional selectivity of the cat's cortical neurons could be explained by the asymmetrical arrangement of on and off zones in the receptive field, and the simple interaction of effects summated over these zones, but the foregoing results rule out this explanation, at least in the rabbit's retina (Barlow & Hill, 1963). In the present paper we go on from this point to describe experiments which show, first, that directional selectivity is not due to optical aberrations of some kind and, secondly, that it is not a simple matter of the latency of response varying systematically across the receptive field. After these negative results we describe experiments upon the organization of directional selectivity within the receptive field, and upon its mechanism. These lead us to the conclusion that the ganglion cells responding to a"
            },
            "slug": "The-mechanism-of-directionally-selective-units-in-Barlow-Levick",
            "title": {
                "fragments": [],
                "text": "The mechanism of directionally selective units in rabbit's retina."
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "Experiments are described which show, first, that directional selectivity is not due to optical aberrations of some kind and, secondly, that it is not a simple matter of the latency of response varying systematically across the receptive field."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1965
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144721252"
                        ],
                        "name": "H. Nagel",
                        "slug": "H.-Nagel",
                        "structuredName": {
                            "firstName": "Hans-Hellmut",
                            "lastName": "Nagel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Nagel"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61150434,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "cd156797e9e297c2b152a04d0fbf5fd1591b47c7",
            "isKey": false,
            "numCitedBy": 70,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Formation-of-an-object-concept-by-analysis-of-time-Nagel",
            "title": {
                "fragments": [],
                "text": "Formation of an object concept by analysis of systematic time variations in the optically perceptible environment"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743045"
                        ],
                        "name": "S. Ullman",
                        "slug": "S.-Ullman",
                        "structuredName": {
                            "firstName": "Shimon",
                            "lastName": "Ullman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ullman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11995230,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "b81afd190adcd52190fa31af0841dd7b9695380e",
            "isKey": false,
            "numCitedBy": 876,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "The interpretation of structure from motion is examined from a computional point of view. The question addressed is how the three dimensional structure and motion of objects can be inferred from the two dimensional transformations of their projected images when no three dimensional information is conveyed by the individual projections. The following scheme is proposed: (i) divide the image into groups of four elements each; (ii) test each group for a rigid interpretation; (iii) combine the results obtained in (ii). It is shown that this scheme will correctly decompose scenes containing arbitrary rigid objects in motion, recovering their three dimensional structure and motion. The analysis is based primarily on the ʻstructure from motion’ theorem which states that the structure of four non-coplanar points is recoverable from three orthographic projections. The interpretation scheme is extended to cover perspective projections, and its psychological relevance is discussed."
            },
            "slug": "The-interpretation-of-structure-from-motion-Ullman",
            "title": {
                "fragments": [],
                "text": "The interpretation of structure from motion"
            },
            "tldr": {
                "abstractSimilarityScore": 55,
                "text": "It is shown that this scheme will correctly decompose scenes containing arbitrary rigid objects in motion, recovering their three dimensional structure and motion."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2647487"
                        ],
                        "name": "O. Grüsser",
                        "slug": "O.-Grüsser",
                        "structuredName": {
                            "firstName": "O.",
                            "lastName": "Grüsser",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Grüsser"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1402276021"
                        ],
                        "name": "U. Grüsser-Cornehls",
                        "slug": "U.-Grüsser-Cornehls",
                        "structuredName": {
                            "firstName": "Ursula",
                            "lastName": "Grüsser-Cornehls",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "U. Grüsser-Cornehls"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 140330050,
            "fieldsOfStudy": [
                "Psychology",
                "Biology"
            ],
            "id": "915b2f446f71c173068cac7d7d6b9e0bc1dca085",
            "isKey": false,
            "numCitedBy": 119,
            "numCiting": 322,
            "paperAbstract": {
                "fragments": [],
                "text": "Visual movement perception has to be considered a special perceptual quality of the visual modality as color, brightness, size etc. are sensory qualities for the perception of the visual world (Exner, 1875). Movement detecting neuronal systems are probably present in the nervous system of all animals which respond to visual signals more complicated than simple light-dark stimuli."
            },
            "slug": "Neuronal-Mechanisms-of-Visual-Movement-Perception-Grüsser-Grüsser-Cornehls",
            "title": {
                "fragments": [],
                "text": "Neuronal Mechanisms of Visual Movement Perception and Some Psychophysical and Behavioral Correlations"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Visual movement perception has to be considered a special perceptual quality of the visual modality as color, brightness, size etc. are sensory qualities for the perception of thevisual world."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2160697"
                        ],
                        "name": "R. C. Emerson",
                        "slug": "R.-C.-Emerson",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Emerson",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. C. Emerson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2962919"
                        ],
                        "name": "G. Gerstein",
                        "slug": "G.-Gerstein",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Gerstein",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Gerstein"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 24736936,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "06d0a4cf634fce1e329f68f23976c7f9261e8628",
            "isKey": false,
            "numCitedBy": 124,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Directionally asymmetric (DA) units respond preferentially to one direction of image movement. If that preferred direction is independent of stimulus contrast then the DA unit is considered directionally selective (DS). We have analyzed receptive-field (RF) properties of striate units with these properties by presenting bar-shaped stimuli that are moved in a stepwise sequence. Short interstimulus durations for certain ranges of step size elicit DA responses similar to those from smooth movement, while still allowing identification of on- and off-components of the response. 2. We have been able to isolate three mechanisms underlying DA and DS. The simplest, superposition, explains the dependence of preferred direction on stimulus contrast found in some DA units. It relies completely on asymmetries in static RF regions to provide an advantage for one direction of image motion by means of the simultaneity of image elements leaving an apparently inhibitory region and entering an excitatory one. 3. For all DA and DS units we have encountered forward inhibition of otherwise excitatory influences that reduces the responsiveness in the antipreferred direction. The spatial specificity of inhibitory target RF regions and the nonlinearity of the effect suggest that lateral inhibition may be transmitted via sequence-detecting subunits. 4. Units that do not show superposition in the preferred direction exhibit forward facilitation of responses in a nonlinear and target-specific way which suggests that facilitation may also be transmitted via sequence-detecting subunits. 5. Each of these mechanisms depends on short-lived influences that are laterally transmitted between 0.125 and 0.5 degrees in visual space. These spatial and temporal values are appropriate for the analysis of smooth movement by the visual system. 6. Stepwise movement sequences using dark bars on a bright background demonstrate for some DA units exactly the same mechanisms as demonstrated using bright-bar sequences in other units or, in the case of DS units, in the same units. In such DS units, which do not normally exhibit strong stationary RF asymmetries, differential sensitivity of the nonlinear DS mechanisms to stimulus elements of either contrast will yield an effective preferred movement direction for complex stimuli."
            },
            "slug": "Simple-striate-neurons-in-the-cat.-II.-Mechanisms-Emerson-Gerstein",
            "title": {
                "fragments": [],
                "text": "Simple striate neurons in the cat. II. Mechanisms underlying directional asymmetry and directional selectivity."
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "The simplest, superposition, explains the dependence of preferred direction on stimulus contrast found in some DA units, and differential sensitivity of the nonlinear DS mechanisms to stimulus elements of either contrast will yield an effective preferred movement direction for complex stimuli."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743045"
                        ],
                        "name": "S. Ullman",
                        "slug": "S.-Ullman",
                        "structuredName": {
                            "firstName": "Shimon",
                            "lastName": "Ullman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ullman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 30227102,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "662c49c0fc6ba44d17fe075a70fc9a1696869837",
            "isKey": false,
            "numCitedBy": 44,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "A fundamental process underlying motion perception is the matching of corresponding elements in different views. In this correspondence process spatial separation between elements plays a major role. The relevant separation is shown by the current study to be the two-dimensional, uninterpreted distance, a finding that has an implication to the level at which the correspondence process is carried out. The current findings are compared with earlier results concerning ‘optimality’ of apparent motion to conclude that optimality cannot serve as a measure for the correspondence strength."
            },
            "slug": "Two-Dimensionality-of-the-Correspondence-Process-in-Ullman",
            "title": {
                "fragments": [],
                "text": "Two Dimensionality of the Correspondence Process in Apparent Motion"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The current findings are compared with earlier results concerning ‘optimality’ of apparent motion to conclude that optimality cannot serve as a measure for the correspondence strength."
            },
            "venue": {
                "fragments": [],
                "text": "Perception"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3853990"
                        ],
                        "name": "O. Braddick",
                        "slug": "O.-Braddick",
                        "structuredName": {
                            "firstName": "Oliver",
                            "lastName": "Braddick",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Braddick"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 31795238,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "814a82daaa17585bbf4661b3b6995f64272b6162",
            "isKey": false,
            "numCitedBy": 876,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-short-range-process-in-apparent-motion.-Braddick",
            "title": {
                "fragments": [],
                "text": "A short-range process in apparent motion."
            },
            "venue": {
                "fragments": [],
                "text": "Vision research"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3853990"
                        ],
                        "name": "O. Braddick",
                        "slug": "O.-Braddick",
                        "structuredName": {
                            "firstName": "Oliver",
                            "lastName": "Braddick",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Braddick"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 46136681,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "6dacd4bab95167017486d91c9c869279c94d27fb",
            "isKey": false,
            "numCitedBy": 86,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-masking-of-apparent-motion-in-random-dot-Braddick",
            "title": {
                "fragments": [],
                "text": "The masking of apparent motion in random-dot patterns."
            },
            "venue": {
                "fragments": [],
                "text": "Vision research"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153720178"
                        ],
                        "name": "J. Potter",
                        "slug": "J.-Potter",
                        "structuredName": {
                            "firstName": "Jerry",
                            "lastName": "Potter",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Potter"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 123076436,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "7b541511104fd38430812e792e894af164ab3797",
            "isKey": false,
            "numCitedBy": 75,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Scene-segmentation-using-motion-information-Potter",
            "title": {
                "fragments": [],
                "text": "Scene segmentation using motion information"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16793050"
                        ],
                        "name": "R. Lillestrand",
                        "slug": "R.-Lillestrand",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Lillestrand",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Lillestrand"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 36912778,
            "fieldsOfStudy": [
                "Environmental Science"
            ],
            "id": "37dc6489f3138cbc863b0c79e1c91678aee344e7",
            "isKey": false,
            "numCitedBy": 121,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "The problem of change detection presents itself for imaging systems that view the same scene repeatedly. Current research programs based on the processing of side-looking radar imagery show that spatial alignment of the various parts of the image must be highly accurate if noise in the difference picture is to be reduced to acceptably low levels. Typically, the spatial alignment accuracy must be better than one-fourth of the diameter of the smallest resolvable feature in the imagery, and this often requires several hundred degrees of freedom in the performance of the map warp for images that are of the order of 107picture cells (pixels) in size. Gray scale rectification of conjugate sampling points is less difficult, requiring typically only 10 to 20 percent as many degrees of freedom. Point by point adjustment for differences in mean transparency and contrast is employed. Recently developed equipment provides a continuous pipeline processing capability. With this equipment, each picture element of the second image is transformed with four degrees of freedom (two spatial and two gray scale). The digital correlator is capable of processing 4×105six-bit picture elements per second when used in conjunction with a CDC 1700 computer."
            },
            "slug": "Techniques-ror-Change-Detection-Lillestrand",
            "title": {
                "fragments": [],
                "text": "Techniques ror Change Detection"
            },
            "tldr": {
                "abstractSimilarityScore": 56,
                "text": "Current research programs based on the processing of side-looking radar imagery show that spatial alignment of the various parts of the image must be highly accurate if noise in the difference picture is to be reduced to acceptably low levels."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Computers"
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31857045"
                        ],
                        "name": "E. Hildreth",
                        "slug": "E.-Hildreth",
                        "structuredName": {
                            "firstName": "Ellen",
                            "lastName": "Hildreth",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Hildreth"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2150419,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "9009c9685754346deb93f316144a9da1f70ffcd8",
            "isKey": false,
            "numCitedBy": 7031,
            "numCiting": 62,
            "paperAbstract": {
                "fragments": [],
                "text": "A theory of edge detection is presented. The analysis proceeds in two parts. (1) Intensity changes, which occur in a natural image over a wide range of scales, are detected separately at different scales. An appropriate filter for this purpose at a given scale is found to be the second derivative of a Gaussian, and it is shown that, provided some simple conditions are satisfied, these primary filters need not be orientation-dependent. Thus, intensity changes at a given scale are best detected by finding the zero values of ∇2G(x, y)* I(x, y) for image I, where G(x, y) is a two-dimensional Gaussian distribution and ∇2 is the Laplacian. The intensity changes thus discovered in each of the channels are then represented by oriented primitives called zero-crossing segments, and evidence is given that this representation is complete. (2) Intensity changes in images arise from surface discontinuities or from reflectance or illumination boundaries, and these all have the property that they are spatially localized. Because of this, the zero-crossing segments from the different channels are not independent, and rules are deduced for combining them into a description of the image. This description is called the raw primal sketch. The theory explains several basic psychophysical findings, and the operation of forming oriented zero-crossing segments from the output of centre-surround ∇2G filters acting on the image forms the basis for a physiological model of simple cells (see Marr & Ullman 1979)."
            },
            "slug": "Theory-of-edge-detection-Marr-Hildreth",
            "title": {
                "fragments": [],
                "text": "Theory of edge detection"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The theory of edge detection explains several basic psychophysical findings, and the operation of forming oriented zero-crossing segments from the output of centre-surround ∇2G filters acting on the image forms the basis for a physiological model of simple cells."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152124438"
                        ],
                        "name": "R. Hill",
                        "slug": "R.-Hill",
                        "structuredName": {
                            "firstName": "RICHARD M.",
                            "lastName": "Hill",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Hill"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 42788354,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "8ad778a1206c79b4cab487d0d36bcb739f9c7623",
            "isKey": false,
            "numCitedBy": 400,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "Among the ganglion cells in the rabbit's retina there is a class that responds to movement of a stimulus in one direction, and does not respond to movement in the opposite direction. The same directional selectivity holds over the whole receptive field of one such cell, but the selected direction differs in different cells. The discharge is almost uninfluenced by the intensity of the stimulus spot, and the response occurs for the same direction of movement when a black spot is substituted for a light spot."
            },
            "slug": "Selective-Sensitivity-to-Direction-of-Movement-in-Barlow-Hill",
            "title": {
                "fragments": [],
                "text": "Selective Sensitivity to Direction of Movement in Ganglion Cells of the Rabbit Retina"
            },
            "tldr": {
                "abstractSimilarityScore": 88,
                "text": "Among the ganglion cells in the rabbit's retina there is a class that responds to movement of a stimulus in one direction, and does not respond to movement in the opposite direction, but the selected direction differs in different cells."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1963
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3853990"
                        ],
                        "name": "O. Braddick",
                        "slug": "O.-Braddick",
                        "structuredName": {
                            "firstName": "Oliver",
                            "lastName": "Braddick",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Braddick"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 45641527,
            "fieldsOfStudy": [
                "Psychology",
                "Biology"
            ],
            "id": "65ba56fbfb8d34365a941aff4f2cf554457e9887",
            "isKey": false,
            "numCitedBy": 470,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "When a group of dots within a random-dot array is discontinuously displaced, it appears as a moving region perceptually segregated from its stationary surround. The spastial, temporal and other constraints governing this effect are markedly different from those classically found for the apparent motion of isolated stimulus elements. The random-dot display appears to tap a low-level motion-detecting process, distinct from the more interpretive process elicited by the classical displays. The distinct contributions of these processes can be identified in 'multi-stable' displays which yield alternative percepts of apparent motion depending on which one or both of the processes is activated. Such experiments illustrate the interaction of relatively stimulus-constrained and relatively autonomous processes invisual perception."
            },
            "slug": "Low-level-and-high-level-processes-in-apparent-Braddick",
            "title": {
                "fragments": [],
                "text": "Low-level and high-level processes in apparent motion."
            },
            "tldr": {
                "abstractSimilarityScore": 74,
                "text": "When a group of dots within a random-dot array is discontinuously displaced, it appears as a moving region perceptually segregated from its stationary surround, illustrating the interaction of relatively stimulus-constrained and relatively autonomous processes invisual perception."
            },
            "venue": {
                "fragments": [],
                "text": "Philosophical transactions of the Royal Society of London. Series B, Biological sciences"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3251943"
                        ],
                        "name": "S. Anstis",
                        "slug": "S.-Anstis",
                        "structuredName": {
                            "firstName": "Stuart",
                            "lastName": "Anstis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Anstis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145404707"
                        ],
                        "name": "B. Rogers",
                        "slug": "B.-Rogers",
                        "structuredName": {
                            "firstName": "Brian",
                            "lastName": "Rogers",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Rogers"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18142140,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "ca418d24bfe03b1dc28036d64f7e4d9104d5e38f",
            "isKey": false,
            "numCitedBy": 158,
            "numCiting": 36,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Illusory-reversal-of-visual-depth-and-movement-of-Anstis-Rogers",
            "title": {
                "fragments": [],
                "text": "Illusory reversal of visual depth and movement during changes of contrast"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7136759,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "c5f5311fa1f34159ab3a0a1d58da51cd0340a640",
            "isKey": false,
            "numCitedBy": 6319,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The striate cortex was studied in lightly anaesthetized macaque and spider monkeys by recording extracellularly from single units and stimulating the retinas with spots or patterns of light. Most cells can be categorized as simple, complex, or hypercomplex, with response properties very similar to those previously described in the cat. On the average, however, receptive fields are smaller, and there is a greater sensitivity to changes in stimulus orientation. A small proportion of the cells are colour coded."
            },
            "slug": "Receptive-fields-and-functional-architecture-of-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields and functional architecture of monkey striate cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 82,
                "text": "The striate cortex was studied in lightly anaesthetized macaque and spider monkeys by recording extracellularly from single units and stimulating the retinas with spots or patterns of light, with response properties very similar to those previously described in the cat."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "148336336"
                        ],
                        "name": "W. Chow",
                        "slug": "W.-Chow",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Chow",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Chow"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1705627"
                        ],
                        "name": "J. Aggarwal",
                        "slug": "J.-Aggarwal",
                        "structuredName": {
                            "firstName": "Jake",
                            "lastName": "Aggarwal",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Aggarwal"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 39441975,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b3a2168e356b4d2dc98968ba21cb20aca157191f",
            "isKey": false,
            "numCitedBy": 80,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "The present correspondence develops an algorithm for tracking the motion of planar curvilinear moving objects from a sequence of scenes produced by a television camera. The shape of the objects is unrestricted except that holes may not be present. The shape of the objects may vary slightly from scene to scene. The linear and angular velocities of the objects are computed, and a model is created and updated each time a new scene is processed. Furthermore, the algorithm generates a prediction of each successive input scene. The algorithm is implemented in the computer language Lisp, and experimental results are presented."
            },
            "slug": "Computer-Analysis-of-Planar-Curvilinear-Moving-Chow-Aggarwal",
            "title": {
                "fragments": [],
                "text": "Computer Analysis of Planar Curvilinear Moving Images"
            },
            "tldr": {
                "abstractSimilarityScore": 72,
                "text": "An algorithm for tracking the motion of planar curvilinear moving objects from a sequence of scenes produced by a television camera is developed and a model is created and updated each time a new scene is processed."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Computers"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2736055"
                        ],
                        "name": "J. Limb",
                        "slug": "J.-Limb",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Limb",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Limb"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2149336574"
                        ],
                        "name": "J. Murphy",
                        "slug": "J.-Murphy",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Murphy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Murphy"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 121088548,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "fed5cca467782a36f6db299566fbeac2099c3e75",
            "isKey": false,
            "numCitedBy": 202,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Estimating-the-Velocity-of-Moving-Images-in-Signals-Limb-Murphy",
            "title": {
                "fragments": [],
                "text": "Estimating the Velocity of Moving Images in Television Signals"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144155263"
                        ],
                        "name": "J. T. Petersik",
                        "slug": "J.-T.-Petersik",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Petersik",
                            "middleNames": [
                                "Timothy"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. T. Petersik"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 24865664,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "71ae9d9b7ef8e479fec7f9829ce47258f6b83a9a",
            "isKey": false,
            "numCitedBy": 45,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "In the present two experiments subjects viewed discontinuous, i.e. stroboscopic, simulations of a transparent sphere partially filled with randomly positioned luminous dots and rotating about the y axis in depth. Over a range of stimulus conditions, such simulations elicited coherent sensations of continuous rotation and internal volume of the sphere. By manipulating both spatial and temporal variables in the simulations, it was attempted to define the boundary conditions for which corresponding elements of a simulation are perceptually paired from frame to frame to yield coherent sensations of rotation and depth. The results indicated that the process that matches or pairs corresponding elements in a three-dimensional simulation cannot be identified with the process that matches corresponding elements in similar two-dimensional displays. Furthermore, temporal factors influenced the perception of these simulations more than did spatial factors, and rotation-judgment accuracy and perceived depth were different functions of temporal frequency. Over a range of temporal frequencies, such three-dimensional simulations are apparently processed in a manner similar to that in which objects undergoing real motion are processed."
            },
            "slug": "The-Effects-of-Spatial-and-Temporal-Factors-on-the-Petersik",
            "title": {
                "fragments": [],
                "text": "The Effects of Spatial and Temporal Factors on the Perception of Stroboscopic Rotation Simulations"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "It was attempted to define the boundary conditions for which corresponding elements of a simulation are perceptually paired from frame to frame to yield coherent sensations of rotation and depth, and indicated that the process that matches or pairs corresponding elements in a three-dimensional simulation cannot be identified with theprocess that matches corresponding elements with similar elements in similar two-dimensional displays."
            },
            "venue": {
                "fragments": [],
                "text": "Perception"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143814637"
                        ],
                        "name": "Berthold K. P. Horn",
                        "slug": "Berthold-K.-P.-Horn",
                        "structuredName": {
                            "firstName": "Berthold",
                            "lastName": "Horn",
                            "middleNames": [
                                "K.",
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Berthold K. P. Horn"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1717435"
                        ],
                        "name": "B. G. Schunck",
                        "slug": "B.-G.-Schunck",
                        "structuredName": {
                            "firstName": "Brian",
                            "lastName": "Schunck",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. G. Schunck"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1371968,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "a3229dc33ecb80c59a75b906c46b586dd059b781",
            "isKey": false,
            "numCitedBy": 11343,
            "numCiting": 54,
            "paperAbstract": {
                "fragments": [],
                "text": "Optical flow cannot be computed locally, since only one independent measurement is available from the image sequence at a point, while the flow velocity has two components. A second constraint is needed. A method for finding the optical flow pattern is presented which assumes that the apparent velocity of the brightness pattern varies smoothly almost everywhere in the image. An iterative implementation is shown which successfully computes the optical flow for a number of synthetic image sequences. The algorithm is robust in that it can handle image sequences that are quantized rather coarsely in space and time. It is also insensitive to quantization of brightness levels and additive noise. Examples are included where the assumption of smoothness is violated at singular points or along lines in the image."
            },
            "slug": "Determining-Optical-Flow-Horn-Schunck",
            "title": {
                "fragments": [],
                "text": "Determining Optical Flow"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "An iterative implementation is shown which successfully computes the optical flow for a number of synthetic image sequences and is robust in that it can handle image sequences that are quantified rather coarsely in space and time."
            },
            "venue": {
                "fragments": [],
                "text": "Other Conferences"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40407794"
                        ],
                        "name": "A. Pantle",
                        "slug": "A.-Pantle",
                        "structuredName": {
                            "firstName": "Allan",
                            "lastName": "Pantle",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Pantle"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "113289821"
                        ],
                        "name": "L. Picciano",
                        "slug": "L.-Picciano",
                        "structuredName": {
                            "firstName": "L.",
                            "lastName": "Picciano",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Picciano"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2223754,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "65c053604da39b95268d7bef200ea9a2643de02b",
            "isKey": false,
            "numCitedBy": 204,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "Two competing sensations of apparent movement were produced by the rapid alternation of two multielement stimulus frames. Either sensation could be made dominant by, appropriate manipulations of the stimulus display. The results suggest that there are two systems capable of generating movement signals in man. One system depends on preliminary processing of form, and the second system does not."
            },
            "slug": "A-multistable-movement-display:-evidence-for-two-in-Pantle-Picciano",
            "title": {
                "fragments": [],
                "text": "A multistable movement display: evidence for two separate motion systems in human vision."
            },
            "tldr": {
                "abstractSimilarityScore": 75,
                "text": "Two competing sensations of apparent movement were produced by the rapid alternation of two multielement stimulus frames, suggesting that there are two systems capable of generating movement signals in man."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2070347422"
                        ],
                        "name": "M. D. Riley",
                        "slug": "M.-D.-Riley",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Riley",
                            "middleNames": [
                                "Dennis"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. D. Riley"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 117171977,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "d6141715b707b0fb8ddc01b5514241bedd320e65",
            "isKey": false,
            "numCitedBy": 11,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : This thesis explores how to represent image texture in order to obtain information about the geometry and structure of surfaces, with particular emphasis on locating surface discontinuities. Theoretical and psychophysical results lead to the following conclusions for the representation of image texture: (1) A texture edge primitive is needed to identify texture change contours, which are formed by an abrupt change in the 2-D organization of similar items in an image. The texture edge can be used for locating discontinuities in surface structure and surface geometry and for establishing motion correspondence; (2) Abrupt changes in attributes that vary with changing surface geometry -- orientation, density, length, and width -- should be used to identify discontinuities in surface geometry and surface structure; (3) Texture tokens are needed to separate the effects of different physical processes operating on a surface. They represent the local structure of the image texture. Their spatial variation can be used in the detection of texture discontinuities and texture gradients, and their temporal variation may be used for establishing motion correspondence. What precisely constitutes the texture tokens is unknown; it appears, however, that the intensity changes alone will not suffice, but local groupings of them may; and (4) The above primitives need to be assigned rapidly over a large range in an image. (Author)"
            },
            "slug": "The-Representation-of-Image-Texture-Riley",
            "title": {
                "fragments": [],
                "text": "The Representation of Image Texture"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144938732"
                        ],
                        "name": "R. Jain",
                        "slug": "R.-Jain",
                        "structuredName": {
                            "firstName": "Ramesh",
                            "lastName": "Jain",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Jain"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144721252"
                        ],
                        "name": "H. Nagel",
                        "slug": "H.-Nagel",
                        "structuredName": {
                            "firstName": "Hans-Hellmut",
                            "lastName": "Nagel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Nagel"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 14434285,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "9f19705543966f8192a98ed1dae8ec4da88878d3",
            "isKey": false,
            "numCitedBy": 371,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "The count of events where sample areas from the second and subsequent frames of a TV-image sequence are incompatible with the corresponding sample area of the first frame are accumulated in a first-order difference picture (FODP). Analysis of this FODP provides a separate estimate for images of moving objects and of stationary scene components. We start from the hypothesis that the first frame represents the stationary scene component. Once it has been recognized that a subarea of this initial estimate corresponds to the image of a moving object, the grey values in this subarea are replaced by later estimates of the stationary background at this position. No knowledge specific to a particular scene is utilized in the algorithm. The results for two scene sequences are presented."
            },
            "slug": "On-the-Analysis-of-Accumulative-Difference-Pictures-Jain-Nagel",
            "title": {
                "fragments": [],
                "text": "On the Analysis of Accumulative Difference Pictures from Image Sequences of Real World Scenes"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "Analysis of a first-order difference picture (FODP) provides a separate estimate for images of moving objects and of stationary scene components that represents the stationary scene component in a TV-image sequence."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1794253"
                        ],
                        "name": "S. Zeki",
                        "slug": "S.-Zeki",
                        "structuredName": {
                            "firstName": "Semir",
                            "lastName": "Zeki",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Zeki"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 31631172,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "931bb7585b1b6bcc64dfaaed4785e85a35965b4f",
            "isKey": false,
            "numCitedBy": 1018,
            "numCiting": 42,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Anatomical studies have shown the cortex of the posterior bank of the superior temporal sulcus to receive a projection from visual cortical areas, including areas 17, 18 and 19. In this paper the response of single neurones in this area to simple visual stimulation is reported. Ten monkeys were studied."
            },
            "slug": "Functional-organization-of-a-visual-area-in-the-of-Zeki",
            "title": {
                "fragments": [],
                "text": "Functional organization of a visual area in the posterior bank of the superior temporal sulcus of the rhesus monkey"
            },
            "tldr": {
                "abstractSimilarityScore": 66,
                "text": "The response of single neurones in this area to simple visual stimulation is reported and the cortex of the posterior bank of the superior temporal sulcus to receive a projection from visual cortical areas is shown."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2701850"
                        ],
                        "name": "H. Maturana",
                        "slug": "H.-Maturana",
                        "structuredName": {
                            "firstName": "Humberto",
                            "lastName": "Maturana",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Maturana"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144166210"
                        ],
                        "name": "S. Frenk",
                        "slug": "S.-Frenk",
                        "structuredName": {
                            "firstName": "S.",
                            "lastName": "Frenk",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Frenk"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 27111165,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "1d0ccba7cdb8dd90c0f43dacc77201f02e276591",
            "isKey": false,
            "numCitedBy": 223,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "There are ganglion cells in the pigeon retina that respond selectively, some to any edge moving in a particcular direction only, others to any vertically moving horizontal edge. This selective response to a specific stimulus arises from the selective sensitivity of each neuron to a particular spatiotemporal configuration in its afferent influences, and is independent of specific pathways."
            },
            "slug": "Directional-Movement-and-Horizontal-Edge-Detectors-Maturana-Frenk",
            "title": {
                "fragments": [],
                "text": "Directional Movement and Horizontal Edge Detectors in the Pigeon Retina"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "There are ganglion cells in the pigeon retina that respond selectively, some to any edge moving in a particcular direction only, others to any vertically moving horizontal edge."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1963
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2489024"
                        ],
                        "name": "C. Fennema",
                        "slug": "C.-Fennema",
                        "structuredName": {
                            "firstName": "Claude",
                            "lastName": "Fennema",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Fennema"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144816086"
                        ],
                        "name": "W. Thompson",
                        "slug": "W.-Thompson",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Thompson",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Thompson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 14470003,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "67301c286439a7c24368300ea13e9785bd666aed",
            "isKey": false,
            "numCitedBy": 600,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Velocity-determination-in-scenes-containing-several-Fennema-Thompson",
            "title": {
                "fragments": [],
                "text": "Velocity determination in scenes containing several moving objects"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144523280"
                        ],
                        "name": "J. Roach",
                        "slug": "J.-Roach",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Roach",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Roach"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1705627"
                        ],
                        "name": "J. Aggarwal",
                        "slug": "J.-Aggarwal",
                        "structuredName": {
                            "firstName": "Jake",
                            "lastName": "Aggarwal",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Aggarwal"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 9956564,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "df53b245a558c6758637526de89be0feda28462a",
            "isKey": false,
            "numCitedBy": 119,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "A method is developed to represent movement of convex blocks in three-dimensional space from a sequence of two-dimensional camera images. The goals are to determine the objects' movement toward or away from the camera as well as left/right and up/down movement in the image plane and to build models of the blocks. The movement information is used as part of a hierarchical matching process that determines the correspondence of blocks between scenes."
            },
            "slug": "Computer-Tracking-of-Objects-Moving-in-Space-Roach-Aggarwal",
            "title": {
                "fragments": [],
                "text": "Computer Tracking of Objects Moving in Space"
            },
            "tldr": {
                "abstractSimilarityScore": 95,
                "text": "A method is developed to represent movement of convex blocks in three-dimensional space from a sequence of two-dimensional camera images to determine the objects' movement toward or away from the camera as well as left/right and up/down movement in the image plane."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144155263"
                        ],
                        "name": "J. T. Petersik",
                        "slug": "J.-T.-Petersik",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Petersik",
                            "middleNames": [
                                "Timothy"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. T. Petersik"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "73298280"
                        ],
                        "name": "Kenyon I. Hicks",
                        "slug": "Kenyon-I.-Hicks",
                        "structuredName": {
                            "firstName": "Kenyon",
                            "lastName": "Hicks",
                            "middleNames": [
                                "I."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kenyon I. Hicks"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40407794"
                        ],
                        "name": "A. Pantle",
                        "slug": "A.-Pantle",
                        "structuredName": {
                            "firstName": "Allan",
                            "lastName": "Pantle",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Pantle"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 22311603,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "c680db329a3e3c30a0497acf75b771eb5c4b1680",
            "isKey": false,
            "numCitedBy": 57,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "In the present studies a pair of random-dot frames was constructed so that two areas in the first frame (f1) were correlated with two areas in the second frame (f2). The alternation of the pair of frames (an f1-f2 sequence) gave rise to two subjective figures. When two pairs of random-dot frames (an f1-f2 sequence and an f3-f4 sequence), each of which produced two subjective figures in different locations, were themselves alternated, the subjective figures from the f1-f2 sequence interacted with the subjective figures from the f3-f4 sequence to produce apparent movement. With any one of the four general kinds of displays which we constructed, subjects usually perceived only one of two types of subjective-figure movement. The type of movement that was perceived with a given display depended primarily upon the degree of change (across the interval between an f1-f2 and an f3-f4 sequence) of the internal structure of the successively generated subjective figures. Relative intensity differences between the subjective figures and their backgrounds influenced the type of apparent movement seen, whereas variations in the density of elements in a display did not. We tentatively propose a two-stage model to explain the apparent movement of the subjective figures: the first stage is assumed to generate the subjective figures by means of a cross-correlation of the intensity distributions of the two frames within an f1-f2 sequence and within an f3-f4 sequence; on the basis of inputs from the first stage, the second stage generates apparent movement signals for the subjective figures."
            },
            "slug": "Apparent-Movement-of-Successively-Generated-Figures-Petersik-Hicks",
            "title": {
                "fragments": [],
                "text": "Apparent Movement of Successively Generated Subjective Figures"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "A two-stage model is tentatively proposed to explain the apparent movement of the subjective figures by means of a cross-correlation of the intensity distributions of the two frames within an f1-f2 sequence and within anF3-f4 sequence; on the basis of inputs from the first stage, the second stage generates apparent movement signals for the subjective Figures."
            },
            "venue": {
                "fragments": [],
                "text": "Perception"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1705627"
                        ],
                        "name": "J. Aggarwal",
                        "slug": "J.-Aggarwal",
                        "structuredName": {
                            "firstName": "Jake",
                            "lastName": "Aggarwal",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Aggarwal"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35106875"
                        ],
                        "name": "R. Duda",
                        "slug": "R.-Duda",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Duda",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Duda"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 5390602,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "698488b7d0d7bec7d016ff9da483350dc1a7d834",
            "isKey": false,
            "numCitedBy": 107,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "A general mathematical model is developed as an idealization of the problem of determining cloud motions from satellite pictures. The model consists of superimposed planes of rigid moving polygons. The problem is to determine from a sequence of scenes the linear and angular velocities of the figures, and to decompose the scene into its component figures. Study of the model reveals a number of fundamental relations that form the basis for an analysis program. In particular, a systematic anaylsis is given of the topological changes that can occur when overlapping figures move together or apart. A computer program based on these results is described, and experimental results are presented."
            },
            "slug": "Computer-Analysis-of-Moving-Polygonal-Images-Aggarwal-Duda",
            "title": {
                "fragments": [],
                "text": "Computer Analysis of Moving Polygonal Images"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "A systematic anaylsis is given of the topological changes that can occur when overlapping figures move together or apart and a computer program based on these results is described, and experimental results are presented."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Computers"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1407756324"
                        ],
                        "name": "C. Enroth-Cugell",
                        "slug": "C.-Enroth-Cugell",
                        "structuredName": {
                            "firstName": "Christina",
                            "lastName": "Enroth-Cugell",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Enroth-Cugell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "36155815"
                        ],
                        "name": "J. Robson",
                        "slug": "J.-Robson",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Robson",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Robson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 3052969,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "c6609ae352d9e1c99530136e41798f337496ff27",
            "isKey": false,
            "numCitedBy": 2635,
            "numCiting": 52,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Spatial summation within cat retinal receptive fields was studied by recording from optic‐tract fibres the responses of ganglion cells to grating patterns whose luminance perpendicular to the bars varied sinusoidally about the mean level."
            },
            "slug": "The-contrast-sensitivity-of-retinal-ganglion-cells-Enroth-Cugell-Robson",
            "title": {
                "fragments": [],
                "text": "The contrast sensitivity of retinal ganglion cells of the cat"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Spatial summation within cat retinal receptive fields was studied by recording from optic‐tract fibres the responses of ganglion cells to grating patterns whose luminance perpendicular to the bars varied sinusoidally about the mean level."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1966
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743045"
                        ],
                        "name": "S. Ullman",
                        "slug": "S.-Ullman",
                        "structuredName": {
                            "firstName": "Shimon",
                            "lastName": "Ullman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ullman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 39999567,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "51fb9b72693bd2cbc166a9a8719a097cca2c37c4",
            "isKey": false,
            "numCitedBy": 78,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "The correspondence between line segments in apparent motion is shown to be affected by the similarity between them. Increase in orientation difference or in length ratio between lines in a competing motion configuration decreases the probability of perceived apparent motion between them. The results suggest the existence of a built-in preference metric that may reflect a measure of matching likelihood between elements in three-dimensional space."
            },
            "slug": "The-Effect-of-Similarity-between-Line-Segments-on-Ullman",
            "title": {
                "fragments": [],
                "text": "The Effect of Similarity between Line Segments on the Correspondence Strength in Apparent Motion"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "The correspondence between line segments in apparent motion is shown to be affected by the similarity between them, suggesting the existence of a built-in preference metric that may reflect a measure of matching likelihood between elements in three-dimensional space."
            },
            "venue": {
                "fragments": [],
                "text": "Perception"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144938732"
                        ],
                        "name": "R. Jain",
                        "slug": "R.-Jain",
                        "structuredName": {
                            "firstName": "Ramesh",
                            "lastName": "Jain",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Jain"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "15514429"
                        ],
                        "name": "W. N. Martin",
                        "slug": "W.-N.-Martin",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Martin",
                            "middleNames": [
                                "N"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. N. Martin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1705627"
                        ],
                        "name": "J. Aggarwal",
                        "slug": "J.-Aggarwal",
                        "structuredName": {
                            "firstName": "Jake",
                            "lastName": "Aggarwal",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Aggarwal"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62712928,
            "fieldsOfStudy": [
                "Mathematics",
                "Environmental Science"
            ],
            "id": "a9b37a275e48b2c103c0bfc19db8e07449692587",
            "isKey": false,
            "numCitedBy": 148,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Segmentation-through-the-detection-of-changes-due-Jain-Martin",
            "title": {
                "fragments": [],
                "text": "Segmentation through the detection of changes due to motion"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "70027188"
                        ],
                        "name": "J. Leese",
                        "slug": "J.-Leese",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Leese",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Leese"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32646438"
                        ],
                        "name": "C. Novak",
                        "slug": "C.-Novak",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Novak",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Novak"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144961010"
                        ],
                        "name": "V. R. Taylor",
                        "slug": "V.-R.-Taylor",
                        "structuredName": {
                            "firstName": "V.",
                            "lastName": "Taylor",
                            "middleNames": [
                                "Ray"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. R. Taylor"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 30329732,
            "fieldsOfStudy": [
                "Computer Science",
                "Environmental Science"
            ],
            "id": "ae119c7d6ac50cd084d4e62c424e0ae2affe1fd7",
            "isKey": false,
            "numCitedBy": 103,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-determination-of-cloud-pattern-motions-from-Leese-Novak",
            "title": {
                "fragments": [],
                "text": "The determination of cloud pattern motions from geosynchronous satellite image data"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit."
            },
            "year": 1970
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2914687"
                        ],
                        "name": "P. A. Kolers",
                        "slug": "P.-A.-Kolers",
                        "structuredName": {
                            "firstName": "Paul",
                            "lastName": "Kolers",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. A. Kolers"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 142683404,
            "fieldsOfStudy": [
                "Business"
            ],
            "id": "fc5d199334ecd2e32d847e3ea4e8685a10dced59",
            "isKey": false,
            "numCitedBy": 450,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Aspects-of-motion-perception-Kolers",
            "title": {
                "fragments": [],
                "text": "Aspects of motion perception"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2172545032"
                        ],
                        "name": "V. Torre",
                        "slug": "V.-Torre",
                        "structuredName": {
                            "firstName": "V.",
                            "lastName": "Torre",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Torre"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "123400252"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tim",
                            "lastName": "Poggio",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 85166036,
            "fieldsOfStudy": [
                "Biology",
                "Psychology"
            ],
            "id": "bd2f9fe5a768510043bc4a7b54133baff4915dfc",
            "isKey": false,
            "numCitedBy": 326,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": "A specific synaptic interaction is proposed as the mechanism underlying the directional selectivity to motion of several nervous cells. It is shown that the hypothesis is consistent with previous behavioural and physiological studies of the motion detection process."
            },
            "slug": "A-synaptic-mechanism-possibly-underlying-to-motion-Torre-Poggio",
            "title": {
                "fragments": [],
                "text": "A synaptic mechanism possibly underlying directional selectivity to motion"
            },
            "tldr": {
                "abstractSimilarityScore": 99,
                "text": "A specific synaptic interaction is proposed as the mechanism underlying the directional selectivity to motion of several nervous cells and it is shown that the hypothesis is consistent with previous behavioural and physiological studies of the motion detection process."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46297822"
                        ],
                        "name": "E. Smith",
                        "slug": "E.-Smith",
                        "structuredName": {
                            "firstName": "Eric",
                            "lastName": "Smith",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Smith"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2070423038"
                        ],
                        "name": "Dennis R. Phillips",
                        "slug": "Dennis-R.-Phillips",
                        "structuredName": {
                            "firstName": "Dennis",
                            "lastName": "Phillips",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Dennis R. Phillips"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 206619198,
            "fieldsOfStudy": [
                "Environmental Science"
            ],
            "id": "de8e89291db99de704dc484398df9f980401adc3",
            "isKey": false,
            "numCitedBy": 71,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "The measurement of winds to an accuracy of at least 2 knots (1 m/s) is a major requirement of the global atmospheric research program (GARP) [1]. Such accurate wind measurements will be needed over large regions presently lacking ground or rawinsonde observations. A man-computer system called WINDCO has been developed to measure cloud motion from ATS pictures. This system is capable of providing cloud motion measurements that are repeatable to within 6 knots over two independent time intervals in the majority of cases."
            },
            "slug": "Automated-Cloud-Tracking-Using-Precisely-Aligned-Smith-Phillips",
            "title": {
                "fragments": [],
                "text": "Automated Cloud Tracking Using Precisely Aligned Digital ATS Pictures"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "A man-computer system called WINDCO has been developed to measure cloud motion from ATS pictures, capable of providing cloud motion measurements that are repeatable to within 6 knots over two independent time intervals in the majority of cases."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Computers"
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "104508342"
                        ],
                        "name": "B. Hassenstein",
                        "slug": "B.-Hassenstein",
                        "structuredName": {
                            "firstName": "Bruno",
                            "lastName": "Hassenstein",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Hassenstein"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40393452"
                        ],
                        "name": "W. Reichardt",
                        "slug": "W.-Reichardt",
                        "structuredName": {
                            "firstName": "Werner",
                            "lastName": "Reichardt",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Reichardt"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 98709700,
            "fieldsOfStudy": [
                "Chemistry"
            ],
            "id": "5fb26ee1bcefff42f7083cb5344a5171eaf560d5",
            "isKey": false,
            "numCitedBy": 798,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Der Rüsselkäfer Chlorophanus viridis reagiert wie viele andere Organismen auf Bewegungen in seiner optischen Umwelt mit charakteristischen Verhaltensweisen. Dem liegt eine Auswertung von Relationen zwischen einzelnen Lichtreizen zugrunde. Die Funktionsstruktur dieser Auswertungsleistung wird ermittelt. Das Ergebnis der Analyse ist in Abb. 8 dargestellt."
            },
            "slug": "Systemtheoretische-Analyse-der-Zeit-,-Reihenfolgen-Hassenstein-Reichardt",
            "title": {
                "fragments": [],
                "text": "Systemtheoretische Analyse der Zeit-, Reihenfolgen- und Vorzeichenauswertung bei der Bewegungsperzeption des Rüsselkäfers Chlorophanus"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1956
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "103628832"
                        ],
                        "name": "J. Ternus",
                        "slug": "J.-Ternus",
                        "structuredName": {
                            "firstName": "Josef",
                            "lastName": "Ternus",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Ternus"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 124322467,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "f1534795ae2e94377e0d38ee324810e9ff69b336",
            "isKey": false,
            "numCitedBy": 165,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Experimentelle-Untersuchungen-über-phänomenale-Ternus",
            "title": {
                "fragments": [],
                "text": "Experimentelle Untersuchungen über phänomenale Identität"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1926
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "97443432"
                        ],
                        "name": "R. Hartenburg",
                        "slug": "R.-Hartenburg",
                        "structuredName": {
                            "firstName": "Roger",
                            "lastName": "Hartenburg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Hartenburg"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1958385"
                        ],
                        "name": "J. Denavit",
                        "slug": "J.-Denavit",
                        "structuredName": {
                            "firstName": "Jacques",
                            "lastName": "Denavit",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Denavit"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34860502"
                        ],
                        "name": "F. Freudenstein",
                        "slug": "F.-Freudenstein",
                        "structuredName": {
                            "firstName": "Ferdinand",
                            "lastName": "Freudenstein",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Freudenstein"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 120789473,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4ccaf9d0d86828c1eb2ccb70e928a284af74aa10",
            "isKey": false,
            "numCitedBy": 900,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Kinematic-Synthesis-of-Linkages-Hartenburg-Denavit",
            "title": {
                "fragments": [],
                "text": "Kinematic Synthesis of Linkages"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1965
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152663867"
                        ],
                        "name": "R. M. Hill",
                        "slug": "R.-M.-Hill",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Hill",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. M. Hill"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3672557"
                        ],
                        "name": "W. Levick",
                        "slug": "W.-Levick",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Levick",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Levick"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 40905952,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "b6e2fea2fda15653ad67446d1a8ee91062714f5f",
            "isKey": false,
            "numCitedBy": 814,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Retinal-ganglion-cells-responding-selectively-to-of-Barlow-Hill",
            "title": {
                "fragments": [],
                "text": "Retinal ganglion cells responding selectively to direction and speed of image motion in the rabbit"
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1964
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2743894"
                        ],
                        "name": "J. Malpeli",
                        "slug": "J.-Malpeli",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Malpeli",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Malpeli"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1993085645"
                        ],
                        "name": "P. Schiller",
                        "slug": "P.-Schiller",
                        "structuredName": {
                            "firstName": "P",
                            "lastName": "Schiller",
                            "middleNames": [
                                "H"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Schiller"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1890313"
                        ],
                        "name": "C. Colby",
                        "slug": "C.-Colby",
                        "structuredName": {
                            "firstName": "Carol",
                            "lastName": "Colby",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Colby"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 32086495,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "655a1cb739d6f7d52cf525606253880e9d3ba13e",
            "isKey": false,
            "numCitedBy": 129,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Response-properties-of-single-cells-in-monkey-of-Malpeli-Schiller",
            "title": {
                "fragments": [],
                "text": "Response properties of single cells in monkey striate cortex during reversible inactivation of individual lateral geniculate laminae."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33873097"
                        ],
                        "name": "M. Sanders",
                        "slug": "M.-Sanders",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Sanders",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Sanders"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 71908269,
            "fieldsOfStudy": [
                "Medicine"
            ],
            "id": "cc5c86cf7ea41efa31afba93b67602c0d4982baf",
            "isKey": false,
            "numCitedBy": 6831,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Handbook-of-Sensory-Physiology-Sanders",
            "title": {
                "fragments": [],
                "text": "Handbook of Sensory Physiology"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 56,
        "totalPages": 6
    },
    "page_url": "https://www.semanticscholar.org/paper/Measurement-of-Visual-Motion-Hildreth/c416a885cc36515740ef8dfa9220366fa2a379f8?sort=total-citations"
}