{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2888197"
                        ],
                        "name": "Sean M. Culhane",
                        "slug": "Sean-M.-Culhane",
                        "structuredName": {
                            "firstName": "Sean",
                            "lastName": "Culhane",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Sean M. Culhane"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1727853"
                        ],
                        "name": "John K. Tsotsos",
                        "slug": "John-K.-Tsotsos",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Tsotsos",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "John K. Tsotsos"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 62055836,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "699b3b27084f9af0993589a862f056fdcee81a8f",
            "isKey": false,
            "numCitedBy": 25,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "Mounting evidence suggests that attentional mechanisms may be required to successfully perform many vision tasks. The paper presents an attentional prototype for early visual processing. The model is composed of a processing hierarchy and an attention beam that traverses the hierarchy, passing through the regions of greatest interest and inhibiting the regions that are not relevant. The type of input to the prototype is not limited to visual stimuli. Aspects of attention such as localizing spatial regions of interest and ordering their importance are addressed; other aspects of attention such as the role of task guidance are encompassed by the model but are not detailed here. Simulations using high-resolution digitized images were conducted, with oriented edge information as the input to the model. The results confirm that this prototype is both robust and fast, and promises to be essential to any real-time vision system.<<ETX>>"
            },
            "slug": "A-prototype-for-data-driven-visual-attention-Culhane-Tsotsos",
            "title": {
                "fragments": [],
                "text": "A prototype for data-driven visual attention"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "An attentional prototype for early visual processing is presented, composed of a processing hierarchy and an attention beam that traverses the hierarchy, passing through the regions of greatest interest and inhibiting the regions that are not relevant."
            },
            "venue": {
                "fragments": [],
                "text": "[1992] Proceedings. 11th IAPR International Conference on Pattern Recognition"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2888197"
                        ],
                        "name": "Sean M. Culhane",
                        "slug": "Sean-M.-Culhane",
                        "structuredName": {
                            "firstName": "Sean",
                            "lastName": "Culhane",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Sean M. Culhane"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1727853"
                        ],
                        "name": "John K. Tsotsos",
                        "slug": "John-K.-Tsotsos",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Tsotsos",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "John K. Tsotsos"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7916775,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1b4fc2407e8bd5598bde7e4da48c3818829bda7a",
            "isKey": false,
            "numCitedBy": 85,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "Researchers have long argued that an attentional mechanism is required to perform many vision tasks. This paper introduces an attentional prototype for early visual processing. Our model is composed of a processing hierarchy and an attention beam that traverses the hierarchy, passing through the regions of greatest interest and inhibiting the regions that are not relevant. The type of input to the prototype is not limited to visual stimuli. Simulations using high-resolution digitized images were conducted, with image intensity and edge information as inputs to the model. The results confirm that this prototype is both robust and fast, and promises to be essential to any real-time vision system."
            },
            "slug": "An-Attentional-Prototype-for-Early-Vision-Culhane-Tsotsos",
            "title": {
                "fragments": [],
                "text": "An Attentional Prototype for Early Vision"
            },
            "tldr": {
                "abstractSimilarityScore": 49,
                "text": "An attentional prototype for early visual processing is introduced, composed of a processing hierarchy and an attention beam that traverses the hierarchy, passing through the regions of greatest interest and inhibiting the regions that are not relevant."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145624227"
                        ],
                        "name": "C. Koch",
                        "slug": "C.-Koch",
                        "structuredName": {
                            "firstName": "Christof",
                            "lastName": "Koch",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Koch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743045"
                        ],
                        "name": "S. Ullman",
                        "slug": "S.-Ullman",
                        "structuredName": {
                            "firstName": "Shimon",
                            "lastName": "Ullman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ullman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 45203429,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "0ce672e6ef09e9ab4c43f1eb75443dc7a5cb38c6",
            "isKey": false,
            "numCitedBy": 3957,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "Psychophysical and physiological evidence indicates that the visual system of primates and humans has evolved a specialized processing focus moving across the visual scene. This study addresses the question of how simple networks of neuron-like elements can account for a variety of phenomena associated with this shift of selective visual attention. Specifically, we propose the following: (1) A number of elementary features, such as color, orientation, direction of movement, disparity etc. are represented in parallel in different topographical maps, called the early representation. (2) There exists a selective mapping from the early topographic representation into a more central non-topographic representation, such that at any instant the central representation contains the properties of only a single location in the visual scene, the selected location. We suggest that this mapping is the principal expression of early selective visual attention. One function of selective attention is to fuse information from different maps into one coherent whole. (3) Certain selection rules determine which locations will be mapped into the central representation. The major rule, using the conspicuity of locations in the early representation, is implemented using a so-called Winner-Take-All network. Inhibiting the selected location in this network causes an automatic shift towards the next most conspicious location. Additional rules are proximity and similarity preferences. We discuss how these rules can be implemented in neuron-like networks and suggest a possible role for the extensive back-projection from the visual cortex to the LGN."
            },
            "slug": "Shifts-in-selective-visual-attention:-towards-the-Koch-Ullman",
            "title": {
                "fragments": [],
                "text": "Shifts in selective visual attention: towards the underlying neural circuitry."
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "This study addresses the question of how simple networks of neuron-like elements can account for a variety of phenomena associated with this shift of selective visual attention and suggests a possible role for the extensive back-projection from the visual cortex to the LGN."
            },
            "venue": {
                "fragments": [],
                "text": "Human neurobiology"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1811494"
                        ],
                        "name": "L. Chelazzi",
                        "slug": "L.-Chelazzi",
                        "structuredName": {
                            "firstName": "Leonardo",
                            "lastName": "Chelazzi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Chelazzi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2171934932"
                        ],
                        "name": "E. Miller",
                        "slug": "E.-Miller",
                        "structuredName": {
                            "firstName": "Earl",
                            "lastName": "Miller",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Miller"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145822452"
                        ],
                        "name": "J. Duncan",
                        "slug": "J.-Duncan",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Duncan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Duncan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144375727"
                        ],
                        "name": "R. Desimone",
                        "slug": "R.-Desimone",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Desimone",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Desimone"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 4319747,
            "fieldsOfStudy": [
                "Biology",
                "Psychology"
            ],
            "id": "86876c68d05af50330d07ee10790ddcf6578c7d9",
            "isKey": false,
            "numCitedBy": 1104,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "WE often search for a face in a crowd or for a particular object in a cluttered environment. In this type of visual search, memory interacts with attention: the mediating neural mechanisms should include a stored representation of the object and a means for selecting that object from among others in the scene1–4. Here we test whether neurons in inferior temporal cortex, an area known to be important for high-level visual processing, might provide these components. Monkeys were presented with a complex picture (the cue) to hold in memory during a delay period. The cue initiated activity that persisted through the delay among the neurons that were tuned to its features. The monkeys were then given 2–5 choice pictures and were required to make an eye movement to the one (the target) that matched the cue. About 90–120 milliseconds before the onset of the eye movement to the target, responses to non-targets were suppressed and the neuronal response was dominated by the target. The results suggest that inferior temporal cortex is involved in selecting the objects to which we attend and foveate."
            },
            "slug": "A-neural-basis-for-visual-search-in-inferior-cortex-Chelazzi-Miller",
            "title": {
                "fragments": [],
                "text": "A neural basis for visual search in inferior temporal cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "The results suggest that inferior temporal cortex is involved in selecting the objects to which the authors attend and foveate, and this area is known to be important for high-level visual processing."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2302358"
                        ],
                        "name": "P. Burt",
                        "slug": "P.-Burt",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Burt",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Burt"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 44513579,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "a2025f9af66afc24cd8c4e5dfc55d7706e7579e0",
            "isKey": false,
            "numCitedBy": 128,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Three elements of attention in computer vision are described. These are related to familiar aspects of eye movement control in human vision: foveation, to examine selected regions of the visual world at high resolution; tracking, to stabilize the images of moving objects within the eye; and high-level interpretation, to anticipate where salient information will occur in a scene. Attention mechanisms allow the system to function in a data-rich world by directing system sensing and analysis resources to only that information critical to the system's current visual task. It is concluded that attention therefore includes mechanisms for directing the allocation of processing and mechanisms for rapidly interpreting the information as it is gathered.<<ETX>>"
            },
            "slug": "Attention-mechanisms-for-vision-in-a-dynamic-world-Burt",
            "title": {
                "fragments": [],
                "text": "Attention mechanisms for vision in a dynamic world"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "It is concluded that attention includes mechanisms for directing the allocation of processing and mechanisms for rapidly interpreting the information as it is gathered."
            },
            "venue": {
                "fragments": [],
                "text": "[1988 Proceedings] 9th International Conference on Pattern Recognition"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "80317385"
                        ],
                        "name": "B. Olshausen",
                        "slug": "B.-Olshausen",
                        "structuredName": {
                            "firstName": "Barbara",
                            "lastName": "Olshausen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Olshausen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143718183"
                        ],
                        "name": "C. Anderson",
                        "slug": "C.-Anderson",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Anderson",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Anderson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1392063491"
                        ],
                        "name": "D. van Essen",
                        "slug": "D.-van-Essen",
                        "structuredName": {
                            "firstName": "D. C.",
                            "lastName": "van Essen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. van Essen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1118263,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "700bbcd3518ca8cb3dac50a89fc69cad3dc1a579",
            "isKey": false,
            "numCitedBy": 948,
            "numCiting": 146,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a biologically plausible model of an attentional mechanism for forming position- and scale-invariant representations of objects in the visual world. The model relies on a set of control neurons to dynamically modify the synaptic strengths of intracortical connections so that information from a windowed region of primary visual cortex (V1) is selectively routed to higher cortical areas. Local spatial relationships (i.e., topography) within the attentional window are preserved as information is routed through the cortex. This enables attended objects to be represented in higher cortical areas within an object-centered reference frame that is position and scale invariant. We hypothesize that the pulvinar may provide the control signals for routing information through the cortex. The dynamics of the control neurons are governed by simple differential equations that could be realized by neurobiologically plausible circuits. In preattentive mode, the control neurons receive their input from a low-level “saliency map” representing potentially interesting regions of a scene. During the pattern recognition phase, control neurons are driven by the interaction between top-down (memory) and bottom-up (retinal input) sources. The model respects key neurophysiological, neuroanatomical, and psychophysical data relating to attention, and it makes a variety of experimentally testable predictions."
            },
            "slug": "A-neurobiological-model-of-visual-attention-and-on-Olshausen-Anderson",
            "title": {
                "fragments": [],
                "text": "A neurobiological model of visual attention and invariant pattern recognition based on dynamic routing of information"
            },
            "tldr": {
                "abstractSimilarityScore": 69,
                "text": "A biologically plausible model of an attentional mechanism for forming position- and scale-invariant representations of objects in the visual world that respects key neurophysiological, neuroanatomical, and psychophysical data relating to attention, and it makes a variety of experimentally testable predictions."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of neuroscience : the official journal of the Society for Neuroscience"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2002388"
                        ],
                        "name": "P. A. Sandon",
                        "slug": "P.-A.-Sandon",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Sandon",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. A. Sandon"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 24024046,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "19902727236070f5880a29b12aa717bb86d7e3ce",
            "isKey": false,
            "numCitedBy": 75,
            "numCiting": 70,
            "paperAbstract": {
                "fragments": [],
                "text": "Selective visual attention serializes the processing of stimulus data to make efficient use of limited processing resources in the human visual system. This paper describes a connectionist network that exhibits a variety of attentional phenomena reported by Treisman, Wolford, Duncan, and others. As demonstrated in several simulations, a hierarchical, multiscale network that uses feature arrays with strong lateral inhibitory connections provides responses in agreement with a number of prominent behaviors associated with visual attention. The overall network design is consistent with a range of data reported in the psychological literature, and with neurophysiol-ogical characteristics of primate vision."
            },
            "slug": "Simulating-Visual-Attention-Sandon",
            "title": {
                "fragments": [],
                "text": "Simulating Visual Attention"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "A connectionist network that exhibits a variety of attentional phenomena reported by Treisman, Wolford, Duncan, and others is described, which is consistent with a range of data reported in the psychological literature, and with neurophysiological characteristics of primate vision."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of Cognitive Neuroscience"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1727853"
                        ],
                        "name": "John K. Tsotsos",
                        "slug": "John-K.-Tsotsos",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Tsotsos",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "John K. Tsotsos"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 144964393,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3b1b12e4510e5dab24c270502b7dad25295ce61e",
            "isKey": false,
            "numCitedBy": 685,
            "numCiting": 132,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract The general problem of visual search can be shown to be computationally intractable in a formal, complexity-theoretic sense, yet visual search is extensively involved in everyday perception, and biological systems manage to perform it remarkably well. Complexity level analysis may resolve this contradiction. Visual search can be reshaped into tractability through approximations and by optimizing the resources devoted to visual processing. Architectural constraints can be derived using the minimum cost principle to rule out a large class of potential solutions. The evidence speaks strongly against bottom-up approaches to vision. In particular, the constraints suggest an attentional mechanism that exploits knowledge of the specific problem being solved. This analysis of visual search performance in terms of attentional influences on visual information processing and complexity satisfaction allows a large body of neurophysiological and psychological evidence to be tied together."
            },
            "slug": "Analyzing-vision-at-the-complexity-level-Tsotsos",
            "title": {
                "fragments": [],
                "text": "Analyzing vision at the complexity level"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "This analysis of visual search performance in terms of attentional influences on visual information processing and complexity satisfaction allows a large body of neurophysiological and psychological evidence to be tied together."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143718183"
                        ],
                        "name": "C. Anderson",
                        "slug": "C.-Anderson",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Anderson",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Anderson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1392063491"
                        ],
                        "name": "D. van Essen",
                        "slug": "D.-van-Essen",
                        "structuredName": {
                            "firstName": "D. C.",
                            "lastName": "van Essen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. van Essen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 36,
                                "start": 26
                            }
                        ],
                        "text": "I ArtiJicial Intelligence 78 (1995) 507-545 537"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 36,
                                "start": 26
                            }
                        ],
                        "text": "I Artificial Intelligence 78 (1995) 507-545 513"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 36,
                                "start": 26
                            }
                        ],
                        "text": "I Artificial Intelligence 78 (1995) 507-545 535"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 36,
                                "start": 26
                            }
                        ],
                        "text": "/ Artificial Intelligence 78 (1995) 507-545 533"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 36,
                                "start": 26
                            }
                        ],
                        "text": "I Artificial Intelligence 78 (1995) 507-545 531"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 36,
                                "start": 26
                            }
                        ],
                        "text": "I Artificial Intelligence 78 (1995) 507-545 539"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 36,
                                "start": 26
                            }
                        ],
                        "text": "I Artificial Intelligence 78 (1995) 507-545 543"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 36,
                                "start": 26
                            }
                        ],
                        "text": "I Artijicial Intelligence 78 (1995) 507-545 523"
                    },
                    "intents": []
                }
            ],
            "corpusId": 2060849,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "002f856353651501d6971843162f2e9403cc20df",
            "isKey": true,
            "numCitedBy": 325,
            "numCiting": 27,
            "paperAbstract": {
                "fragments": [],
                "text": "We propose a general strategy for dynamic control of information flow between arrays of neurons at different levels of the visual pathway, starting in the lateral geniculate nucleus and the geniculorecipient layers of cortical area V1. This strategy can be used for resolving computational problems arising in the domains of stereopsis, directed visual attention, and the perception of moving images. In each of these situations, some means of dynamically controlling how retinal outputs map onto higher-level targets is desirable--in order to achieve binocular fusion, to allow shifts of the focus of attention, and to prevent blurring of moving images. The proposed solution involves what we term \"shifter circuits,\" which allow for dynamic shifts in the relative alignment of input and output arrays without loss of local spatial relationships. The shifts are produced in increments along a succession of relay stages that are linked by diverging excitatory inputs. The direction of shift is controlled at each stage by inhibitory neurons that selectively suppress appropriate sets of ascending inputs. The shifter hypothesis is consistent with available anatomical and physiological evidence on the organization of the primate visual pathway, and it offers a sensible explanation for a variety of otherwise puzzling facts, such as the plethora of cells in the geniculorecipient layers of V1."
            },
            "slug": "Shifter-circuits:-a-computational-strategy-for-of-Anderson-Essen",
            "title": {
                "fragments": [],
                "text": "Shifter circuits: a computational strategy for dynamic aspects of visual processing."
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The shifter hypothesis is consistent with available anatomical and physiological evidence on the organization of the primate visual pathway, and it offers a sensible explanation for a variety of otherwise puzzling facts, such as the plethora of cells in the geniculorecipient layers of V1."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the National Academy of Sciences of the United States of America"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1392063491"
                        ],
                        "name": "D. van Essen",
                        "slug": "D.-van-Essen",
                        "structuredName": {
                            "firstName": "D. C.",
                            "lastName": "van Essen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. van Essen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143718183"
                        ],
                        "name": "C. Anderson",
                        "slug": "C.-Anderson",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Anderson",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Anderson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2605935"
                        ],
                        "name": "D. Felleman",
                        "slug": "D.-Felleman",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Felleman",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Felleman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 11534950,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d89c65bdd7ea6c431cdf7170e4ba7a976ba6a73b",
            "isKey": false,
            "numCitedBy": 1146,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "The primate visual system contains dozens of distinct areas in the cerebral cortex and several major subcortical structures. These subdivisions are extensively interconnected in a distributed hierarchical network that contains several intertwined processing streams. A number of strategies are used for efficient information processing within this hierarchy. These include linear and nonlinear filtering, passage through information bottlenecks, and coordinated use of multiple types of information. In addition, dynamic regulation of information flow within and between visual areas may provide the computational flexibility needed for the visual system to perform a broad spectrum of tasks accurately and at high resolution."
            },
            "slug": "Information-processing-in-the-primate-visual-an-Essen-Anderson",
            "title": {
                "fragments": [],
                "text": "Information processing in the primate visual system: an integrated systems perspective."
            },
            "tldr": {
                "abstractSimilarityScore": 93,
                "text": "The primate visual system contains dozens of distinct areas in the cerebral cortex and several major subcortical structures that are extensively interconnected in a distributed hierarchical network that contains several intertwined processing streams."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153764687"
                        ],
                        "name": "J. Moran",
                        "slug": "J.-Moran",
                        "structuredName": {
                            "firstName": "Jeffrey",
                            "lastName": "Moran",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Moran"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144375727"
                        ],
                        "name": "R. Desimone",
                        "slug": "R.-Desimone",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Desimone",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Desimone"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14122928,
            "fieldsOfStudy": [
                "Biology",
                "Psychology"
            ],
            "id": "fe1f6a674cd1b7bb612b145bbb62eed61fbc9833",
            "isKey": false,
            "numCitedBy": 2706,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "Single cells were recorded in the visual cortex of monkeys trained to attend to stimuli at one location in the visual field and ignore stimuli at another. When both locations were within the receptive field of a cell in prestriate area V4 or the inferior temporal cortex, the response to the unattended stimulus was dramatically reduced. Cells in the striate cortex were unaffected by attention. The filtering of irrelevant information from the receptive fields of extrastriate neurons may underlie the ability to identify and remember the properties of a particular object out of the many that may be represented on the retina."
            },
            "slug": "Selective-attention-gates-visual-processing-in-the-Moran-Desimone",
            "title": {
                "fragments": [],
                "text": "Selective attention gates visual processing in the extrastriate cortex."
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The filtering of irrelevant information from the receptive fields of extrastriate neurons may underlie the ability to identify and remember the properties of a particular object out of the many that may be represented on the retina."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2880368"
                        ],
                        "name": "D. V. Essen",
                        "slug": "D.-V.-Essen",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Essen",
                            "middleNames": [
                                "C.",
                                "Van"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. V. Essen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2605935"
                        ],
                        "name": "D. Felleman",
                        "slug": "D.-Felleman",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Felleman",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Felleman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3177102"
                        ],
                        "name": "E. DeYoe",
                        "slug": "E.-DeYoe",
                        "structuredName": {
                            "firstName": "Edgar",
                            "lastName": "DeYoe",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. DeYoe"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2972274"
                        ],
                        "name": "J. Knierim",
                        "slug": "J.-Knierim",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Knierim",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Knierim"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 82955164,
            "fieldsOfStudy": [
                "Biology",
                "Psychology"
            ],
            "id": "230e93bf17eac4a0894e1a82afd7819bf80e66f2",
            "isKey": false,
            "numCitedBy": 22,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "Most primates are highly visual creatures, capable of a wide variety of difficult tasks that must be carried out in a complex visual environment. It is therefore hardly surprising that a very large expanse of cerebral cortex is devoted to analyzing and interpreting the relatively raw messages transmitted from the retina. Over the past three decades, much progress has been made in elucidating the organization and function of visual cortex. In this chapter we briefly review recent progress in understanding several aspects of visual processing in the macaque monkey, as revealed by both anatomical and physiological studies. The first topic concerns the nature of information flow through the visual cortex as revealed by analysis of the numerous pathways that interconnect different visual areas. The guiding hypothesis is that the cortex is arranged as a distributed hierarchical system, in which there are many distinct levels of analysis. The second topic concerns parallel processing streams and their relationship to the M and P pathways established within the retina. The third topic deals with the functional significance of the feedback pathways that form a prominent characteristic of the cortical hierarchy. The function of feedback pathways in sensory processing has been an intriguing but elusive issue. There are probably many such functions, and here we emphasize their possible role in modulating neural responses according to the broader context of the visual environment."
            },
            "slug": "Probing-the-Primate-Visual-Cortex:-Pathways-and-Essen-Felleman",
            "title": {
                "fragments": [],
                "text": "Probing the Primate Visual Cortex: Pathways and Perspectives"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "This chapter reviews recent progress in understanding several aspects of visual processing in the macaque monkey, as revealed by both anatomical and physiological studies, and focuses on the function of feedback pathways in sensory processing."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723344"
                        ],
                        "name": "M. Corbetta",
                        "slug": "M.-Corbetta",
                        "structuredName": {
                            "firstName": "Maurizio",
                            "lastName": "Corbetta",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Corbetta"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38249791"
                        ],
                        "name": "F. Miezin",
                        "slug": "F.-Miezin",
                        "structuredName": {
                            "firstName": "Francis",
                            "lastName": "Miezin",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Miezin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39269549"
                        ],
                        "name": "G. Shulman",
                        "slug": "G.-Shulman",
                        "structuredName": {
                            "firstName": "Gordon",
                            "lastName": "Shulman",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Shulman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1878109"
                        ],
                        "name": "S. Petersen",
                        "slug": "S.-Petersen",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Petersen",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Petersen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 33578223,
            "fieldsOfStudy": [
                "Psychology",
                "Biology"
            ],
            "id": "b04575fae27be5e719fd4f22e175a1780a9350d0",
            "isKey": false,
            "numCitedBy": 59,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "Positron emission tomography (PET) was used to identify regions of the human visual system which were selectively modulated by attention during feature discrimination and recognition tasks. In a first experiment, subjects were cued to the shape, colour or speed of visual stimulus arrays during a same-different match-to-sample paradigm. The psychophysical sensitivity for discriminating subtle attribute variations was enhanced by selective attention. Correspondingly, the neural activity (as measured by blood flow changes) in different visual associative regions was enhanced when subjects attended to different attributes of the same stimulus (intraparietal sulcus for speed; collateral sulcus and dorsolateral occipital cortex for colour; collateral sulcus, fusiform and parahippocampal gyri, superior temporal sulcus for shape). These regions appeared to be specialized for processing the selected attribute. Attention to a visual feature, therefore, enhances the psychophysical sensitivity as well as the neural activity of specialized processing regions of the human visual system. In a second experiment the effect of target probability (which biases attentional selection) was studied during visual search tasks involving the recognition of a single-feature (i.e. colour) or a feature-conjunction (i.e. colour x orientation) target. Target probability positively modulated neural activity of extrastriate visual regions, which were related to the single-feature or feature-conjunction processing level. These results suggest that selective attention can influence different processing levels in the visual system, possibly reflecting a facilitatory effect on different visual computations or task components."
            },
            "slug": "Selective-attention-modulates-extrastriate-visual-Corbetta-Miezin",
            "title": {
                "fragments": [],
                "text": "Selective attention modulates extrastriate visual regions in humans during visual feature discrimination and recognition."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The results suggest that selective attention can influence different processing levels in the visual system, possibly reflecting a facilitatory effect on different visual computations or task components."
            },
            "venue": {
                "fragments": [],
                "text": "Ciba Foundation symposium"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2157875742"
                        ],
                        "name": "K. Tanaka",
                        "slug": "K.-Tanaka",
                        "structuredName": {
                            "firstName": "K.",
                            "lastName": "Tanaka",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Tanaka"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "89655629"
                        ],
                        "name": "H. Saito",
                        "slug": "H.-Saito",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Saito",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Saito"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46562774"
                        ],
                        "name": "Y. Fukada",
                        "slug": "Y.-Fukada",
                        "structuredName": {
                            "firstName": "Yoshiro",
                            "lastName": "Fukada",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Fukada"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "87505550"
                        ],
                        "name": "M. Moriya",
                        "slug": "M.-Moriya",
                        "structuredName": {
                            "firstName": "Madoka",
                            "lastName": "Moriya",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Moriya"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14964555,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "5f257b61f63468af774cc833cc6982768c315b37",
            "isKey": false,
            "numCitedBy": 814,
            "numCiting": 46,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The inferotemporal cortex (IT) has been thought to play an essential and specific role in visual object discrimination and recognition, because a lesion of IT in the monkey results in a specific deficit in learning tasks that require these visual functions. To understand the cellular basis of the object discrimination and recognition processes in IT, we determined the optimal stimulus of individual IT cells in anesthetized, immobilized monkeys. 2. In the posterior one-third or one-fourth of IT, most cells could be activated maximally by bars or disks just by adjusting the size, orientation, or color of the stimulus. 3. In the remaining anterior two-thirds or three-quarters of IT, most cells required more complex features for their maximal activation. 4. The critical feature for the activation of individual anterior IT cells varied from cell to cell: a complex shape in some cells and a combination of texture or color with contour-shape in other cells. 5. Cells that showed different types of complexity for the critical feature were intermingled throughout anterior IT, whereas cells recorded in single penetrations showed critical features that were related in some respects. 6. Generally speaking, the critical features of anterior IT cells were moderately complex and can be thought of as partial features common to images of several different natural objects. The selectivity to the optimal stimulus was rather sharp, although not absolute. We thus propose that, in anterior IT, images of objects are coded by combinations of active cells, each of which represents the presence of a particular partial feature in the image."
            },
            "slug": "Coding-visual-images-of-objects-in-the-cortex-of-Tanaka-Saito",
            "title": {
                "fragments": [],
                "text": "Coding visual images of objects in the inferotemporal cortex of the macaque monkey."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is proposed that, in anterior IT, images of objects are coded by combinations of active cells, each of which represents the presence of a particular partial feature in the image."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "97586731"
                        ],
                        "name": "B. C. Motter",
                        "slug": "B.-C.-Motter",
                        "structuredName": {
                            "firstName": "Brad",
                            "lastName": "Motter",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. C. Motter"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10154890,
            "fieldsOfStudy": [
                "Biology",
                "Psychology"
            ],
            "id": "79fe558ea9e13f4bdbbd1c8ddef8e863c0839d80",
            "isKey": false,
            "numCitedBy": 1059,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The activity of single neurons was recorded in Macaca mulatta monkeys while they performed tasks requiring them to select a cued stimulus from an array of three to eight stimuli and report the orientation of that stimulus. Stimuli were presented in a circular array centered on the fixation target and scaled to place a single stimulus element within the receptive field of the neuron under study. The timing of the cuing event permitted the directing of visual attention to the spatial location of the correct stimulus before its presentation. 2. The effects of focal attention were examined in cortical visual areas V1, V2, and V4, where a total of 672 neurons were isolated with complete studies obtained for 94 V1, 74 V2, and 74 V4 neurons with receptive-field center eccentricities in the range 1.8-8 degrees. Under certain conditions, directed focal attention results in changes in the response of V1, V2, and V4 neurons to otherwise identical stimuli at spatially specific locations. 3. More than one-third of the neurons in each area displayed differential sensitivity when attention was directed toward versus away from the spatial location of the receptive field just before and during stimulus presentation. Both relative increases and decreases in neural activity were observed in association with attention directed at receptive-field stimuli. 4. The presence of multiple competing stimuli in the visual field was a major factor determining the presence or absence of differential sensitivity. About two-thirds of the neurons that were differentially sensitive to the attending condition in the presence of competing stimuli were not differentially sensitive when single stimuli were presented in control studies. For V1 and V2 neurons the presence of only a few (3-4) competing stimuli was sufficient for a majority of the neurons studied; a majority of the V4 neurons required six to eight stimuli in the array before significant differences between attending conditions occurred. 5. For V1 and V2 neurons the neuronal sensitivity differences between attending conditions were observed primarily at or near the peak of the orientation tuning sensitivity for each neuron; the differences were evident over a broader range of orientations in V4 neurons. 6. In conclusion, neural correlates of focal attentive processes can be observed in visual cortical processing in areas V1 and V2 as well as area V4 under conditions that require stimulus feature analysis and selective spatial processing within a field of competing stimuli.(ABSTRACT TRUNCATED AT 400 WORDS)"
            },
            "slug": "Focal-attention-produces-spatially-selective-in-V1,-Motter",
            "title": {
                "fragments": [],
                "text": "Focal attention produces spatially selective processing in visual cortical areas V1, V2, and V4 in the presence of competing stimuli."
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "Neural correlates of focal attentive processes can be observed in visual cortical processing in areas V1 and V2 as well as area V4 under conditions that require stimulus feature analysis and selective spatial processing within a field of competing stimuli."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3271571"
                        ],
                        "name": "E. Niebur",
                        "slug": "E.-Niebur",
                        "structuredName": {
                            "firstName": "Ernst",
                            "lastName": "Niebur",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Niebur"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145624227"
                        ],
                        "name": "C. Koch",
                        "slug": "C.-Koch",
                        "structuredName": {
                            "firstName": "Christof",
                            "lastName": "Koch",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Koch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2064126738"
                        ],
                        "name": "Christophe Rosin",
                        "slug": "Christophe-Rosin",
                        "structuredName": {
                            "firstName": "Christophe",
                            "lastName": "Rosin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Christophe Rosin"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 103242,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "4d70c7eedf85a5e793c2ec9385f4e95088c04920",
            "isKey": false,
            "numCitedBy": 196,
            "numCiting": 53,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "An-oscillation-based-model-for-the-neuronal-basis-Niebur-Koch",
            "title": {
                "fragments": [],
                "text": "An oscillation-based model for the neuronal basis of attention"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2676061"
                        ],
                        "name": "W. Y. Wai",
                        "slug": "W.-Y.-Wai",
                        "structuredName": {
                            "firstName": "Winky",
                            "lastName": "Wai",
                            "middleNames": [
                                "Yan",
                                "Kei"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Y. Wai"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1727853"
                        ],
                        "name": "John K. Tsotsos",
                        "slug": "John-K.-Tsotsos",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Tsotsos",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "John K. Tsotsos"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1092927,
            "fieldsOfStudy": [
                "Business"
            ],
            "id": "86055fb9f82bf8a11097fd052bdebcca53a515b7",
            "isKey": false,
            "numCitedBy": 17,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper proposes a model that investigates a new avenue for attention control based on dynamic scenes. We have derived a computational model to detect abrupt changes and have examined how the most prominent change can be determined. With such a model, we explore the possibility of an attentional mechanism, in part guided by abrupt changes, for gaze control. The computational model is derived from the difference of Gaussian (DOG) model and it examines the change in the response of the DOG operator over time to determine if changes have occurred. On and off-DOG operators are used to detect \"on\" and \"off\" events respectively. The response of these operators is examined over various temporal window sizes so that changes at different rates can be found. The most salient \"on\" and \"off\" events are determined from the corresponding winner-take-all (WTA) network. The model has been tested with image sequences which have changes caused by brightness or motion and the results are satisfactory."
            },
            "slug": "Directing-attention-to-onset-and-offset-of-image-Wai-Tsotsos",
            "title": {
                "fragments": [],
                "text": "Directing attention to onset and offset of image events for eye-head movement control"
            },
            "tldr": {
                "abstractSimilarityScore": 57,
                "text": "A computational model is derived from the difference of Gaussian (DOG) model and it examines the change in the response of the DOG operator over time to determine if changes have occurred and how the most prominent change can be determined."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 12th International Conference on Pattern Recognition"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2513368"
                        ],
                        "name": "J. Schall",
                        "slug": "J.-Schall",
                        "structuredName": {
                            "firstName": "Jeffrey",
                            "lastName": "Schall",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Schall"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2089844"
                        ],
                        "name": "D. P. Hanes",
                        "slug": "D.-P.-Hanes",
                        "structuredName": {
                            "firstName": "Doug",
                            "lastName": "Hanes",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. P. Hanes"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 2604671,
            "fieldsOfStudy": [
                "Biology",
                "Psychology"
            ],
            "id": "6697433c2191de658aa3243cacc38c176bc9a7b4",
            "isKey": false,
            "numCitedBy": 409,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "CONSPICUOUS visual features commonly attract gaze1,2, but how the brain selects targets for eye movements is not known. We investigated target selection in rhesus monkeys performing a visual search task3 by recording neurons in the frontal eye field, an area known to be responsible for generating purposive eye movements4,5. Neurons with combined visual- and eye movement-related activity were analysed. We found that the initial visual responses to search stimulus arrays were the same whether the target or a distractor was in the response field. We also found that the neural activity evolved to specify target location before the execution of eye movements, ultimately peaking when the target was in the response field and being suppressed when the target was beside but not distant from the response field. These results demonstrate a possible mechanism by which a desired target is fixated and inappropriate eye movements are prevented."
            },
            "slug": "Neural-basis-of-saccade-target-selection-in-frontal-Schall-Hanes",
            "title": {
                "fragments": [],
                "text": "Neural basis of saccade target selection in frontal eye field during visual search"
            },
            "tldr": {
                "abstractSimilarityScore": 65,
                "text": "This work investigated target selection in rhesus monkeys performing a visual search task by recording neurons in the frontal eye field, an area known to be responsible for generating purposive eye movements, and found that the initial visual responses to search stimulus arrays were the same whether the target or a distraction was in the response field."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1727853"
                        ],
                        "name": "John K. Tsotsos",
                        "slug": "John-K.-Tsotsos",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Tsotsos",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "John K. Tsotsos"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2572761,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "f778898b0d4e8159b62b4408ad60111f3504b87f",
            "isKey": false,
            "numCitedBy": 136,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "This research was motivated by the fol lowing question: What is the inherent computational d i f f i culty of the visual search experimental paradigm in psychology? This is an important issue since so many computational models have recently appeared that use visual search data as mot ivat ion. How can these results be properly used if the computational nature of the experiment itself is not understood? A computational def ini t ion of the visual search task is presented, and the bottom-up case is distinguished f rom the task-directed case. Then, a proof is given showing that the bottom-up case is NP-Complete in the size of the image, while the task-directed case has linear t ime complexity in the number of items in the display. The NP-Completeness of the bottom-up case is due solely to the inabil i ty to predict which pixels of a test image correspond to objects in a non-exponential manner. This provides the strongest possible evidence for the abandonment of purely bottom-up schemes that address the ful l generality of v is ion. It is thus necessary to sacrifice generality in order to re-shape the vision problem and to opt imize the resources dedicated to visual information processing so that a tractable problem is addressed."
            },
            "slug": "The-Complexity-of-Perceptual-Search-Tasks-Tsotsos",
            "title": {
                "fragments": [],
                "text": "The Complexity of Perceptual Search Tasks"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "It is thus necessary to sacrifice generality in order to re-shape the vision problem and to opt imize the resources dedicated to visual information processing so that a tractable problem is addressed."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145822452"
                        ],
                        "name": "J. Duncan",
                        "slug": "J.-Duncan",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Duncan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Duncan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3339088"
                        ],
                        "name": "G. Humphreys",
                        "slug": "G.-Humphreys",
                        "structuredName": {
                            "firstName": "Glyn",
                            "lastName": "Humphreys",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Humphreys"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8056977,
            "fieldsOfStudy": [
                "Psychology",
                "Biology"
            ],
            "id": "5d0fa7d833ea001e693fa156bbc164c60dc039f8",
            "isKey": false,
            "numCitedBy": 3402,
            "numCiting": 133,
            "paperAbstract": {
                "fragments": [],
                "text": "A new theory of search and visual attention is presented. Results support neither a distinction between serial and parallel search nor between search for features and conjunctions. For all search materials, instead, difficulty increases with increased similarity of targets to nontargets and decreasedsimilarity between nontargets, producing a continuum of search efficiency. A parallel stage of perceptual grouping and description is followed by competitive interaction between inputs, guiding selective access to awareness and action. An input gains weight to the extent that it matches an internal description of that information needed in current behavior (hence the effect of targetnontarget similarity). Perceptual grouping encourages input weights to change together (allowing \"spreading suppression\" of similar nontargets). The theory accounts for harmful effects of nontargets resembling any possible target, the importance of local nontarget grouping, and many other findings."
            },
            "slug": "Visual-search-and-stimulus-similarity.-Duncan-Humphreys",
            "title": {
                "fragments": [],
                "text": "Visual search and stimulus similarity."
            },
            "tldr": {
                "abstractSimilarityScore": 55,
                "text": "A new theory of search and visual attention is presented, which accounts for harmful effects of nontargets resembling any possible target, the importance of local nontarget grouping, and many other findings."
            },
            "venue": {
                "fragments": [],
                "text": "Psychological review"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39269549"
                        ],
                        "name": "G. Shulman",
                        "slug": "G.-Shulman",
                        "structuredName": {
                            "firstName": "Gordon",
                            "lastName": "Shulman",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Shulman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2019567"
                        ],
                        "name": "R. Remington",
                        "slug": "R.-Remington",
                        "structuredName": {
                            "firstName": "Roger",
                            "lastName": "Remington",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Remington"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "80173694"
                        ],
                        "name": "J. P. Mclean",
                        "slug": "J.-P.-Mclean",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Mclean",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. P. Mclean"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 6645394,
            "fieldsOfStudy": [
                "Psychology",
                "Biology"
            ],
            "id": "89073839318d5d25a3d7e755d85f2b03e294fe24",
            "isKey": false,
            "numCitedBy": 401,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Several experiments have shown that attention as measured by simple reaction time to luminance increments can be shifted in the visual field while the eyes are kept in a fixed position. The shift of attention appears to take place within 50 msec following a cue indicating the most likely position of the target. The present study reports that these shifts of attention can be time locked to a central cue. Moreover, they show that a probe event located between the cue and the target receives maximal facilitation from attention at a time prior to maximal facilitation at the target. These results provide support for an analogue movement of attention across the visual field that does not involve the suppression found during saccades."
            },
            "slug": "Moving-attention-through-visual-space.-Shulman-Remington",
            "title": {
                "fragments": [],
                "text": "Moving attention through visual space."
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "Support is provided for an analogue movement of attention across the visual field that does not involve the suppression found during saccades by reports that these shifts of attention can be time locked to a central cue."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of experimental psychology. Human perception and performance"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5278928"
                        ],
                        "name": "H. S. Bashinski",
                        "slug": "H.-S.-Bashinski",
                        "structuredName": {
                            "firstName": "Howard",
                            "lastName": "Bashinski",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. S. Bashinski"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46340277"
                        ],
                        "name": "V. Bacharach",
                        "slug": "V.-Bacharach",
                        "structuredName": {
                            "firstName": "Verne",
                            "lastName": "Bacharach",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Bacharach"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 36,
                                "start": 26
                            }
                        ],
                        "text": "I Artificial Intelligence 78 (1995) 507-545 517"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 36,
                                "start": 26
                            }
                        ],
                        "text": "I Artificial Intelligence 78 (1995) 507-545 509"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 36,
                                "start": 26
                            }
                        ],
                        "text": "I Artificial Intelligence 78 (1995) 507-545 527"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 36,
                                "start": 26
                            }
                        ],
                        "text": "I Artificial Intelligence 78 (1995) 507-545 519"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 36,
                                "start": 26
                            }
                        ],
                        "text": "I Artificial Intelligence 78 (1995) 507-545 521"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 34,
                                "start": 24
                            }
                        ],
                        "text": "I Amjicial Intelligence 78 (1995) 507-545 529"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 36,
                                "start": 26
                            }
                        ],
                        "text": "I Artificial Intelligence 78 (1995) 507-545 525"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 43,
                                "start": 33
                            }
                        ],
                        "text": "ELSEVIER Artificial Intelligence 78 (1995) 507-545 Artificial Intelligence"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 36,
                                "start": 26
                            }
                        ],
                        "text": "/ Artificial Intelligence 78 (1995) 507-545 511"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 36,
                                "start": 26
                            }
                        ],
                        "text": "I Artificial Intelligence 78 (1995) 507-545 515"
                    },
                    "intents": []
                }
            ],
            "corpusId": 22441195,
            "fieldsOfStudy": [
                "Psychology",
                "Biology"
            ],
            "id": "46399928217aece8c5398be94ba1ef00a4d15530",
            "isKey": true,
            "numCitedBy": 453,
            "numCiting": 53,
            "paperAbstract": {
                "fragments": [],
                "text": "The present experiment employed a visual signal-detection task within a cost-benefit (inhibition-facilitation) paradigm to examine the effects of selective attention on perceptual sensitivity. A central cue directed the subjects’ attention to either a right or a left spatial location where a detection task was performed. The cue was either a high/low or neutral-validity indicator of the position in which an event was likely to occur. A rating-scale response scheme in conjunction with the subjects’ target signal locational judgments allowed for the construction of ROC curves for each condition. Significant benefits were found for all subjects, supporting the hypothesis that selective attention can enhance perceptual sensitivity. Deallocation of attention resulted in an inhibition of sensitivity in unattended spatial locations. Subjects were consistently most sensitive in the right spatial location. There were no significant differences in overall response bias among the three conditions or in spatial locations. The results support theories of attention, such as “perceptual tuning, ” that suggest very early selective control."
            },
            "slug": "Enhancement-of-perceptual-sensitivity-as-the-result-Bashinski-Bacharach",
            "title": {
                "fragments": [],
                "text": "Enhancement of perceptual sensitivity as the result of selectively attending to spatial locations"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The hypothesis that selective attention can enhance perceptual sensitivity can be supported, as well as theories of attention, such as “perceptual tuning, ” that suggest very early selective control."
            },
            "venue": {
                "fragments": [],
                "text": "Perception & psychophysics"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47125588"
                        ],
                        "name": "James J. Clark",
                        "slug": "James-J.-Clark",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Clark",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "James J. Clark"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3110401"
                        ],
                        "name": "N. Ferrier",
                        "slug": "N.-Ferrier",
                        "structuredName": {
                            "firstName": "Nicola",
                            "lastName": "Ferrier",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Ferrier"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 206538754,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d451587ccc76d0b367ff871415be45ddc5036048",
            "isKey": false,
            "numCitedBy": 219,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "Cambridge, MA A vision system for use in a mobile robot system, or in n fixed multi-tasking industrial robot requires attentive control. Attentive control refers to the process by which the direction of gaze of the visual sensors are determined, nlong with the determination of what processing is required to be applied to the sensed images based on the goals of the robot and the tasks it is performing. This paper describes the implementation of a. mnt,ion control system which allows the attentive control of a binocular vision system. Attentive inputs to the system specify the type of visual feedback that the oculo-motor control system will use. The MDL language developed by Brockett [7] i8 used to communicate between the attentive planner and the motion controller."
            },
            "slug": "Modal-Control-Of-An-Attentive-Vision-System-Clark-Ferrier",
            "title": {
                "fragments": [],
                "text": "Modal Control Of An Attentive Vision System"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "The implementation of a attentive control system which allows the attentive control of a binocular vision system and the MDL language developed by Brockett i8 used to communicate between the attentive planner and the motion controller."
            },
            "venue": {
                "fragments": [],
                "text": "[1988 Proceedings] Second International Conference on Computer Vision"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2080398941"
                        ],
                        "name": "B. Motter",
                        "slug": "B.-Motter",
                        "structuredName": {
                            "firstName": "BC",
                            "lastName": "Motter",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Motter"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 12192172,
            "fieldsOfStudy": [
                "Psychology",
                "Biology"
            ],
            "id": "c4fba4074984f70fcbae169ba656067deb674e0e",
            "isKey": false,
            "numCitedBy": 276,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "Neural activity in area V4 was examined to assess (1) whether the effects of attentive selection for stimulus features could be based on the memory of the feature, (2) whether dynamically changing the feature selection would cause activity associated with the newly selected stimuli to pop out, and (3) whether intrusion of more than one stimulus into the receptive field would disrupt the feature-selective activity. Rhesus monkeys were trained on several variations of a conditional orientation discrimination task. A differential activation of area V4 neurons was observed in the conditional discrimination task based on the presence of a match or a nonmatch between the conditional cue (a particular color or luminance) and the color or luminance of the receptive field stimulus. The differential activation was unchanged when the cue was removed and the animal had to remember its color (or luminance) to perform the task. When the cued feature was switched from one alternative to another in the middle of a trial the differential activation of neurons reversed over the course of 150–300 msec. If the stimulus in the receptive field contained the newly selected feature, V4 neurons became activated without a concomitant change in the stimulus in classical receptive field. Across the topographic map of V4 the activity associated with the newly selected stimuli popped out, whereas the activity of deselected stimuli faded to the background levels of other background objects. Evidence of a suppressive input from stimuli outside the classical receptive field was clear in only 3 of 24 neurons examined. Intrusion into the classical receptive field by a second stimulus resulted in a diminished difference between matching and nonmatching conditions. These physiological data suggest a major role for attentional control in the parallel processing of simple feature-selective differences."
            },
            "slug": "Neural-correlates-of-feature-selective-memory-and-Motter",
            "title": {
                "fragments": [],
                "text": "Neural correlates of feature selective memory and pop-out in extrastriate area V4"
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of neuroscience : the official journal of the Society for Neuroscience"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145822452"
                        ],
                        "name": "J. Duncan",
                        "slug": "J.-Duncan",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Duncan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Duncan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49936483"
                        ],
                        "name": "R. Ward",
                        "slug": "R.-Ward",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Ward",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Ward"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2002266"
                        ],
                        "name": "K. Shapiro",
                        "slug": "K.-Shapiro",
                        "structuredName": {
                            "firstName": "Kimron",
                            "lastName": "Shapiro",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Shapiro"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 4368691,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "440c719c1459e0f00f6496087f3e9d8ab21890ae",
            "isKey": false,
            "numCitedBy": 627,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "IN vision, attentional limitations are reflected in interference or reduced accuracy when two objects must be identified at once in a brief display1,2. In our experiments a brief temporal separation was introduced between the two objects to be identified. We measured how long the first object continued to interfere with the second, and hence the time course of the first object's attentional demand. According to conventional serial models, attention is assigned rapidly to one object after another, with a dwell time of only a few dozen milliseconds per item3,4. But we report here that interference lasts for several hundred milliseconds—an order of magnitude more than the prediction of conventional models. We suggest that visual attention is not a high-speed switching mecha-nism, but a sustained state during which relevant objects become available to influence behaviour. This conclusion is consistent with recent physiological results in the monkey5."
            },
            "slug": "Direct-measurement-of-attentional-dwell-time-in-Duncan-Ward",
            "title": {
                "fragments": [],
                "text": "Direct measurement of attentional dwell time in human vision"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "It is suggested that visual attention is not a high-speed switching mecha-nism, but a sustained state during which relevant objects become available to influence behaviour, consistent with recent physiological results in the monkey."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "116003860"
                        ],
                        "name": "J. Bergen",
                        "slug": "J.-Bergen",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Bergen",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Bergen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 26926741,
            "fieldsOfStudy": [
                "Psychology",
                "Biology"
            ],
            "id": "e96e3eedd60a5a42001498bbda017a119f560586",
            "isKey": false,
            "numCitedBy": 498,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "When stimuli are available for just a brief period (∼100 ms) only restricted spatial information can be processed by the visual system. If the stimuli are presented very briefly, eye movements are not possible. The time during which the after-image of the stimulus is available for inspection is terminated by presentation of a masking pattern. We show here that in these conditions a small pattern is easily detected against a background made up of many others, only if this target pattern differs from the background patterns in certain local features. In this case the detectability of the target is almost independent of the number of background elements, suggesting that a parallel process is operating. Detection of patterns not differing from their backgrounds in such features requires focal attention which is a serial process. The aperture of this attention is scaled to minimize the number of shifts of attention required."
            },
            "slug": "Parallel-versus-serial-processing-in-rapid-pattern-Bergen-Julesz",
            "title": {
                "fragments": [],
                "text": "Parallel versus serial processing in rapid pattern discrimination"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "It is shown here that in these conditions a small pattern is easily detected against a background made up of many others, only if this target pattern differs from the background patterns in certain local features."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3339088"
                        ],
                        "name": "G. Humphreys",
                        "slug": "G.-Humphreys",
                        "structuredName": {
                            "firstName": "Glyn",
                            "lastName": "Humphreys",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Humphreys"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4235313"
                        ],
                        "name": "C. Romani",
                        "slug": "C.-Romani",
                        "structuredName": {
                            "firstName": "Cristina",
                            "lastName": "Romani",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Romani"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143892019"
                        ],
                        "name": "A. Olson",
                        "slug": "A.-Olson",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Olson",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Olson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2930519"
                        ],
                        "name": "M. Riddoch",
                        "slug": "M.-Riddoch",
                        "structuredName": {
                            "firstName": "Malcolm",
                            "lastName": "Riddoch",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Riddoch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145822452"
                        ],
                        "name": "J. Duncan",
                        "slug": "J.-Duncan",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Duncan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Duncan"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 4314914,
            "fieldsOfStudy": [
                "Biology",
                "Psychology"
            ],
            "id": "cad04656ef1a5473b1d7f0c30245f0a82ce32b63",
            "isKey": false,
            "numCitedBy": 123,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "EFFICIENT behaviour in the visual environment requires selection between stimuli competing for control of action. Many current models of selection are spatial: relevant objects are chosen by attending to their locations1\u00963. The unilateral stimulus extinction observed following lesions of the parietal lobe provides evidence for spatial selection4. Such patients may identify a single stimulus presented in their contralesional field, but can fail to detect the same stimulus when a competing stimulus is shown simultaneously on the ipsilesional side5. Here we demonstrate that extinction need not be spatial in nature, but may be determined by characteristics of the objects to be selected. In two patients with parietal lobe lesions and poor spatial localization, pictures extinguished words and closed shapes extinguished open shapes. This object-based extinction indicates the existence of biases within non-spatial selection mechanisms which are independent of biases produced by spatial selection mechanisms. We suggest that selection of objects for action requires that the 'winners' produced by the independent competitive biases for selection are bound together within distinct neural areas concerned with object properties and space."
            },
            "slug": "Non-spatial-extinction-following-lesions-of-the-in-Humphreys-Romani",
            "title": {
                "fragments": [],
                "text": "Non-spatial extinction following lesions of the parietal lobe in humans"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "It is demonstrated that extinction need not be spatial in nature, but may be determined by characteristics of the objects to be selected, and suggested that selection of objects for action requires that the 'winners' produced by the independent competitive biases for selection are bound together within distinct neural areas concerned with object properties and space."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2019567"
                        ],
                        "name": "R. Remington",
                        "slug": "R.-Remington",
                        "structuredName": {
                            "firstName": "Roger",
                            "lastName": "Remington",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Remington"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2068119437"
                        ],
                        "name": "L. Pierce",
                        "slug": "L.-Pierce",
                        "structuredName": {
                            "firstName": "Linda",
                            "lastName": "Pierce",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Pierce"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 19884906,
            "fieldsOfStudy": [
                "Psychology",
                "Biology"
            ],
            "id": "f35ba12ed89630e622178b01a8e8f748481cd437",
            "isKey": false,
            "numCitedBy": 247,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "Two experiments measured the time to shift spatial selective attention across the visual field to targets 2 or 10 deg from central fixation. A central arrow cued the most likely target location. The direction of attention was inferred from reaction times to expected, unexpected, and neutral locations. The development of a spatial attentional set with time was examined by presenting target probes at varying times after the cue. There were no effects of distance on the time course of the attentional set. Reaction times for far locations were slower than for near, but the effects of attention were evident by 150 msec in both cases. Spatial attention does not shift with a characteristic, fixed velocity. Rather, velocity is proportional to distance, resulting in a movement time that is invariant over the distances tested."
            },
            "slug": "Moving-attention:-Evidence-for-time-invariant-of-Remington-Pierce",
            "title": {
                "fragments": [],
                "text": "Moving attention: Evidence for time-invariant shifts of visual selective attention"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The direction of attention was inferred from reaction times to expected, unexpected, and neutral locations, and the development of a spatial attentional set with time was examined by presenting target probes at varying times after the cue."
            },
            "venue": {
                "fragments": [],
                "text": "Perception & psychophysics"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2080398941"
                        ],
                        "name": "B. Motter",
                        "slug": "B.-Motter",
                        "structuredName": {
                            "firstName": "BC",
                            "lastName": "Motter",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Motter"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14657118,
            "fieldsOfStudy": [
                "Psychology",
                "Biology"
            ],
            "id": "f4341a27911ba0b23c04b82a5296b8f71f7587fe",
            "isKey": false,
            "numCitedBy": 512,
            "numCiting": 40,
            "paperAbstract": {
                "fragments": [],
                "text": "Rhesus monkeys were trained on a conditional orientation discrimination task in order to assess whether attentive selection for a color or luminance stimulus feature would affect visual processing in extrastriate area V4. The task required monkeys to select a bar stimulus based on its color or luminance and then to discriminate the angular tilt of the selected stimulus. The majority of neurons (74%) were selectively activated when the color or luminance of the stimulus in the receptive field matched the color or luminance of the cue. The activity was attenuated when there was not a match between the stimulus and the cue. The differential activation was based on the presence or absence of the stimulus feature and was independent of spatial location. Across the population of V4 neurons, optimal stimuli that matched the selected color or luminance elicited about twice the activity as stimuli that did not match the selected feature. The feature-selective changes in activity were observed to develop beginning about 200 msec after the stimulus onset and were maintained over the remainder of the behavioral trial. In this task the activity of V4 neurons reflected a selection based on the cued feature and not simply the physical color or luminance of the receptive field stimulus. Under these conditions, the topographic representation of the neural activity in area V4 highlights the potential targets in the visual scene at the expense of background objects. These observations offer a physiological counterpart to psychophysical studies suggesting that stimuli can be preferentially selected in parallel across the visual field on the basis of a unique color or luminance feature"
            },
            "slug": "Neural-correlates-of-attentive-selection-for-color-Motter",
            "title": {
                "fragments": [],
                "text": "Neural correlates of attentive selection for color or luminance in extrastriate area V4"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "These observations offer a physiological counterpart to psychophysical studies suggesting that stimuli can be preferentially selected in parallel across the visual field on the basis of a unique color or luminance feature."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of neuroscience : the official journal of the Society for Neuroscience"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "22761851"
                        ],
                        "name": "H. Nothdurft",
                        "slug": "H.-Nothdurft",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Nothdurft",
                            "middleNames": [
                                "Christoph"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Nothdurft"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 24012944,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "3656aa8dcac710335efef8929047e001e95978a2",
            "isKey": false,
            "numCitedBy": 125,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Saliency-effects-across-dimensions-in-visual-search-Nothdurft",
            "title": {
                "fragments": [],
                "text": "Saliency effects across dimensions in visual search"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2171986492"
                        ],
                        "name": "EK Miller",
                        "slug": "EK-Miller",
                        "structuredName": {
                            "firstName": "EK",
                            "lastName": "Miller",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "EK Miller"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49192929"
                        ],
                        "name": "L. Li",
                        "slug": "L.-Li",
                        "structuredName": {
                            "firstName": "L.",
                            "lastName": "Li",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Li"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144375727"
                        ],
                        "name": "R. Desimone",
                        "slug": "R.-Desimone",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Desimone",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Desimone"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11407600,
            "fieldsOfStudy": [
                "Psychology",
                "Biology"
            ],
            "id": "484061370c9dde3fde02f3cf9934c17cc25ae8b1",
            "isKey": false,
            "numCitedBy": 763,
            "numCiting": 85,
            "paperAbstract": {
                "fragments": [],
                "text": "Inferior temporal (IT) cortex of primates is known to play an important role in visual memory. Previous studies of IT neurons during performance of working memory tasks have found modulation of responses when a current stimulus matched an item in memory; however, this effect was lost if other stimuli intervened in the retention interval. To examine how IT cortex retains memories while new stimuli are activating the cells, we recorded from IT neurons while monkeys performed a delayed matching-to-sample task, with multiple intervening items between the sample and matching test stimulus. About half of the cells responded differently to a test stimulus if it matched the sample, and this difference was maintained following intervening stimuli. For most of the affected cells, the responses to matching stimuli were suppressed; however, for a few cells the opposite effect was seen. Temporal contiguity alone could not explain the results, as there was no modulation of responses when a stimulus on one trial was repeated on the next trial. Thus, an active reset mechanism appears to restrict the memory comparison to just the stimuli presented within a trial. The suppressive effects appear to be generated within or before IT cortex since the suppression of response to matching stimuli began almost immediately with the onset of the visual response. The memory of the sample stimulus affected not only the responses to matching stimuli but also those to nonmatching stimuli. There was suggestive evidence that the more similar a nonmatching stimulus to the sample, the more the response was suppressed. About a quarter of the cells showed stimulus- selective activity in the delay interval following the sample. However, this activity appeared to be eliminated by intervening stimuli. Thus, it is unlikely that delay-interval activity in IT contributed to the performance of this particular version of delayed matching to sample. To determine how much information about the match-nonmatch status of the stimulus was conveyed by individual neurons, we analyzed the responses with discriminant analysis. The responses of an individual IT neuron could be used to classify a stimulus as matching or nonmatching on about 60% of the trials. To achieve the same performance as the animal would require averaging the responses of a minimum of 25 IT neurons. There was no evidence that mnemonic information was carried by temporal variations in the spike trains. By contrast, there was a modest amount of temporal variation in sensory responses to different visual stimuli.(ABSTRACT TRUNCATED AT 400 WORDS)"
            },
            "slug": "Activity-of-neurons-in-anterior-inferior-temporal-a-Miller-Li",
            "title": {
                "fragments": [],
                "text": "Activity of neurons in anterior inferior temporal cortex during a short- term memory task"
            },
            "tldr": {
                "abstractSimilarityScore": 54,
                "text": "Inferior temporal (IT) cortex of primates is recorded from IT neurons while monkeys performed a delayed matching-to-sample task, with multiple intervening items between the sample and matching test stimulus, and an active reset mechanism appears to restrict the memory comparison to just the stimuli presented within a trial."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of neuroscience : the official journal of the Society for Neuroscience"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1804676"
                        ],
                        "name": "B. Kröse",
                        "slug": "B.-Kröse",
                        "structuredName": {
                            "firstName": "Ben",
                            "lastName": "Kröse",
                            "middleNames": [
                                "J.",
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Kröse"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 39569612,
            "fieldsOfStudy": [
                "Biology",
                "Psychology"
            ],
            "id": "e6ffb71f9a8ba87ce58c82d1e309be6906bd26ce",
            "isKey": false,
            "numCitedBy": 225,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-control-and-speed-of-shifts-of-attention-Kröse-Julesz",
            "title": {
                "fragments": [],
                "text": "The control and speed of shifts of attention"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144737366"
                        ],
                        "name": "D. Sagi",
                        "slug": "D.-Sagi",
                        "structuredName": {
                            "firstName": "Dov",
                            "lastName": "Sagi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Sagi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 31013542,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "8f318d69ad488d20460c0495be544187a64e8081",
            "isKey": false,
            "numCitedBy": 473,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "The mixture of a few horizontal and vertical line segments embedded in an aggregate of diagonal line segments can be rapidly counted and their positions rapidly determined by a parallel (preattentive) process. However, the discrimination between horizontal and vertical orientation (that is, discrimination of a single conspicuous feature) requires serial search by focal attention. Under recent theories of attention, focal attention has been assumed to be required for the recognition of different combinations of features. According to the findings of this experiment, knowing \"what\" even a single feature is requires time-consuming search by focal attention. Only knowing \"where\" a target it is mediated by a parallel process."
            },
            "slug": "\"Where\"-and-\"what\"-in-vision.-Sagi-Julesz",
            "title": {
                "fragments": [],
                "text": "\"Where\" and \"what\" in vision."
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "According to the findings of this experiment, knowing \"what\" even a single feature is requires time-consuming search by focal attention, and only knowing \"where\" a target it is mediated by a parallel process."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1890313"
                        ],
                        "name": "C. Colby",
                        "slug": "C.-Colby",
                        "structuredName": {
                            "firstName": "Carol",
                            "lastName": "Colby",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Colby"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 197648322,
            "fieldsOfStudy": [
                "Psychology",
                "Biology"
            ],
            "id": "c28ca862350995932e8b1abdbb5dac8c2f61c3bc",
            "isKey": false,
            "numCitedBy": 105,
            "numCiting": 279,
            "paperAbstract": {
                "fragments": [],
                "text": "Attention is a distributed process. The activity of neurons in many brain structures can be modulated by the attentional state of the animal. Attention directed toward a particular external stimulus is often reflected in an enhancement of the sensory response to that stimulus. Enhancement is spatially selective for neurons in many areas and explicitly eye-movement related in most. Attention directed toward the internal representation of a stimulus may be associated with a prolongation of neural activity. These modulations of neuronal responsiveness underscore the dynamic nature of neural processing. Competition between left- and right-brain structures in the control of attention is common. While attention is perceived as a unitary process, it is subserved by many brain structures. Given the wide distribution of attentional processes, it is not surprising that children diagnosed as having attentional deficits show considerable diversity in symptoms and etiology. (J Child Neurol 1991;6(Suppl):S88-S116)."
            },
            "slug": "The-Neuroanatomy-and-Neurophysiology-of-Attention-Colby",
            "title": {
                "fragments": [],
                "text": "The Neuroanatomy and Neurophysiology of Attention"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "The activity of neurons in many brain structures can be modulated by the attentional state of the animal, and modulations of neuronal responsiveness underscore the dynamic nature of neural processing."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2869141"
                        ],
                        "name": "F. Ennesser",
                        "slug": "F.-Ennesser",
                        "structuredName": {
                            "firstName": "François",
                            "lastName": "Ennesser",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Ennesser"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3463966"
                        ],
                        "name": "G. Medioni",
                        "slug": "G.-Medioni",
                        "structuredName": {
                            "firstName": "Gérard",
                            "lastName": "Medioni",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Medioni"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 9688224,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c7cb3b96aba81b123278627d03c1f60eafa0bed0",
            "isKey": false,
            "numCitedBy": 105,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "A method is presented to locate an object in a color image, or more precisely, to select a set of likely locations for the object. The model is assumed to be of known color, which permits the use of color-space processing. A new method is presented, which exploits more information than the previous backprojection algorithm of Swain and Ballard at a competitive complexity. The new algorithm is based on matching local histograms with the model, instead of directly replacing pixels with a confidence that they belong to the object. It is proved that a simple version of this algorithm degenerates into backprojection in the worst case. The authors show how to estimate the scale of the model. The use of co-occurrence histograms is proposed to deal with cases where important color variations can be expected.<<ETX>>"
            },
            "slug": "Finding-Waldo,-or-focus-of-attention-using-local-Ennesser-Medioni",
            "title": {
                "fragments": [],
                "text": "Finding Waldo, or focus of attention using local color information"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "A new method is presented, which exploits more information than the previous backprojection algorithm of Swain and Ballard at a competitive complexity, based on matching local histograms with the model, instead of directly replacing pixels with a confidence that they belong to the object."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IEEE Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1727853"
                        ],
                        "name": "John K. Tsotsos",
                        "slug": "John-K.-Tsotsos",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Tsotsos",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "John K. Tsotsos"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 147405575,
            "fieldsOfStudy": [
                "Philosophy"
            ],
            "id": "5dddf7db98a4693dac1c394852e21dff5927fe76",
            "isKey": false,
            "numCitedBy": 10,
            "numCiting": 43,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-Role-of-Computational-Complexity-in-Perceptual-Tsotsos",
            "title": {
                "fragments": [],
                "text": "The Role of Computational Complexity in Perceptual Theory"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32862222"
                        ],
                        "name": "P. E. Hallett",
                        "slug": "P.-E.-Hallett",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Hallett",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. E. Hallett"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 27735329,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "4e0eaa380d0fbfb0e629bd27696aeea7cb48a3c9",
            "isKey": false,
            "numCitedBy": 1177,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Primary-and-secondary-saccades-to-goals-defined-by-Hallett",
            "title": {
                "fragments": [],
                "text": "Primary and secondary saccades to goals defined by instructions"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "116003860"
                        ],
                        "name": "J. Bergen",
                        "slug": "J.-Bergen",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Bergen",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Bergen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 24148245,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "a113b95f9f92447cd5d51fbf3c4b5914f6d4b2b3",
            "isKey": false,
            "numCitedBy": 636,
            "numCiting": 34,
            "paperAbstract": {
                "fragments": [],
                "text": "Recent research in texture discrimination has revealed the existence of a separate “preattentive visual system” that cannot process complex forms, yet can, almost instantaneously, without effort or scrutiny, detect differences in a few local conspicuous features, regardless of where they occur. These features, called “textons”, are elongated blobs (e.g., rectangles, ellipses, or line segments) with specific properties, including color, angular orientation, width, length, binocular and movement disparity, and flicker rate. The ends-of-lines (terminators) and crossings of line segments are also textons. Only differences in the textons or in their density (or number) can be preattentively detected while the positional relationship between neighboring textons passes unnoticed. This kind of positional information is the essence of form perception, and can be extracted only by a time-consuming and spatially restricted process that we call “focal attention”. The aperture of focal attention can be very narrow, even restricted to a minute portion of the fovea, and shifting its locus requires about 50 ms. Thus preattentive vision serves as an “early warning system” by pointing out those loci of texton differences that should be attended to. According to this theory, at any given instant the visual information intake is relatively modest."
            },
            "slug": "Human-factors-and-behavioral-science:-Textons,-the-Julesz-Bergen",
            "title": {
                "fragments": [],
                "text": "Human factors and behavioral science: Textons, the fundamental elements in preattentive vision and perception of textures"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "Preattentive vision serves as an “early warning system” by pointing out those loci of texton differences that should be attended to, according to this theory, at any given instant the visual information intake is relatively modest."
            },
            "venue": {
                "fragments": [],
                "text": "The Bell System Technical Journal"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "73293614"
                        ],
                        "name": "C. Duffy",
                        "slug": "C.-Duffy",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Duffy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Duffy"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143670798"
                        ],
                        "name": "R. Wurtz",
                        "slug": "R.-Wurtz",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Wurtz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Wurtz"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2950615,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "878fb2de624ce85022c1d0e4a3c8052dfe91e1b8",
            "isKey": false,
            "numCitedBy": 400,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "1. In these experiments we examined the receptive field mechanisms that support the optic flow field selective responses of neurons in the dorsomedial region of the medial superior temporal area (MSTd). Our experiments tested the predictions of two hypotheses of optic flow field selectivity. The direction mosaic hypothesis states that these receptive fields contain a set of planar direction-selective subfields that match the local directions of motion within optic flow fields. The vector field hypothesis states that these receptive fields are uniquely sensitive to distributed properties of planar, circular, or radial optic flow fields. 2. Experiments using large-field stimuli revealed that some neurons showed changes in optic flow field selectivity depending on the position of the stimulus in the receptive field; these are position-dependent responses. However, other neurons maintained the same optic flow field selectivities in spite of changes in stimulus position; these are position-invariant responses. We have used the position dependence or invariance of optic flow field selectivity as a way of testing the direction mosaic and vector field hypotheses. Position dependence is more consistent with the direction mosaic hypothesis, whereas position invariance is more consistent with the vector field hypothesis. 3. To test for position effects, we examined the optic flow field selectivity of small subfields within the large receptive fields of 160 MSTd neurons. First, we centered small-field optic flow stimuli of various sizes over the same position in the receptive field. Most MSTd neurons showed decreasing response amplitude with decreasing stimulus size but maintained optic flow field selectivity. 4. We then placed small-field stimuli at various positions within the large receptive field of these MSTd neurons. Position-invariant response selectivity was most prominent in single-component neurons, suggesting that they were more consistent with the vector field hypothesis. Position-dependent response selectivity was most prominent in triple-component neurons, suggesting that they were more consistent with the direction mosaic hypothesis. However, the variations in planar direction preference throughout the receptive field of these triple-component neurons were not consistent with a direction mosaic explanation of the large-field circular or radial selectivity observed. 5. Small-field position studies also demonstrated the existence of zones within the receptive field in which either direction-selective inhibitory or direction-selective excitatory responses predominated. The degree of overlap between these zones increased from nonselective to triple- to double- and finally to single-component neurons.(ABSTRACT TRUNCATED AT 400 WORDS)"
            },
            "slug": "Sensitivity-of-MST-neurons-to-optic-flow-stimuli.-Duffy-Wurtz",
            "title": {
                "fragments": [],
                "text": "Sensitivity of MST neurons to optic flow stimuli. II. Mechanisms of response selectivity revealed by small-field stimuli."
            },
            "tldr": {
                "abstractSimilarityScore": 71,
                "text": "The receptive field mechanisms that support the optic flow field selective responses of neurons in the dorsomedial region of the medial superior temporal area (MSTd) are examined and position dependence and position invariance are used as a way of testing the direction mosaic and vector field hypotheses."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2165973"
                        ],
                        "name": "J. Feldman",
                        "slug": "J.-Feldman",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Feldman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Feldman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1691804"
                        ],
                        "name": "D. Ballard",
                        "slug": "D.-Ballard",
                        "structuredName": {
                            "firstName": "Dana",
                            "lastName": "Ballard",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Ballard"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 62225923,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ab4aec5e0714b352e6c90d063fe830cbc70912bc",
            "isKey": false,
            "numCitedBy": 736,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Much of the progress in the fields constituting cognitive science has been based upon the use of explicit information processing models, almost exclusively patterned after conventional serial computers. An extension of these ideas to massively parallel, connectionist models appears to offer a number of advantages. After a preliminary discussion, this paper introduces a general connectionist model and considers how it might be used in cognitive science. Among the issues addressed are: stability and noise-sensitivity, distributed decision-making, time and sequence problems, and the representation of complex concepts."
            },
            "slug": "Connectionist-Models-and-Their-Properties-Feldman-Ballard",
            "title": {
                "fragments": [],
                "text": "Connectionist models and their properties"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4609856"
                        ],
                        "name": "Y. Tsal",
                        "slug": "Y.-Tsal",
                        "structuredName": {
                            "firstName": "Yehoshua",
                            "lastName": "Tsal",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Tsal"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 222295674,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "be2158a0122373921c96daf50e4a979e5874c298",
            "isKey": false,
            "numCitedBy": 165,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "Vocal reaction times were measured for targets presented at three distances from fixation. The targets were preceded by a cue, and the time interval between the cue and the target (stimulus-onset asynchrony; SOA) was varied. For each peripheral distance, the reaction time function initially declined as SOA was increased and then reached asymptote. The further the target from fixation, the longer the SOA at which the function reached asymptote. The asymptotic SOA values were taken as a measure of the time it takes attention to reach a given target. Comparisons of these values for the three peripheral distances permitted estimating the velocity of attention movements. These measurements suggest that when summoned by a peripheral cue, attention travels through space at a constant velocity of about 1 degree per 8 msec. Language: en"
            },
            "slug": "Movements-of-attention-across-the-visual-field-Tsal",
            "title": {
                "fragments": [],
                "text": "Movements of attention across the visual field"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145237406"
                        ],
                        "name": "N. Ahuja",
                        "slug": "N.-Ahuja",
                        "structuredName": {
                            "firstName": "Narendra",
                            "lastName": "Ahuja",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Ahuja"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145232712"
                        ],
                        "name": "A. L. Abbott",
                        "slug": "A.-L.-Abbott",
                        "structuredName": {
                            "firstName": "Amos",
                            "lastName": "Abbott",
                            "middleNames": [
                                "Lynn"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. L. Abbott"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11905069,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4f55a4148d7d8abf4292b10b3a1b21d4e3090cd9",
            "isKey": false,
            "numCitedBy": 91,
            "numCiting": 60,
            "paperAbstract": {
                "fragments": [],
                "text": "An approach to integrating stereo disparity, camera vergence, and lens focus to exploit their complementary strengths and weaknesses through active control of camera focus and orientations is presented. In addition, the aperture and zoom settings of the cameras are controlled. The result is an active vision system that dynamically and cooperatively interleaves image acquisition with surface estimation. A dense composite map of a single contiguous surface is synthesized by automatically scanning the surface and combining estimates of adjacent, local surface patches. This problem is formulated as one of minimizing a pair of objective functions. The first such function is concerned with the selection of a target for fixation. The second objective function guides the surface estimation process in the vicinity of the fixation point. Calibration parameters of the cameras are treated as variables during optimization, thus making camera calibration an integral, flexible component of surface estimation. An implementation of this method is described, and a performance evaluation of the system is presented. An average absolute error of less than 0.15% in estimated depth was achieved for a large surface having a depth of approximately 2 m. >"
            },
            "slug": "Active-Stereo:-Integrating-Disparity,-Vergence,-and-Ahuja-Abbott",
            "title": {
                "fragments": [],
                "text": "Active Stereo: Integrating Disparity, Vergence, Focus, Aperture and Calibration for Surface Estimation"
            },
            "tldr": {
                "abstractSimilarityScore": 76,
                "text": "An approach to integrating stereo disparity, camera vergence, and lens focus to exploit their complementary strengths and weaknesses through active control of camera focus and orientations and an active vision system that dynamically and cooperatively interleaves image acquisition with surface estimation is presented."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2262729"
                        ],
                        "name": "M. Posner",
                        "slug": "M.-Posner",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Posner",
                            "middleNames": [
                                "I."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Posner"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 142677749,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "c3dbaa22e63da3e5eadb2638e5eab9a04c6ce643",
            "isKey": false,
            "numCitedBy": 1160,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "\"Posner is to be congratulated on having brought together so many distinguished authors, each contributing a tutorial chapter on their particular branch of the science. The best of these are exemplary, and few of them fall below a high standard.\" -- L.H. Shaffer, \"Nature\" \"A beautifully lucid account.... Highly recommended.\" -- Nick Beard, \"New Scientist\" What is cognitive science? Foundations of Cognitive Science answers this question in a way that gives a feeling for the excitement, ferment, and accomplishments of this new field. It is the first broad treatment of cognitive science at an advanced level. Complete and authoritative, Foundations of Cognitive Science covers the major architectures; provides background in philosophy, linguistics, cognitive psychology, and neuroscience; and deals with methods for studying both brain and mind. All of the chapters have been written especially for the book by the leading scholars in the field. \" A Bradford Book\""
            },
            "slug": "Foundations-of-cognitive-science-Posner",
            "title": {
                "fragments": [],
                "text": "Foundations of cognitive science"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4414463"
                        ],
                        "name": "B. Gibson",
                        "slug": "B.-Gibson",
                        "structuredName": {
                            "firstName": "Bradley",
                            "lastName": "Gibson",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Gibson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1714701"
                        ],
                        "name": "H. Egeth",
                        "slug": "H.-Egeth",
                        "structuredName": {
                            "firstName": "Howard",
                            "lastName": "Egeth",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Egeth"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 32140674,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "de07ae981eaf0a5dbdda0a39093c85468baaf738",
            "isKey": false,
            "numCitedBy": 138,
            "numCiting": 48,
            "paperAbstract": {
                "fragments": [],
                "text": "Inhibition of return (IOR) has been described in terms of two functional components. The locationbased component is associated with descriptions of spatially fixed, environmental locations; the object-based component is associated with more abstract descriptions of spatially invariant objects. In the present study, we hypothesized that the location-based component may also be associated with descriptions of spatially invariant objects because, like environment-based descriptions, object-based descriptions have an intrinsic spatial structure. To test this hypothesis, we employed a computer-generated depiction of a brick that rotated in depth between the presentations of cue and target. The results of four experiments showed that IOR accrued to locations that remained fixed with respect to the brick as well as the environment, suggesting that both object-based and environment-based descriptions can influence location-based IOR."
            },
            "slug": "Inhibition-of-return-to-object-based-and-locations-Gibson-Egeth",
            "title": {
                "fragments": [],
                "text": "Inhibition of return to object-based and environment-based locations"
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "The results of four experiments showed that IOR accrued to locations that remained fixed with respect to the brick as well as the environment, suggesting that both object-based and environment-based descriptions can influence location-based IOR."
            },
            "venue": {
                "fragments": [],
                "text": "Perception & psychophysics"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1736641"
                        ],
                        "name": "E. Milios",
                        "slug": "E.-Milios",
                        "structuredName": {
                            "firstName": "Evangelos",
                            "lastName": "Milios",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Milios"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144968076"
                        ],
                        "name": "M. Jenkin",
                        "slug": "M.-Jenkin",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Jenkin",
                            "middleNames": [
                                "R.",
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Jenkin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1727853"
                        ],
                        "name": "John K. Tsotsos",
                        "slug": "John-K.-Tsotsos",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Tsotsos",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "John K. Tsotsos"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 207116500,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "67f3aaa0e4c7baaa95d95526a1f19ac027774299",
            "isKey": false,
            "numCitedBy": 53,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "We present the design of a controllable stereo vision head. TRISH (The Toronto IRIS Stereo Head) is a binocular camera mount, consisting of two fixed focal length color cameras with automatic gain control forming a verging stereo pair. TRISH is capable of version (rotation of the eyes about the vertical axis so as to maintain a constant disparity), vergence (rotation of each eye about the vertical axis so as to change the disparity), pan (rotation of the entire head about the vertical axis), and tilt (rotation of each eye about the horizontal axis). One novel characteristic of the design is that each camera can rotate about its own optical axis (torsion). Torsional movement makes it possible to minimize the vertical component of the two-dimensional search which is associated with stereo processing in verging stereo systems."
            },
            "slug": "Design-and-Performance-of-Trish,-a-Binocular-Robot-Milios-Jenkin",
            "title": {
                "fragments": [],
                "text": "Design and Performance of Trish, a Binocular Robot Head with Torsional Eye Movements"
            },
            "tldr": {
                "abstractSimilarityScore": 66,
                "text": "TRISH (The Toronto IRIS Stereo Head) is a binocular camera mount, consisting of two fixed focal length color cameras with automatic gain control forming a verging stereo pair."
            },
            "venue": {
                "fragments": [],
                "text": "Int. J. Pattern Recognit. Artif. Intell."
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2103793"
                        ],
                        "name": "M. Shadlen",
                        "slug": "M.-Shadlen",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Shadlen",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Shadlen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2885922"
                        ],
                        "name": "W. Newsome",
                        "slug": "W.-Newsome",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Newsome",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Newsome"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 13953649,
            "fieldsOfStudy": [
                "Biology",
                "Computer Science"
            ],
            "id": "b7238851ed650b7aa5bcd99d692deaac01f68f76",
            "isKey": false,
            "numCitedBy": 1315,
            "numCiting": 109,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Noise,-neural-codes-and-cortical-organization-Shadlen-Newsome",
            "title": {
                "fragments": [],
                "text": "Noise, neural codes and cortical organization"
            },
            "venue": {
                "fragments": [],
                "text": "Current Opinion in Neurobiology"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3205375"
                        ],
                        "name": "T. Lindeberg",
                        "slug": "T.-Lindeberg",
                        "structuredName": {
                            "firstName": "Tony",
                            "lastName": "Lindeberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Lindeberg"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 32122944,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "58e621b40a3d7a8480342894b71479b7080f5759",
            "isKey": false,
            "numCitedBy": 143,
            "numCiting": 186,
            "paperAbstract": {
                "fragments": [],
                "text": "This thesis, within the subfield of computer science known as computer vision, deals with the use of scale-space analysis in early low-level processing of visual information. The main contributions comprise the following five subjects: The formulation of a scale-space theory for discrete signals. Previously, the scale-space concept has been expressed for continuous signals only. We propose that the canonical way to construct a scale-space for discrete signals is by convolution with a kernel called the discrete analogue of the Gaussian kernel, or equivalently by solving a semi-discretized version of the diffusion equation. Both the one-dimensional and two-dimensional cases are covered. An extensive analysis of discrete smoothing kernels is carried out for one-dimensional signals and the discrete scale-space properties of the most common discretizations to the continuous theory are analysed. A representation, called the scale-space primal sketch, which gives a formal description of the hierarchical relations between structures at different levels of scale. It is aimed at making information in the scale-space representation explicit. We give a theory for its construction and an algorithm for computing it. A theory for extracting significant image structures and determining the scales of these structures from this representation in a solely bottom-up data-driven way. Examples demonstrating how such qualitative information extracted from the scale-space primal sketch can be used for guiding and simplifying other early visual processes. Applications are given to edge detection, histogram analysis and classification based on local features. Among other possible applications one can mention perceptual grouping, texture analysis, stereo matching, model matching and motion. A detailed theoretical analysis of the evolution properties of critical points and blobs in scale-space, comprising drift velocity estimates under scale-space smoothing, a classification of the possible types of generic events at bifurcation situations and estimates of how the number of local extrema in a signal can be expected to decrease as function of the scale parameter. For two-dimensional signals the generic bifurcation events are annihilations and creations of extremum-saddle point pairs. Interpreted in terms of blobs, these transitions correspond to annihilations, merges, splits and creations. Experiments on different types of real imagery demonstrate that the proposed theory gives perceptually intuitive results."
            },
            "slug": "Discrete-Scale-Space-Theory-and-the-Scale-Space-Lindeberg",
            "title": {
                "fragments": [],
                "text": "Discrete Scale-Space Theory and the Scale-Space Primal Sketch"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "This thesis proposes that the canonical way to construct a scale-space for discrete signals is by convolution with a kernel called the discrete analogue of the Gaussian kernel, or equivalently by solving a semi-discretized version of the diffusion equation."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35144811"
                        ],
                        "name": "S. C. Masin",
                        "slug": "S.-C.-Masin",
                        "structuredName": {
                            "firstName": "Sergio",
                            "lastName": "Masin",
                            "middleNames": [
                                "Cesare"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. C. Masin"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 142000735,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "6710d187b4f9a50a4f810e0dab35948efbb93f10",
            "isKey": false,
            "numCitedBy": 66,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Foundations-of-perceptual-theory-Masin",
            "title": {
                "fragments": [],
                "text": "Foundations of perceptual theory"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143668432"
                        ],
                        "name": "S. Parker",
                        "slug": "S.-Parker",
                        "structuredName": {
                            "firstName": "Scott",
                            "lastName": "Parker",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Parker"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48113163"
                        ],
                        "name": "B. Schneider",
                        "slug": "B.-Schneider",
                        "structuredName": {
                            "firstName": "B",
                            "lastName": "Schneider",
                            "middleNames": [
                                "A"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Schneider"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 32605769,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "3462b9c5bf295e1a88d722ce6528b7bddf22df35",
            "isKey": false,
            "numCitedBy": 48,
            "numCiting": 32,
            "paperAbstract": {
                "fragments": [],
                "text": "The influence of intensity range on the perceived magnitude of a stimulus is well documented and usually attributed to response biases. Recent studies, however, have suggested that the range effect might be sensory in origin. To test this notion, we had one set of subjects compare loudness intervals in three conditions : a broad-range condition (15 tones, 23–95 dB SPL), a soft shortrange condition (the lowest 10 tones from the broad-range condition), and a loud short-range condition (the highest 10 tones). Nonmetric scaling showed that the broad-range and loud short-range conditionshad identical loudness functions, However, the second derivative of the loudness function was larger for the soft short-range condition than fox the broad-range condition. This pattern of results is consistent with the notion of a nonlinear ampler whose gain and degree of nonlinearity are adjusted under top-down control, so as to prevent distortion and increase discriminabztity."
            },
            "slug": "The-stimulus-range-effect:-Evidence-for-top-down-of-Parker-Schneider",
            "title": {
                "fragments": [],
                "text": "The stimulus range effect: Evidence for top-down control of sensory intensity in audition"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "This pattern of results is consistent with the notion of a nonlinear ampler whose gain and degree of nonlinearity are adjusted under top-down control, so as to prevent distortion and increase discriminabztity."
            },
            "venue": {
                "fragments": [],
                "text": "Perception & psychophysics"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145314163"
                        ],
                        "name": "D. Wilkes",
                        "slug": "D.-Wilkes",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Wilkes",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Wilkes"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1727853"
                        ],
                        "name": "John K. Tsotsos",
                        "slug": "John-K.-Tsotsos",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Tsotsos",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "John K. Tsotsos"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 46070272,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "897aa07a2caffc95c785027f34d455c528122a42",
            "isKey": false,
            "numCitedBy": 7,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "Probabilistic algorithms are presented for efficient storage and retrieval of sets of feature vectors, given a known error process operating on the query set, that perturbs the query set away from the corresponding stored set. The algorithms operate by mapping each set to a corresponding generalized indicator vector and then performing a pruned search of a tree containing stored indicator vectors. The pruning is based on the probability of the query, given the stored items below the current position in the tree. Analysis and trial results show that this approach requires less total computation than existing methods based on parallel architectures. The indicator vector retrieval method can also cope efficiently with query vectors of much higher dimensionality than existing serial algorithms for nearest-neighbor searches.<<ETX>>"
            },
            "slug": "Efficient-serial-associative-memory-Wilkes-Tsotsos",
            "title": {
                "fragments": [],
                "text": "Efficient serial associative memory"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "Analysis and trial results show that this approach requires less total computation than existing methods based on parallel architectures and can cope efficiently with query vectors of much higher dimensionality than existing serial algorithms for nearest-neighbor searches."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IEEE Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2977490"
                        ],
                        "name": "L. Uhr",
                        "slug": "L.-Uhr",
                        "structuredName": {
                            "firstName": "Leonard",
                            "lastName": "Uhr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Uhr"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 34549773,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a44f82314137a599dd059053a042abf148ea3617",
            "isKey": false,
            "numCitedBy": 168,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "This note gives a brief overview of six types of pattern recognition programs that: 1) preprocess, then characterize; 2) preprocess and characterize together; 3) preprocess and characterize into a \"recognition cone;\" 4) describe as well as name; 5) compose interrelated descriptions; and 6) converse."
            },
            "slug": "Layered-\"Recognition-Cone\"-Networks-That-Classify,-Uhr",
            "title": {
                "fragments": [],
                "text": "Layered \"Recognition Cone\" Networks That Preprocess, Classify, and Describe"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "This note gives a brief overview of six types of pattern recognition programs that: 1) preprocess, then characterize; 2) pre Process and characterize together; 3) pre process and characterize into a \"recognition cone;\" 4) describe as well as name; 5) compose interrelated descriptions; and 6) converse."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Computers"
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2502152"
                        ],
                        "name": "A. Treisman",
                        "slug": "A.-Treisman",
                        "structuredName": {
                            "firstName": "Anne",
                            "lastName": "Treisman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Treisman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 1240550,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "4112bb57ca621b7be08ed7cdb490774f62ffee6c",
            "isKey": false,
            "numCitedBy": 1724,
            "numCiting": 70,
            "paperAbstract": {
                "fragments": [],
                "text": "(1988). Features and objects: The fourteenth bartlett memorial lecture. The Quarterly Journal of Experimental Psychology Section A: Vol. 40, No. 2, pp. 201-237."
            },
            "slug": "Features-and-Objects:-The-Fourteenth-Bartlett-Treisman",
            "title": {
                "fragments": [],
                "text": "Features and Objects: The Fourteenth Bartlett Memorial Lecture"
            },
            "venue": {
                "fragments": [],
                "text": "The Quarterly journal of experimental psychology. A, Human experimental psychology"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1741124"
                        ],
                        "name": "L. Valiant",
                        "slug": "L.-Valiant",
                        "structuredName": {
                            "firstName": "Leslie",
                            "lastName": "Valiant",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Valiant"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 21208202,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9160cf93ac3cc135c178e8153b702b11447f7f1c",
            "isKey": false,
            "numCitedBy": 391,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The worst-case time complexity of algorithms for multiprocessor computers with binary comparisons as the basic operations is investigated. It is shown that for the problems of finding the maximum, sorting, and merging a pair of sorted lists, if n, the size of the input set, is not less than k, the number of processors, speedups of at least $O(k/\\log \\log k)$ can be achieved with respect to comparison operations. The algorithm for finding the maximum is shown to be optimal for all values of k and n."
            },
            "slug": "Parallelism-in-Comparison-Problems-Valiant",
            "title": {
                "fragments": [],
                "text": "Parallelism in Comparison Problems"
            },
            "tldr": {
                "abstractSimilarityScore": 82,
                "text": "The worst-case time complexity of algorithms for multiprocessor computers with binary comparisons as the basic operations is investigated and the algorithm for finding the maximum is shown to be optimal for all values of k and n."
            },
            "venue": {
                "fragments": [],
                "text": "SIAM J. Comput."
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2058739668"
                        ],
                        "name": "F. Crick",
                        "slug": "F.-Crick",
                        "structuredName": {
                            "firstName": "Francis",
                            "lastName": "Crick",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Crick"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145624227"
                        ],
                        "name": "C. Koch",
                        "slug": "C.-Koch",
                        "structuredName": {
                            "firstName": "Christof",
                            "lastName": "Koch",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Koch"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2141609,
            "fieldsOfStudy": [
                "Psychology",
                "Biology"
            ],
            "id": "631ac12813e462c9a59ccff4c2ed6fbac17d36ca",
            "isKey": false,
            "numCitedBy": 1470,
            "numCiting": 89,
            "paperAbstract": {
                "fragments": [],
                "text": "~workin~ ~~~. We outfit several lines ofexp~‘~~~ work that might advance the understanding of the neural mechanisms involved. The neural basis of very short-term memory especia& needs more exjw%nental study."
            },
            "slug": "Towards-a-neurobiological-theory-of-consciousness-Crick-Koch",
            "title": {
                "fragments": [],
                "text": "Towards a neurobiological theory of consciousness"
            },
            "tldr": {
                "abstractSimilarityScore": 58,
                "text": "The neural basis of very short-term memory especia needs more study, and several lines of work are outfits that might advance the understanding of the neural mechanisms involved."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "corpusId": 222282396,
            "fieldsOfStudy": [],
            "id": "109afae09812e78a324648c5f61faa147e912f74",
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Abrupt visual onsets and selective attention: Evidence from visual search."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145314163"
                        ],
                        "name": "D. Wilkes",
                        "slug": "D.-Wilkes",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Wilkes",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Wilkes"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1727853"
                        ],
                        "name": "John K. Tsotsos",
                        "slug": "John-K.-Tsotsos",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Tsotsos",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "John K. Tsotsos"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 63037436,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6beaa8dd1676762e521e5f0a0e1ef29ff66e428a",
            "isKey": false,
            "numCitedBy": 8,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Integration-of-camera-motion-behaviours-for-active-Wilkes-Tsotsos",
            "title": {
                "fragments": [],
                "text": "Integration of camera motion behaviours for active object recognition"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8490970"
                        ],
                        "name": "L. Harris",
                        "slug": "L.-Harris",
                        "structuredName": {
                            "firstName": "Laurence",
                            "lastName": "Harris",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Harris"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144968076"
                        ],
                        "name": "M. Jenkin",
                        "slug": "M.-Jenkin",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Jenkin",
                            "middleNames": [
                                "R.",
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Jenkin"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62940013,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "181bec55f1f6a97856cca27bbffa9dc98c6c4ec5",
            "isKey": false,
            "numCitedBy": 80,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Spatial-vision-in-humans-and-robots-Harris-Jenkin",
            "title": {
                "fragments": [],
                "text": "Spatial vision in humans and robots"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144910145"
                        ],
                        "name": "A. Allport",
                        "slug": "A.-Allport",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Allport",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Allport"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 64089843,
            "fieldsOfStudy": [
                "Computer Science",
                "Psychology"
            ],
            "id": "3c7b3778536da3c11eba898102184de81afade50",
            "isKey": false,
            "numCitedBy": 962,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Visual-attention-Allport",
            "title": {
                "fragments": [],
                "text": "Visual attention"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1727853"
                        ],
                        "name": "John K. Tsotsos",
                        "slug": "John-K.-Tsotsos",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Tsotsos",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "John K. Tsotsos"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60805378,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "fef9e430e3d1292fec750f22af41351767cf2c10",
            "isKey": false,
            "numCitedBy": 54,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "An-inhibitory-beam-for-attentional-selection-Tsotsos",
            "title": {
                "fragments": [],
                "text": "An inhibitory beam for attentional selection"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1719838"
                        ],
                        "name": "W. Grimson",
                        "slug": "W.-Grimson",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Grimson",
                            "middleNames": [
                                "Eric",
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Grimson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 59881317,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9a4de4524d0f00e14f21d079da60e7f2dfbb2f6a",
            "isKey": false,
            "numCitedBy": 24,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "An-active-visual-attention-system-to-play-\\Where''s-Grimson",
            "title": {
                "fragments": [],
                "text": "An active visual attention system to play \\Where''s Waldo"
            },
            "venue": {
                "fragments": [],
                "text": "CVPR 1994"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35184441"
                        ],
                        "name": "P. Roland",
                        "slug": "P.-Roland",
                        "structuredName": {
                            "firstName": "Per",
                            "lastName": "Roland",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Roland"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 26128107,
            "fieldsOfStudy": [
                "Medicine"
            ],
            "id": "271a125b0f89cebf9d5215302afe5a7422e1f59a",
            "isKey": false,
            "numCitedBy": 302,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Cortical-regulation-of-selective-attention-in-man.-Roland",
            "title": {
                "fragments": [],
                "text": "Cortical regulation of selective attention in man. A regional cerebral blood flow study."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1982
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "inferotemporal cortex of the macaque monkey"
            },
            "venue": {
                "fragments": [],
                "text": "J. Neurophysiol"
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A complexity level analysis of vision"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings International Conference on Computer Vision: Human and Machine Vision Workship,"
            },
            "year": 1987
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Focusing attention on specific auditory filters"
            },
            "venue": {
                "fragments": [],
                "text": "in: Proceedings Annual Meeting of the International Society for"
            },
            "year": 1901
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 64,
        "totalPages": 7
    },
    "page_url": "https://www.semanticscholar.org/paper/Modeling-Visual-Attention-via-Selective-Tuning-Tsotsos-Culhane/8930f62a4b5eb1cbabf224cf84aa009ea798cfee?sort=total-citations"
}