{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "72419159"
                        ],
                        "name": "R. Brooks",
                        "slug": "R.-Brooks",
                        "structuredName": {
                            "firstName": "Rodney",
                            "lastName": "Brooks",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Brooks"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2326697"
                        ],
                        "name": "Russell Creiner",
                        "slug": "Russell-Creiner",
                        "structuredName": {
                            "firstName": "Russell",
                            "lastName": "Creiner",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Russell Creiner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1738591"
                        ],
                        "name": "T. Binford",
                        "slug": "T.-Binford",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Binford",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Binford"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 141,
                                "start": 137
                            }
                        ],
                        "text": "All image interpretations carried out completely automatically by ACRONYM SO far have used a syntactic graph matcher due to Greiner (see [18])."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 51,
                                "start": 47
                            }
                        ],
                        "text": "An earlier version of ACRONYM was described in [18]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 5570699,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "7383ddc07be0679387e890ec88ec3a3147379cdf",
            "isKey": false,
            "numCitedBy": 142,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "ACRONYM Is a model-based image understanding system. It demonstrates mechanisms for interpretation of images with generic object classes and generic viewing conditions, in a way that is generalizable. It incorporates a powerful geometric modeling capability with a high level modeling language for natural communication with the user In terms of object models. A user gives high level descriptions of both generic and specific instances of objects. A rule-based Inference system produces a viewpoint dependent symbolic summary of the predicted appearance of the objects. This geometric reasoning capability enables the system to incorporate and relate knowledge and information at different levels. This summary drives a powerful syntactic matcher to find instances of the objects in preprocessed images."
            },
            "slug": "The-ACRONYM-Model-Based-Vision-System-Brooks-Creiner",
            "title": {
                "fragments": [],
                "text": "The ACRONYM Model-Based Vision System"
            },
            "tldr": {
                "abstractSimilarityScore": 98,
                "text": "ACRONYM Is a model-based image understanding system that demonstrates mechanisms for interpretation of images with generic object classes and generic viewing conditions, in a way that is generalizable."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2453875"
                        ],
                        "name": "Gerald J. Agin",
                        "slug": "Gerald-J.-Agin",
                        "structuredName": {
                            "firstName": "Gerald",
                            "lastName": "Agin",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Gerald J. Agin"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 70,
                                "start": 59
                            }
                        ],
                        "text": "language for descriptive processes working from range data [2, 39, 43] and for modelling systems for vision [25, 32, 34, 37]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 120719486,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "092e596a5188b9fce64e038e391cb92ef50fce3f",
            "isKey": false,
            "numCitedBy": 141,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : Three dimensional images, similar to depth maps, are obtained with a triangulation system using a television camera, and a deflectable laser beam diverged into a plane by a cylindrical lens. Complex objects are represented as structures joining parts called generalized cylinders. These primitives are formalized in a volume representation by an arbitrary cross section varying along a space curve axis. Several types of joint structures are discussed. Experimental results are shown for the description (building of internal computer models) of a handful of complex objects, beginning with laser range data from actual objects. Our programs have generated complete descriptions of rings, cones, and snake-like objects, all of which may be described by a single primitive. Complex objects, such as dolls, have been segmented into parts, most of which are well described by programs which implement generalized cylinder descriptions."
            },
            "slug": "Representation-and-description-of-curved-objects-Agin",
            "title": {
                "fragments": [],
                "text": "Representation and description of curved objects"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144592244"
                        ],
                        "name": "J. Tenenbaum",
                        "slug": "J.-Tenenbaum",
                        "structuredName": {
                            "firstName": "Jay",
                            "lastName": "Tenenbaum",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Tenenbaum"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1696931"
                        ],
                        "name": "H. Barrow",
                        "slug": "H.-Barrow",
                        "structuredName": {
                            "firstName": "Harry",
                            "lastName": "Barrow",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barrow"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60510746,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d625945e6c7dc923d98feeeab91de19107130c83",
            "isKey": false,
            "numCitedBy": 87,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : MSYS is a system for reasoning with uncertain information and inexact rules of inference. Its major application, to date, has been to the interpretation of visual features (such as regions) in scene analysis. In this application, features are assigned sets of possible interpretations with associated likelihoods based on local attributes (e.g., color, size, and shape). Interpretations are related by rules of inference that adjust the likelihoods up or down in accordance with the interpretation likelihoods of related features. An asynchronous relaxation process repeatedly applies the rules until a consistent set of likelihood values is attained. At this point, several alternative interpretations still exist for each feature. One feature is chosen and the most likely of its alternatives is assumed. The rules are then used in this more precise context to determine likelihoods for the interpretations of remaining features by a further round of relaxation. The selection and relaxation steps are repeated until all features have been interpreted."
            },
            "slug": "MSYS:-A-System-for-Reasoning-About-Scenes.-Tenenbaum-Barrow",
            "title": {
                "fragments": [],
                "text": "MSYS: A System for Reasoning About Scenes."
            },
            "tldr": {
                "abstractSimilarityScore": 73,
                "text": "MSYS is a system for reasoning with uncertain information and inexact rules of inference that contributes to the interpretation of visual features in scene analysis by repeatedly applying rules until a consistent set of likelihood values is attained."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 121,
                                "start": 109
                            }
                        ],
                        "text": "The idea is that higher level processes will make use of these rich descriptions to interpret the image (see [32, 33, 23] for instance)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 124,
                                "start": 108
                            }
                        ],
                        "text": "language for descriptive processes working from range data [2, 39, 43] and for modelling systems for vision [25, 32, 34, 37]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 86323799,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d83ecd7a588461dc13f579d723801a46b90144cb",
            "isKey": false,
            "numCitedBy": 132,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "For human vision to be explained by a computational theory, the first question is plain: What are the problems that the brain solves when we see? It is argued that vision is the construction of efficient symbolic descriptions from images of the world. An important aspect of vision is therefore the choice of representations for the different kinds of information in a visual scene. An overall framework is suggested for extracting shape information from images, in which the analysis proceeds through three representations: (1) the primal sketch, which makes explicit the intensity changes and local two-dimensional geometry of an image; (2) the 2 1/2-D sketch, which is a viewer-centred representation of the depth, orientation and discontinuities of the visible surfaces; and (3) the 3-D model representation, which allows an object-centred description of the three-dimensional structure and organization of a viewed shape. The critical act in formulating computational theories for processes capable of constructing these representations is the discovery of valid constraints on the way the world behaves, that provide sufficient additional information to allow recovery of the desired characteristic. Finally, once a computational theory for a process has been formulated, algorithms for implementing it may be designed, and their performance compared with that of the human visual processor."
            },
            "slug": "Visual-Information-Processing:-The-Structure-and-of-Marr",
            "title": {
                "fragments": [],
                "text": "Visual Information Processing: The Structure and Creation of Visual Representations"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "An overall framework is suggested for extracting shape information from images, in which the analysis proceeds through three representations: the primal sketch, which makes explicit the intensity changes and local two-dimensional geometry of an image, the 2 1/2-D sketch, and the 3-D model representation, which allows an object-centred description of the three-dimensional structure and organization of a viewed shape."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144901036"
                        ],
                        "name": "H. Nishihara",
                        "slug": "H.-Nishihara",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Nishihara",
                            "middleNames": [
                                "Keith"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Nishihara"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 124,
                                "start": 108
                            }
                        ],
                        "text": "language for descriptive processes working from range data [2, 39, 43] and for modelling systems for vision [25, 32, 34, 37]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 43759520,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bdf9b8f4de001f5f37bc844efbce1210d581d599",
            "isKey": false,
            "numCitedBy": 2323,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "The human visual process can be studied by examining the computational problems associated with deriving useful information from retinal images. In this paper, we apply this approach to the problem of representing three-dimensional shapes for the purpose of recognition. 1. Three criteria, accessibility, scope and uniqueness, and stability and sensitivity, are presented for judging the usefulness of a representation for shape recognition. 2. Three aspects of a representation’s design are considered, (i) the representation’s coordinate system, (ii) its primitives, which are the primary units of shape information used in the representation, and (iii) the organization the representation imposes on the information in its descriptions. 3. In terms of these design issues and the criteria presented, a shape representation for recognition should: (i) use an object-centred coordinate system, (ii) include volumetric primitives of varied sizes, and (iii) have a modular organization. A representation based on a shape’s natural axes (for example the axes identified by a stick figure) follows directly from these choices. 4. The basic process for deriving a shape description in this representation must involve: (i) a means for identifying the natural axes of a shape in its image and (ii) a mechanism for transforming viewer-centred axis specifications to specifications in an object-centred coordinate system. 5. Shape recognition involves: (i) a collection of stored shape descriptions, and (ii) various indexes into the collection that allow a newly derived description to be associated with an appropriate stored description. The most important of these indexes allows shape recognition to proceed conservatively from the general to the specific based on the specificity of the information available from the image. 6. New constraints supplied by a conservative recognition process can be used to extract more information from the image. A relaxation process for carrying out this constraint analysis is described."
            },
            "slug": "Representation-and-recognition-of-the-spatial-of-Marr-Nishihara",
            "title": {
                "fragments": [],
                "text": "Representation and recognition of the spatial organization of three-dimensional shapes"
            },
            "tldr": {
                "abstractSimilarityScore": 93,
                "text": "The human visual process can be studied by examining the computational problems associated with deriving useful information from retinal images by applying the approach to the problem of representing three-dimensional shapes for the purpose of recognition."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144862593"
                        ],
                        "name": "R. Nevatia",
                        "slug": "R.-Nevatia",
                        "structuredName": {
                            "firstName": "Ramakant",
                            "lastName": "Nevatia",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Nevatia"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1738591"
                        ],
                        "name": "T. Binford",
                        "slug": "T.-Binford",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Binford",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Binford"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 24,
                                "start": 20
                            }
                        ],
                        "text": "Nevatia and Binford [39] used generalized cones."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 85,
                                "start": 81
                            }
                        ],
                        "text": "Techniques of segmentation and description were developed by Nevatia and Binford [39] to build tree structured generalized cone models of objects detected using a laser range finder."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 87,
                                "start": 83
                            }
                        ],
                        "text": "Eventually we plan to build from examples, using techniques of Nevatia and Binford [39]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 70,
                                "start": 59
                            }
                        ],
                        "text": "language for descriptive processes working from range data [2, 39, 43] and for modelling systems for vision [25, 32, 34, 37]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 10878162,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4dd5ad87ccf9b8493625e38514e2f37ab9ce99cb",
            "isKey": true,
            "numCitedBy": 389,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Description-and-Recognition-of-Curved-Objects-Nevatia-Binford",
            "title": {
                "fragments": [],
                "text": "Description and Recognition of Curved Objects"
            },
            "venue": {
                "fragments": [],
                "text": "Artif. Intell."
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1751698"
                        ],
                        "name": "K. Sugihara",
                        "slug": "K.-Sugihara",
                        "structuredName": {
                            "firstName": "Kokichi",
                            "lastName": "Sugihara",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Sugihara"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 8349748,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d1c6bc84f65e508c9c9fe9d3eb5f6a96abd4d5fa",
            "isKey": false,
            "numCitedBy": 9,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "A knowledge-guided system is presented for the analysis of range data obtained from the three-dimensional world. A model of the world is defined by a finite set of prototypes of three-dimensional objects, from which the system establishes its own knowledge about the world in the form of a \"junction dictionary\". Next the system exploits the dictionary for the prediction of missing edges in the analysis of range data originated with real three-dimensional scenes, and thus constructs concise descriptions of the scenes in terms of vertices, edges, faces and spatial relationships among them. The system is flexible in the sense that the only thing an operator has to do when the world is changed is to replace the model by a new one; the system constructs its own knowledge about the new world and utilizes it for the analysis of range data."
            },
            "slug": "Automatic-Construction-of-Junction-Dictionaries-and-Sugihara",
            "title": {
                "fragments": [],
                "text": "Automatic Construction of Junction Dictionaries and Their Exploitation for the Analysis of Range Data"
            },
            "tldr": {
                "abstractSimilarityScore": 69,
                "text": "A knowledge-guided system is presented for the analysis of range data obtained from the three-dimensional world, from which the system establishes its own knowledge about the world in the form of a \"junction dictionary\"."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1696931"
                        ],
                        "name": "H. Barrow",
                        "slug": "H.-Barrow",
                        "structuredName": {
                            "firstName": "Harry",
                            "lastName": "Barrow",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barrow"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144592244"
                        ],
                        "name": "J. Tenenbaum",
                        "slug": "J.-Tenenbaum",
                        "structuredName": {
                            "firstName": "Jay",
                            "lastName": "Tenenbaum",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Tenenbaum"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14892007,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bd580fad7a14f93d6d59765a5fe91974e2653281",
            "isKey": false,
            "numCitedBy": 922,
            "numCiting": 34,
            "paperAbstract": {
                "fragments": [],
                "text": "We suggest that an appropriate role of early visual processing is to describe a scene in terms of intrinsic (vertical) characteristics -- such as range, orientation, reflectance, and incident illumination -- of the surface element visible at each point in the image. Support for this idea comes from three sources: the obvious utility of intrinsic characteristics for higher-level scene analysis; the apparent ability of humans to determine these characteristics, regardless of viewing conditions or familiarity with the scene; and a theoretical argument that such a description is obtainable, by a noncognitive and nonpurposive process, at least, for simple scene domains. The central problem in recovering intrinsic scene characteristics is that the information is confounded in the original light-intensity image: a single intensity value encodes all the characteristics of the corresponding scene point. Recovery depends on exploiting constraints, derived from assumptions about the nature of the scene and the physics of the imaging process."
            },
            "slug": "RECOVERING-INTRINSIC-SCENE-CHARACTERISTICS-FROM-Barrow-Tenenbaum",
            "title": {
                "fragments": [],
                "text": "RECOVERING INTRINSIC SCENE CHARACTERISTICS FROM IMAGES"
            },
            "tldr": {
                "abstractSimilarityScore": 97,
                "text": "It is suggested that an appropriate role of early visual processing is to describe a scene in terms of intrinsic (vertical) characteristics -- such as range, orientation, reflectance, and incident illumination -- of the surface element visible at each point in the image."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2902049"
                        ],
                        "name": "Bruce G. Baumgart",
                        "slug": "Bruce-G.-Baumgart",
                        "structuredName": {
                            "firstName": "Bruce",
                            "lastName": "Baumgart",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Bruce G. Baumgart"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 12,
                                "start": 9
                            }
                        ],
                        "text": "Baumgart [8] and Lieberman [28] both used polyhedral representations of objects."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 167,
                                "start": 164
                            }
                        ],
                        "text": "MODITOR (a model editor) implemented originally by Harald Westphal and Amy Plikerd, and revised and significantly expanded by Soroka [44] provides a GEOMED----like [8] interactive interface, via keyboard and graphics display."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 58817445,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "dacb05677b4a25a06c77a080f7caa0baf5b7aef6",
            "isKey": false,
            "numCitedBy": 441,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : The main contribution of this thesis is the development of a three dimensional geometric modeling system for application to computer vision. In computer vision geometric models provide a goal for descriptive image analysis, an origin for verification image synthesis, and a context for spatial problem solving. Some of the design ideas presented have been implemented in two programs named GEOMED and CRE; the programs are demonstrated in situations involving camera motion relative to a static world."
            },
            "slug": "Geometric-modeling-for-computer-vision.-Baumgart",
            "title": {
                "fragments": [],
                "text": "Geometric modeling for computer vision."
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "In computer vision geometric models provide a goal for descriptive image analysis, an origin for verification image synthesis, and a context for spatial problem solving."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145313556"
                        ],
                        "name": "D. McDermott",
                        "slug": "D.-McDermott",
                        "structuredName": {
                            "firstName": "Drew",
                            "lastName": "McDermott",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. McDermott"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 15,
                                "start": 11
                            }
                        ],
                        "text": "McDermot t [35] describes a representational scheme for meteric relations between fairly unstructured objects in a planar map."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 9604597,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "744689eff7096c4c8bc292b9899f011b0cebf94b",
            "isKey": false,
            "numCitedBy": 20,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "Efficient and robust spatial reasoning requires that the properties of real space be taken seriously. One approach to doing this is to assimilate facts into a \"fuzzy map\" of the positions and orientations of the objects involved in those facts. Then many inferences about distances and directions may be made by \"just looking\" at the map, to determine bounds on quantities of interest. For flexibility, there must be many frames of reference with respect to which coordinates are measure. The resulting representation supports many tasks, including finding routes from one place to another."
            },
            "slug": "A-Theory-of-Metric-Spatial-Inference-McDermott",
            "title": {
                "fragments": [],
                "text": "A Theory of Metric Spatial Inference"
            },
            "tldr": {
                "abstractSimilarityScore": 50,
                "text": "This work assimilates facts into a \"fuzzy map\" of the positions and orientations of the objects involved in those facts, then many inferences about distances and directions may be made by \"just looking\" at the map, to determine bounds on quantities of interest."
            },
            "venue": {
                "fragments": [],
                "text": "AAAI"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1809809"
                        ],
                        "name": "L. Shapiro",
                        "slug": "L.-Shapiro",
                        "structuredName": {
                            "firstName": "Linda",
                            "lastName": "Shapiro",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Shapiro"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31631011"
                        ],
                        "name": "J. Moriarty",
                        "slug": "J.-Moriarty",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Moriarty",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Moriarty"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2084383"
                        ],
                        "name": "P. Mulgaonkar",
                        "slug": "P.-Mulgaonkar",
                        "structuredName": {
                            "firstName": "Prasanna",
                            "lastName": "Mulgaonkar",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Mulgaonkar"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1710238"
                        ],
                        "name": "R. Haralick",
                        "slug": "R.-Haralick",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Haralick",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Haralick"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14732426,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9e2c040f507b9bd81730d92e4036d7b52b717770",
            "isKey": false,
            "numCitedBy": 19,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper, we describe a relational modeling technique which categorizes three-dimensional objects at a gross level. These models may then be used to classify and recognize two dimensional views of the object, in a scene analysis system."
            },
            "slug": "Sticks,-Plates,-and-Blobs:-A-Three-Dimensional-for-Shapiro-Moriarty",
            "title": {
                "fragments": [],
                "text": "Sticks, Plates, and Blobs: A Three-Dimensional Object Representation for Scene Analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 89,
                "text": "A relational modeling technique is described which categorizes three-dimensional objects at a gross level and these models may then be used to classify and recognize two dimensional views of the object, in a scene analysis system."
            },
            "venue": {
                "fragments": [],
                "text": "AAAI"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1753394"
                        ],
                        "name": "D. Bobrow",
                        "slug": "D.-Bobrow",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Bobrow",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Bobrow"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1699245"
                        ],
                        "name": "T. Winograd",
                        "slug": "T.-Winograd",
                        "structuredName": {
                            "firstName": "Terry",
                            "lastName": "Winograd",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Winograd"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 24,
                                "start": 20
                            }
                        ],
                        "text": "In KIu:type systems [14], it is usual to describe allowed variations of a slot filler by attaching a description directly to the slot."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 178,
                                "start": 174
                            }
                        ],
                        "text": "ACRONYM'S volumetric representation is built around units of class object (a unit 's class is given by its class slot; this corresponds roughly to the self slot of KaL units [14])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 75,
                                "start": 71
                            }
                        ],
                        "text": "Units have a set of associated slots whose fillers define their values [14]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 7965074,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "033ecd544c4e71b14a7d3ee0611a300a20b91232",
            "isKey": true,
            "numCitedBy": 950,
            "numCiting": 75,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes KRL, a Knowledge Representation Language designed for use in understander systems. It outlines both the general concepts which underlie our research and the details of KRL-0, an experimental implementation of some of these concepts. KRL is an attempt to integrate procedural knowledge with a broad base of declarative forms. These forms provide a variety of ways to express the logical structure of the knowledge, in order to give flexibility in associating procedures (for memory and reasoning) with specific pieces of knowledge, and to control the relative accessibility of different facts and descriptions. The formalism for declarative knowledge is based on structured conceptual objects with associated descriptions. These objects form a network of memory units with several different sorts of linkages, each having well-specified implications for the retrieval process. Procedures can be associated directly with the internal structure of a conceptual object. This procedural attachment allows the steps for a particular operation to be determined by characteristics of the specific entities involved. The control structure of KRL is based on the belief that the next generation of intelligent programs will integrate data-directed and goal-directed processing by using multi-processing. It provides for a priority-ordered multi-process agenda with explicit (user-provided) strategies for scheduling and resource allocation. It provides procedure directories which operate along with process frameworks to allow procedural parameterization of the fundamental system processes for building, comparing, and retrieving memory structures. Future development of KRL will include integrating procedure definition with the descriptive formalism."
            },
            "slug": "On-Overview-of-KRL,-a-Knowledge-Representation-Bobrow-Winograd",
            "title": {
                "fragments": [],
                "text": "On Overview of KRL, a Knowledge Representation Language"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "KRL is an attempt to integrate procedural knowledge with a broad base of declarative forms to give flexibility in associating procedures with specific pieces of knowledge, and to control the relative accessibility of different facts and descriptions."
            },
            "venue": {
                "fragments": [],
                "text": "Cogn. Sci."
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31857045"
                        ],
                        "name": "E. Hildreth",
                        "slug": "E.-Hildreth",
                        "structuredName": {
                            "firstName": "Ellen",
                            "lastName": "Hildreth",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Hildreth"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 121,
                                "start": 109
                            }
                        ],
                        "text": "The idea is that higher level processes will make use of these rich descriptions to interpret the image (see [32, 33, 23] for instance)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 2150419,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "9009c9685754346deb93f316144a9da1f70ffcd8",
            "isKey": false,
            "numCitedBy": 7031,
            "numCiting": 62,
            "paperAbstract": {
                "fragments": [],
                "text": "A theory of edge detection is presented. The analysis proceeds in two parts. (1) Intensity changes, which occur in a natural image over a wide range of scales, are detected separately at different scales. An appropriate filter for this purpose at a given scale is found to be the second derivative of a Gaussian, and it is shown that, provided some simple conditions are satisfied, these primary filters need not be orientation-dependent. Thus, intensity changes at a given scale are best detected by finding the zero values of ∇2G(x, y)* I(x, y) for image I, where G(x, y) is a two-dimensional Gaussian distribution and ∇2 is the Laplacian. The intensity changes thus discovered in each of the channels are then represented by oriented primitives called zero-crossing segments, and evidence is given that this representation is complete. (2) Intensity changes in images arise from surface discontinuities or from reflectance or illumination boundaries, and these all have the property that they are spatially localized. Because of this, the zero-crossing segments from the different channels are not independent, and rules are deduced for combining them into a description of the image. This description is called the raw primal sketch. The theory explains several basic psychophysical findings, and the operation of forming oriented zero-crossing segments from the output of centre-surround ∇2G filters acting on the image forms the basis for a physiological model of simple cells (see Marr & Ullman 1979)."
            },
            "slug": "Theory-of-edge-detection-Marr-Hildreth",
            "title": {
                "fragments": [],
                "text": "Theory of edge detection"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The theory of edge detection explains several basic psychophysical findings, and the operation of forming oriented zero-crossing segments from the output of centre-surround ∇2G filters acting on the image forms the basis for a physiological model of simple cells."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2921595"
                        ],
                        "name": "L. Lieberman",
                        "slug": "L.-Lieberman",
                        "structuredName": {
                            "firstName": "Lawrence",
                            "lastName": "Lieberman",
                            "middleNames": [
                                "I."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Lieberman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60638044,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4f43f3d2c20320f5735385be37946f7b393ae9ac",
            "isKey": false,
            "numCitedBy": 28,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "Automatic computer analysis of images for recognition, inspection, and verification has advanced to the stage where it is feasible for many industrial applications. Industry has a need for productivity enhancements and there is a growing acceptance of other forms of computer controlled automation (such as the industrial robot). The state-of-the-art in image processing techniques, the reduced cost and size and higher reliability of image sensors, and the trend toward low-priced, yet high-performance micro- and mini-processors seems to indicate that the time is “ripe” for the introduction of complex vision tasks to industry. However, the problem in implementing computer vision tasks in the past has been one of programmability, that is, the need for skilled programmers to generate the analysis program for each new task."
            },
            "slug": "Model-Driven-Vision-for-Industrial-Automation-Lieberman",
            "title": {
                "fragments": [],
                "text": "Model-Driven Vision for Industrial Automation"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The state-of-the-art in image processing techniques, the reduced cost and size and higher reliability of image sensors, and the trend toward low-priced, yet high-performance micro- and mini-processors seems to indicate that the time is “ripe” for the introduction of complex vision tasks to industry."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2131067"
                        ],
                        "name": "B. Soroka",
                        "slug": "B.-Soroka",
                        "structuredName": {
                            "firstName": "Barry",
                            "lastName": "Soroka",
                            "middleNames": [
                                "Irvin"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Soroka"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 118334372,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "f78ee9ee28087c14fe9096e178affa74f17ada7e",
            "isKey": false,
            "numCitedBy": 12,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Understanding-objects-from-slices:-extracting-from-Soroka",
            "title": {
                "fragments": [],
                "text": "Understanding objects from slices: extracting generalised cylinder descriptions from serial sections."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1686505"
                        ],
                        "name": "Z. Manna",
                        "slug": "Z.-Manna",
                        "structuredName": {
                            "firstName": "Zohar",
                            "lastName": "Manna",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Z. Manna"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 12554879,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d163709460265aa4901ac41a2b903793ad24b3c2",
            "isKey": false,
            "numCitedBy": 107,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract Program synthesis is the construction of a computer program from given specifications. An automatic program synthesis system must combine reasoning and programming ability with a good deal of knowledge about the subject matter of the program. This ability and knowledge must be manifested both procedurally (by programs) and structurally (by choice of representation). We describe some of the reasoning and programming capabilities of a projected synthesis system. Special attention is paid to the introduction of conditional tests, loops, and instructions with side effects in the program being constructed. The ability to satisfy several interacting goals simultaneously proves to be important in many contexts. The modification of an already existing program to solve a somewhat different problem has been found to be a powerful approach. We illustrate these concepts with hand simulations of the synthesis of a number of pattern-matching programs. Some of these techniques have already been implemented, some are in the course of implementation, while others seem equivalent to well-known unsolved problems in artificial intelligence."
            },
            "slug": "Knowledge-and-Reasoning-in-Program-Synthesis-Manna",
            "title": {
                "fragments": [],
                "text": "Knowledge and Reasoning in Program Synthesis"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "Some of the reasoning and programming capabilities of a projected synthesis system are described and the modification of an already existing program to solve a somewhat different problem has been found to be a powerful approach."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1688682"
                        ],
                        "name": "R. Woodham",
                        "slug": "R.-Woodham",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Woodham",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Woodham"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 37888656,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "c0c92209bce97ba5efcf4c77771c7dab2a8502f1",
            "isKey": false,
            "numCitedBy": 11,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "Reflectance map techniques make explicit the relationship between image intensity and surface orientation. In general, however, trade-offs between image intensity and surface shape emerge which cannot be resolved in a single view. Existing methods for determining shape from a single view embody assumptions about surface curvature. The image Hessian matrix is introduced as a convenient viewer-centered representation of surface curvature. Properties of surface curvature are expressed as properties of the Hessian matrix. For several classes of surfaces, image analysis simplifies. This result has already been established for planar surfaces. Similar simplification is demonstrated for singly curved surfaces and for the subclass of doubly curved surfaces known as generalized cones. These studies help to delineate shape information that can be determined from object boundaries and shape information that can be determined from shading."
            },
            "slug": "Relating-Properties-of-Surface-Curvature-to-Image-Woodham",
            "title": {
                "fragments": [],
                "text": "Relating Properties of Surface Curvature to Image Intensity"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "For several classes of surfaces, image analysis simplifies and this result has already been established for planar surfaces and for the subclass of doubly curved surfaces known as generalized cones."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1722219"
                        ],
                        "name": "Y. Ohta",
                        "slug": "Y.-Ohta",
                        "structuredName": {
                            "firstName": "Yuichi",
                            "lastName": "Ohta",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Ohta"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1733113"
                        ],
                        "name": "T. Kanade",
                        "slug": "T.-Kanade",
                        "structuredName": {
                            "firstName": "Takeo",
                            "lastName": "Kanade",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Kanade"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46599154"
                        ],
                        "name": "T. Sakai",
                        "slug": "T.-Sakai",
                        "structuredName": {
                            "firstName": "Toshiyuki",
                            "lastName": "Sakai",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Sakai"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 4,
                                "start": 0
                            }
                        ],
                        "text": "[40] also model objects as image regions, but they include shape descriptions in two dimensions."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 607550,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f8daf137c1afa3eed312b76e4500c370cbb71c33",
            "isKey": false,
            "numCitedBy": 19,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Production system architectures are useful for knowledge representation. We have applied the architecture to image analysis in the framework of region growing and developed an outdoor-scene analyzer. In this paper, the following three problems are addressed to make production systems workable in scene analysis. 1) Appropriate size of knowledge represented in a. production rule. 2) Reduction of computation. 3) Control of the analysis toward goal."
            },
            "slug": "A-Production-System-for-Region-Analysis-Ohta-Kanade",
            "title": {
                "fragments": [],
                "text": "A Production System for Region Analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "The architecture of production system architectures applied to image analysis in the framework of region growing and developed an outdoor-scene analyzer to make production systems workable in scene analysis."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3379234"
                        ],
                        "name": "A. Fothergill",
                        "slug": "A.-Fothergill",
                        "structuredName": {
                            "firstName": "Ann",
                            "lastName": "Fothergill",
                            "middleNames": [
                                "Patricia"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Fothergill"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2507732"
                        ],
                        "name": "R. Popplestone",
                        "slug": "R.-Popplestone",
                        "structuredName": {
                            "firstName": "Robin",
                            "lastName": "Popplestone",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Popplestone"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 60,
                                "start": 57
                            }
                        ],
                        "text": "The geometric reasoning system of Ambler and Popplestone [3] collapses adjacent rotations sharing common axis expressions, and uses the special case of the above identities where a~ = ~, a2 = )3 and rn2 = ar to simplify geometric expressions."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 26,
                                "start": 23
                            }
                        ],
                        "text": "Ambler and Popplestone [3] assume they are given a description of a goal state of spatial relationships between a set of objects, such as 'against' and 'fits', and describe a system for determining the relative positions and orientations of objects which satisfy these relations."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 6691077,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "bec84044eb274aafa45f02ed59b5575a33107591",
            "isKey": false,
            "numCitedBy": 225,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Inferring-the-Positions-of-Bodies-from-Specified-Fothergill-Popplestone",
            "title": {
                "fragments": [],
                "text": "Inferring the Positions of Bodies from Specified Spatial Relationships"
            },
            "venue": {
                "fragments": [],
                "text": "Artif. Intell."
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2153307"
                        ],
                        "name": "R. Stallman",
                        "slug": "R.-Stallman",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Stallman",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Stallman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4018461"
                        ],
                        "name": "G. Sussman",
                        "slug": "G.-Sussman",
                        "structuredName": {
                            "firstName": "Gerald",
                            "lastName": "Sussman",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Sussman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 25,
                                "start": 21
                            }
                        ],
                        "text": "Stallman and Sussman [46] and de Kleer and Sussman [27] describe systems for analysis and synthesis of circuits respectively."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 207507204,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "54f35b4edba6ddee8ce2eac489bde78308e3e708",
            "isKey": false,
            "numCitedBy": 878,
            "numCiting": 44,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Forward-Reasoning-and-Dependency-Directed-in-a-for-Stallman-Sussman",
            "title": {
                "fragments": [],
                "text": "Forward Reasoning and Dependency-Directed Backtracking in a System for Computer-Aided Circuit Analysis"
            },
            "venue": {
                "fragments": [],
                "text": "Artif. Intell."
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1788375"
                        ],
                        "name": "D. Waltz",
                        "slug": "D.-Waltz",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Waltz",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Waltz"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 103,
                                "start": 99
                            }
                        ],
                        "text": "The algorithm used here is a variation on the constraint propagation algorithm introduced by Waltz [49], used for labelling line drawings."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 61975913,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "b3fba1e0774e98a4e0db83a3a0f0aeb18a8d052b",
            "isKey": false,
            "numCitedBy": 1233,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "A detailed discussion of the standard approach to computer interpretation of line drawings as three-dimensional scenes"
            },
            "slug": "Understanding-Line-drawings-of-Scenes-with-Shadows-Waltz",
            "title": {
                "fragments": [],
                "text": "Understanding Line drawings of Scenes with Shadows"
            },
            "tldr": {
                "abstractSimilarityScore": 78,
                "text": "A detailed discussion of the standard approach to computer interpretation of line drawings as three-dimensional scenes as well as some alternative approaches to this approach are discussed."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1388700951"
                        ],
                        "name": "Tomas Lozano-Perez",
                        "slug": "Tomas-Lozano-Perez",
                        "structuredName": {
                            "firstName": "Tomas",
                            "lastName": "Lozano-Perez",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tomas Lozano-Perez"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1977841"
                        ],
                        "name": "M. Wesley",
                        "slug": "M.-Wesley",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Wesley",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Wesley"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17397594,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "d9e3db556c5611f45182af845a5199701adb8cb6",
            "isKey": false,
            "numCitedBy": 2366,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes a collision avoidance algorithm for planning a safe path for a polyhedral object moving among known polyhedral objects. The algorithm transforms the obstacles so that they represent the locus of forbidden positions for an arbitrary reference point on the moving object. A trajectory of this reference point which avoids all forbidden regions is free of collisions. Trajectories are found by searching a network which indicates, for each vertex in the transformed obstacles, which other vertices can be reached safely."
            },
            "slug": "An-algorithm-for-planning-collision-free-paths-Lozano-Perez-Wesley",
            "title": {
                "fragments": [],
                "text": "An algorithm for planning collision-free paths among polyhedral obstacles"
            },
            "tldr": {
                "abstractSimilarityScore": 88,
                "text": "A collision avoidance algorithm for planning a safe path for a polyhedral object moving among known polyhedral objects that transforms the obstacles so that they represent the locus of forbidden positions for an arbitrary reference point on the moving object."
            },
            "venue": {
                "fragments": [],
                "text": "CACM"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3238472"
                        ],
                        "name": "J. Kleer",
                        "slug": "J.-Kleer",
                        "structuredName": {
                            "firstName": "Johan",
                            "lastName": "Kleer",
                            "middleNames": [
                                "de"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Kleer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4018461"
                        ],
                        "name": "G. Sussman",
                        "slug": "G.-Sussman",
                        "structuredName": {
                            "firstName": "Gerald",
                            "lastName": "Sussman",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Sussman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 25,
                                "start": 21
                            }
                        ],
                        "text": "De Kleer and Sussman [27] describe their experience with an algebraic simplification system which mapped all algebraically equivalent expressions into a canonical form as the ratio of two relatively prime multivariate polynomials."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 55,
                                "start": 51
                            }
                        ],
                        "text": "Stallman and Sussman [46] and de Kleer and Sussman [27] describe systems for analysis and synthesis of circuits respectively."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 55,
                                "start": 51
                            }
                        ],
                        "text": "Similar arguments to those of de Kleer and Sussman [27] apply to this case also."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                }
            ],
            "corpusId": 14455290,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "94645dd1765c274d1e61849580a2677ea0063cbe",
            "isKey": false,
            "numCitedBy": 107,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "A major component in the process of design is synthesis, the determination of the parameters of the parts of a network given desiderata for the behaviour of the network as a whole. Traditional automated synthesis techniques are either restricted to small, precisely defined classes of circuit functions for which exact mathematical methods exist or they depend upon numerical optimization methods in which it is difficult to determine the basis for any of the answers generated and their relations to the design desiderata and constraints. We are developing a symbolic computer-aided design tool, SYN, which can be of assistance to an engineer in the synthesis of a large class of circuits. The symbolic methods produce solutions which are clear and insightful. The dependence of each parameter on the individual design desiderata and circuit constraints can be easily traced."
            },
            "slug": "Propagation-of-constraints-applied-to-circuit-Kleer-Sussman",
            "title": {
                "fragments": [],
                "text": "Propagation of constraints applied to circuit synthesis"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "A symbolic computer-aided design tool, SYN, which can be of assistance to an engineer in the synthesis of a large class of circuits and whose symbolic methods produce solutions which are clear and insightful."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34575691"
                        ],
                        "name": "R. Goldman",
                        "slug": "R.-Goldman",
                        "structuredName": {
                            "firstName": "Ron",
                            "lastName": "Goldman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Goldman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 59,
                                "start": 55
                            }
                        ],
                        "text": "Currently the system can be driven by the output of AL [22], which is normally used to drive manipulator arms directly."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 2308886,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a5f3cec34a878704467e3eca8ef608bafa1aa676",
            "isKey": false,
            "numCitedBy": 7,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "A first level implementation of AL, a high-level programming system for manipulator control, has been completed and is now in operation. Several new modules have been added to the system including: POINTY an interactive system for specifying representation of parts, and ALAID an interactive debugger for AL. Recent work in vision has been incorporated into the AL system. This paper describes the present implementation of AL and discusses current work."
            },
            "slug": "Recent-Work-with-the-AL-System-Goldman",
            "title": {
                "fragments": [],
                "text": "Recent Work with the AL System"
            },
            "tldr": {
                "abstractSimilarityScore": 99,
                "text": "A first level implementation of AL, a high-level programming system for manipulator control, has been completed and is now in operation and several new modules have been added to the system including: POINTY an interactive system for specifying representation of parts, and ALAID an interactive debugger for AL."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1748956"
                        ],
                        "name": "R. Fikes",
                        "slug": "R.-Fikes",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Fikes",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Fikes"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 10,
                                "start": 6
                            }
                        ],
                        "text": "Fikes [20] developed a heuristic problem-solving program, where problems were described to the system in a nondeterministic programming language."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 37842974,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b257a667c59cb5b5f3dac5339b727b3c126b123a",
            "isKey": false,
            "numCitedBy": 144,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "REF-ARF:-A-System-for-Solving-Problems-Stated-as-Fikes",
            "title": {
                "fragments": [],
                "text": "REF-ARF: A System for Solving Problems Stated as Procedures"
            },
            "venue": {
                "fragments": [],
                "text": "Artif. Intell."
            },
            "year": 1970
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144862591"
                        ],
                        "name": "R. Nevatia",
                        "slug": "R.-Nevatia",
                        "structuredName": {
                            "firstName": "Rainakant",
                            "lastName": "Nevatia",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Nevatia"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2058907839"
                        ],
                        "name": "K. R. Babu",
                        "slug": "K.-R.-Babu",
                        "structuredName": {
                            "firstName": "K.",
                            "lastName": "Babu",
                            "middleNames": [
                                "Ramesh"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. R. Babu"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 86,
                                "start": 82
                            }
                        ],
                        "text": "If edges associated with the two ends of a ribbon are observed by the line finder [38], then the edge linking algorithm will probably hypothesize a ribbon, despite possible interference in the middle sections."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 53,
                                "start": 49
                            }
                        ],
                        "text": "2a are the 692 edges found by Nevatia and Babu's [38] line finder in an 8 bit aerial image taken from above San Francisco airport."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 114,
                                "start": 110
                            }
                        ],
                        "text": "In our current implementation we use the results of images processed with the line finder of Nevatia and Babu [38]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 6267220,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "813ec6596b5e5c78c542f1df8133d9d743eb8496",
            "isKey": true,
            "numCitedBy": 746,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Linear-Feature-Extraction-and-Description-Nevatia-Babu",
            "title": {
                "fragments": [],
                "text": "Linear Feature Extraction and Description"
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2988782"
                        ],
                        "name": "D. Grossman",
                        "slug": "D.-Grossman",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Grossman",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Grossman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 13,
                                "start": 9
                            }
                        ],
                        "text": "Grossman [24] has approached tolerancing by generating a large number of instances of models, using a random number generator to produce varying dimensions of objects within prescribed bounds and distributions."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 110682148,
            "fieldsOfStudy": [
                "Business"
            ],
            "id": "05efc522918a3ad917a7979febfb1462f8392aec",
            "isKey": false,
            "numCitedBy": 15,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The assembly of discrete parts is strongly affected by imprecise components, imperfect fixtures and tools, and inexact measurements. It is often necessary to design higher precision into the manufacturing and assembly process than is functionally needed in the final product. Production engineers must trade off between alternative ways of selecting individual tolerances in order to achieve minimum cost while preserving product integrity. This paper describes a comprehensive Monte Carlo method for systematically analysing the stochastic implications of tolerancing and related forms of imprecision. The method is illustrated by four examples, one of which is chosen from the field of assembly by computer controlled manipulators."
            },
            "slug": "Monte-Carlo-simulation-of-tolerancing-in-discrete-Grossman",
            "title": {
                "fragments": [],
                "text": "Monte Carlo simulation of tolerancing in discrete parts manufacturing and assembly"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1388700951"
                        ],
                        "name": "Tomas Lozano-Perez",
                        "slug": "Tomas-Lozano-Perez",
                        "structuredName": {
                            "firstName": "Tomas",
                            "lastName": "Lozano-Perez",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tomas Lozano-Perez"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 17,
                                "start": 13
                            }
                        ],
                        "text": "Lozano-Prrez [30] attacks a similar problem, but with more restrictions on"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 60688333,
            "fieldsOfStudy": [
                "Materials Science"
            ],
            "id": "0edffe4e3a6dccc66bb53a9a07039000c613dc63",
            "isKey": false,
            "numCitedBy": 132,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : This thesis describes a mechanical assembly system called LAMA. The goal of the work was to create a mechanical assembly system that transforms a high-level description of an automatic assembly operation into a program for execution by a computer-controlled manipulator. This system allows the initial description of the assembly to be in terms of the desired effects on the parts being assembled. (Author)"
            },
            "slug": "The-Design-of-a-Mechanical-Assembly-System-Lozano-Perez",
            "title": {
                "fragments": [],
                "text": "The Design of a Mechanical Assembly System"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "A mechanical assembly system that transforms a high-level description of an automatic assembly operation into a program for execution by a computer-controlled manipulator is described."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144289854"
                        ],
                        "name": "W. Bledsoe",
                        "slug": "W.-Bledsoe",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Bledsoe",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Bledsoe"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 70,
                                "start": 62
                            }
                        ],
                        "text": "This is the 'SUP-INF' method, developed originally by Bledsoe [11, 12] and later improved by Shostak [42]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 118432333,
            "fieldsOfStudy": [
                "Mathematics",
                "Computer Science"
            ],
            "id": "a64a3c7095ba432918555868b5c4e5e2accae8f4",
            "isKey": false,
            "numCitedBy": 67,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes a new method for determining the validity of certain formulas from Presburger Arithmetic, namely those with only universally quantified variables. To do this the notion of a Presburger formula, is generalized slightly to that of a quasi-linear formula. \n \nThis so called \"sup-inf\" method seems particularly suited for proving certain verification conditions that arise from program validation, especially those in which \"proof by cases\" is required. It also eliminates the need for proof by enumeration, inherent in some methods described earlier In the literature, which sometimes require a search through a large number of consecutive Integers. \n \nThese algorithms have been programmed and used extensively as a part of an automatic theorem proving system."
            },
            "slug": "A-new-method-for-proving-certain-Presburger-Bledsoe",
            "title": {
                "fragments": [],
                "text": "A new method for proving certain Presburger formulas"
            },
            "tldr": {
                "abstractSimilarityScore": 72,
                "text": "A new method for determining the validity of certain formulas from Presburger Arithmetic, namely those with only universally quantified variables, are described, which seems particularly suited for proving certain verification conditions that arise from program validation."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI 1975"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143981586"
                        ],
                        "name": "A. Borning",
                        "slug": "A.-Borning",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Borning",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Borning"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 12,
                                "start": 8
                            }
                        ],
                        "text": "Borning [15] describes an interactive environment for building simulations of"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 146083013,
            "fieldsOfStudy": [
                "Economics"
            ],
            "id": "8607c0f26afef4de30e14996245dd6649baacf49",
            "isKey": false,
            "numCitedBy": 359,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "A normally-deflated, readily-flexible, inflatable pad which underlies a bed patient can be inflated to raise that bed patient and to gently but firmly hold that bed patient in raised position. When that inflatable pad is inflated, it defines a recess at the lower surface of the center thereof into which the supporting surface of a portable support can be moved; and that inflatable pad and that portable support can thereafter hold the bed patient at a desired level relative to the bed on which that inflatable bed normally rests. When the supporting surface of the portable support subsequently is removed from the recess at the lower surface of the center of the inflatable bed, that inflatable pad can be deflated to lower the bed patient. A pressure transducer, between the supporting surface and the carrier therefor, develops a signal while that supporting surface underlies and holds the inflatable pad and the bed patient; and a readout responds to that signal to indicate the weight of that bed patient."
            },
            "slug": "Thinglab--a-constraint-oriented-simulation-Borning",
            "title": {
                "fragments": [],
                "text": "Thinglab--a constraint-oriented simulation laboratory."
            },
            "tldr": {
                "abstractSimilarityScore": 99,
                "text": "A normally-deflated, readily-flexible, inflatable pad which underlies a bed patient can be inflated to raise that bed patient and to gently but firmly hold that bed patients in raised position."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2060896"
                        ],
                        "name": "P. Winston",
                        "slug": "P.-Winston",
                        "structuredName": {
                            "firstName": "Patrick",
                            "lastName": "Winston",
                            "middleNames": [
                                "Henry"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Winston"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 11,
                                "start": 7
                            }
                        ],
                        "text": "Wiston [50] has shown how to infer object classes over variations in both size and structure from examples and non-examples of objects."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 106617047,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "a7eb50210a468d0878666e8f82fb55f2b179f802",
            "isKey": false,
            "numCitedBy": 1208,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Massachusetts Institute of Technology. Dept. of Electrical Engineering. Thesis. 1970. Ph.D."
            },
            "slug": "Learning-Structural-Descriptions-From-Examples-Winston",
            "title": {
                "fragments": [],
                "text": "Learning Structural Descriptions From Examples"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1970
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1959166"
                        ],
                        "name": "R. Shostak",
                        "slug": "R.-Shostak",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Shostak",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Shostak"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 29,
                                "start": 25
                            }
                        ],
                        "text": "Bledsoe [11] and Shostak [42] proved a number of properties of the algorithms SUP and INF for sets of linear constraints and linear expressions to"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 99,
                                "start": 95
                            }
                        ],
                        "text": "These definitions of UPPER and L O W E R closely follow those used by Bledsoe l11] and Shostak [42]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 103,
                                "start": 99
                            }
                        ],
                        "text": "Algorithms SUP, INF, SUPP and INFF are extensions to algorithms of the same names given by Shostak [42]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 105,
                                "start": 101
                            }
                        ],
                        "text": "This is the 'SUP-INF' method, developed originally by Bledsoe [11, 12] and later improved by Shostak [42]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 55,
                                "start": 51
                            }
                        ],
                        "text": "Algorithms SUPP and INFF are identical to those of [42], except that they can take more complex arguments, in which case they invoke SUPPP and INFFF respectively."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 12,
                                "start": 8
                            }
                        ],
                        "text": "Shostak [42] gives an example of a linear constraint set and a linear expression to bound where it"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 16778115,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "7f786163998ed90dab749a6875ea6079a720596d",
            "isKey": true,
            "numCitedBy": 139,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "This article presents an improved version of Bledsoe's SUP-INF method for proving theorems in a subclass of Presburger ari thmetic The improved method is able to determine mvahdRy as well as vahdlty, and provides counterexamples for formulas determined to be mvahd A proof of correctness is given for the algorithms on which the method is based Implementat ion results are discussed, as is an apphcation to linear programming"
            },
            "slug": "On-the-SUP-INF-Method-for-Proving-Presburger-Shostak",
            "title": {
                "fragments": [],
                "text": "On the SUP-INF Method for Proving Presburger Formulas"
            },
            "tldr": {
                "abstractSimilarityScore": 84,
                "text": "An improved version of Bledsoe's SUP-INF method for proving theorems in a subclass of Presburger ari thmetic is presented, able to determine mvahdRy as well as vahdlty, and provides counterexamples for formulas determined to be mvAHd."
            },
            "venue": {
                "fragments": [],
                "text": "JACM"
            },
            "year": 1977
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 12,
                                "start": 8
                            }
                        ],
                        "text": "Bledsoe [11] and Shostak [42] proved a number of properties of the algorithms SUP and INF for sets of linear constraints and linear expressions to"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 62,
                                "start": 58
                            }
                        ],
                        "text": "We can extend the proofs of (P1) and (P2) (due to Bledsoe [11]) to our extended algorithms."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 103,
                                "start": 99
                            }
                        ],
                        "text": "That SUP and INF bound their first argument is a straightforward extension of the proof of Bledsoe [11]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 65,
                                "start": 61
                            }
                        ],
                        "text": "The proof that SUP and INF terminate follows that of Bledsoe [11], and all but steps 9."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 70,
                                "start": 62
                            }
                        ],
                        "text": "This is the 'SUP-INF' method, developed originally by Bledsoe [11, 12] and later improved by Shostak [42]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 46,
                                "start": 42
                            }
                        ],
                        "text": "This follows the notation used by Bledsoe [11] to describe the first version of these procedures."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The sup--inf method in Presburger arithmetic, Memo ATP"
            },
            "venue": {
                "fragments": [],
                "text": "Dept. of Math. and Comp. Sei.,"
            },
            "year": 1974
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 76,
                                "start": 72
                            }
                        ],
                        "text": "There are large errors in results of the feature description algorithms [17], and instead of an exact measurement m the algorithms provide estimates on ly- -a closed error interval, [mi, m,] say, on image feature parameters."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 64,
                                "start": 60
                            }
                        ],
                        "text": "They are used to direct the low level descriptive processes [17], which search the image for candidate shapes to be matched to predictions."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 54,
                                "start": 50
                            }
                        ],
                        "text": "The descriptive module consists of two algorithms [17]: first an edge linking algorithm based on best-first search, and second an algorithm to fit ribbons and ellipses to sets of linked edges."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 73,
                                "start": 69
                            }
                        ],
                        "text": "Prediction nodes provide goal-direction to an edge linking algorithm [17] which produces descriptions of shape elements found."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 43,
                                "start": 39
                            }
                        ],
                        "text": "The current descriptive processes used [17], partially take care of this problem in a fairly undirected manner."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 24,
                                "start": 20
                            }
                        ],
                        "text": "In an earlier paper [17] we proposed that the user should include such information explicitly in the geometric models."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Goal-directed edge linking and ribbon finding"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings ARPA Image Understanding Workshop,"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2739823"
                        ],
                        "name": "T. Garvey",
                        "slug": "T.-Garvey",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Garvey",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Garvey"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 71,
                                "start": 67
                            }
                        ],
                        "text": "Msvs [6] models objects as usually homogeneous image regions, isis [21] includes brightness, hue and saturation of image regions in its object models which are constrained to meet viewpoint-dependent spatial relations."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 140954692,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "f4de24cd8f09e3ae1d0ccfa4ab3b933f9cdbcea4",
            "isKey": false,
            "numCitedBy": 134,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Perceptual-strategies-for-purposive-vision-Garvey",
            "title": {
                "fragments": [],
                "text": "Perceptual strategies for purposive vision"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1691087"
                        ],
                        "name": "J. Hollerbach",
                        "slug": "J.-Hollerbach",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Hollerbach",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Hollerbach"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 124,
                                "start": 108
                            }
                        ],
                        "text": "language for descriptive processes working from range data [2, 39, 43] and for modelling systems for vision [25, 32, 34, 37]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 119030960,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "778dac9d5f1a52a1d1cf7c01f9e5354e6cb2ec82",
            "isKey": false,
            "numCitedBy": 52,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Hierarchical-Shape-Description-of-Objects-by-and-of-Hollerbach",
            "title": {
                "fragments": [],
                "text": "Hierarchical Shape Description of Objects by Selection and Modification of Prototypes"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1719838"
                        ],
                        "name": "W. Grimson",
                        "slug": "W.-Grimson",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Grimson",
                            "middleNames": [
                                "Eric",
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Grimson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 121,
                                "start": 109
                            }
                        ],
                        "text": "The idea is that higher level processes will make use of these rich descriptions to interpret the image (see [32, 33, 23] for instance)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 64195740,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "34e5f81517fbb94af82422ce2f160c8bf4ee23b7",
            "isKey": false,
            "numCitedBy": 12,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-Computational-Theory-of-Stereo-Vision-Grimson",
            "title": {
                "fragments": [],
                "text": "A Computational Theory of Stereo Vision"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1684883"
                        ],
                        "name": "R. Taylor",
                        "slug": "R.-Taylor",
                        "structuredName": {
                            "firstName": "Russell",
                            "lastName": "Taylor",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Taylor"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 11,
                                "start": 7
                            }
                        ],
                        "text": "Taylor [48] tackles a problem similar to ours."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 22,
                                "start": 18
                            }
                        ],
                        "text": "Thus while Taylor [48] was interested in linearizing expressions so they could be handled with the simplex method, we are interested in approximating expressions with simpler expressions, with fewer symbols and perhaps free of non-monotonic subexpressions."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 60664691,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "76292b10064c207050c39792a43d90fb3b66784f",
            "isKey": false,
            "numCitedBy": 175,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-synthesis-of-manipulator-control-programs-from-Taylor",
            "title": {
                "fragments": [],
                "text": "The synthesis of manipulator control programs from task-level specifications."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143814637"
                        ],
                        "name": "Berthold K. P. Horn",
                        "slug": "Berthold-K.-P.-Horn",
                        "structuredName": {
                            "firstName": "Berthold",
                            "lastName": "Horn",
                            "middleNames": [
                                "K.",
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Berthold K. P. Horn"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60564345,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6ccf4b4091cf63c78626808027c549f7e3322b0c",
            "isKey": false,
            "numCitedBy": 734,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Obtaining-shape-from-shading-information-Horn",
            "title": {
                "fragments": [],
                "text": "Obtaining shape from shading information"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2094462"
                        ],
                        "name": "I. Braid",
                        "slug": "I.-Braid",
                        "structuredName": {
                            "firstName": "I.",
                            "lastName": "Braid",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Braid"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 48,
                                "start": 44
                            }
                        ],
                        "text": "both the PADL system [45] and that of Braid [16] meet these requirements; see also the survey [4])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 60140678,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "444a9a21a5bc0e48fa2a819e881c435bf4fe65c1",
            "isKey": false,
            "numCitedBy": 110,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Designing-with-volumes-Braid",
            "title": {
                "fragments": [],
                "text": "Designing with volumes"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1753394"
                        ],
                        "name": "D. Bobrow",
                        "slug": "D.-Bobrow",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Bobrow",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Bobrow"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 11,
                                "start": 7
                            }
                        ],
                        "text": "Bobrow [13] used algebraic problems stated in English as a domain for an early natural language understanding system."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 56584838,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9fc77941297522cc420ce9292193dd04ed2ed1af",
            "isKey": false,
            "numCitedBy": 326,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Natural-Language-Input-for-a-Computer-Problem-Bobrow",
            "title": {
                "fragments": [],
                "text": "Natural Language Input for a Computer Problem Solving System"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1964
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 133,
                                "start": 130
                            }
                        ],
                        "text": "We plan to later include other low level descriptive processes, such as the stereo work underway within the Stanford vision group [5]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Edge based stereo correlation"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings ARPA Image Understanding Workshop,"
            },
            "year": 1980
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 148,
                                "start": 144
                            }
                        ],
                        "text": "In our work on aerial images we have made extensive use of models of the generic classes of airports and wide-bodied passenger/et aircraft (see [19] for details)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Representing and reasoning about partially specified scenes"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings ARPA Image Understanding Workshop,"
            },
            "year": 1980
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 76,
                                "start": 72
                            }
                        ],
                        "text": "This is similar to the notion of a memo function as described by Michie [36]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Memo functions: A language feature with rote-learning properties"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings IFIP,"
            },
            "year": 1968
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 22,
                                "start": 18
                            }
                        ],
                        "text": "The system, GRASP [10], was given ACRONYM models of simple objects, from which it automatically deduced positions and orientations which could be grasped by a manipulator arm, and which would provide a firm stable grip on the object."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Computer integrated assembly systems"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings NSF Grantees Conference on Industrial Automation,"
            },
            "year": 1979
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 124,
                                "start": 108
                            }
                        ],
                        "text": "language for descriptive processes working from range data [2, 39, 43] and for modelling systems for vision [25, 32, 34, 37]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Display generated by a generalized cone representation"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Conference on Computer Graphics and Image Processing,"
            },
            "year": 1975
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 70,
                                "start": 59
                            }
                        ],
                        "text": "language for descriptive processes working from range data [2, 39, 43] and for modelling systems for vision [25, 32, 34, 37]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Extracting generalised cylinder descriptions from serial sections, Tech"
            },
            "venue": {
                "fragments": [],
                "text": "Rept. TR-79-1, Dept. of Computer Science, University of Kansas, Lawrence"
            },
            "year": 1979
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 8,
                                "start": 5
                            }
                        ],
                        "text": "Msvs [6] models objects as usually homogeneous image regions, isis [21] includes brightness, hue and saturation of image regions in its object models which are constrained to meet viewpoint-dependent spatial relations."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A system for reasoning about scenes, SRI AI Center, Tech"
            },
            "venue": {
                "fragments": [],
                "text": "Note 121"
            },
            "year": 1976
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 3,
                                "start": 0
                            }
                        ],
                        "text": "[1] describe a manufacturing situation where approximately 450 different styles of motors are manufactured with an average batch size of 600 and a number of style changes each day."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 142,
                                "start": 139
                            }
                        ],
                        "text": "Additional constraints specialize the subclasses of electric motors further to particular functional classes (these classes are taken from [1]), namely industrial-motor, carbonator-motor and gas-pump."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Programmable assembly research technology:  Transfer to industry, 4th Bi-Monthly Report, NSF Grant ISP 76-2416,1"
            },
            "venue": {
                "fragments": [],
                "text": "Westinghouse R&D Center,"
            },
            "year": 1977
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 97,
                                "start": 94
                            }
                        ],
                        "text": "both the PADL system [45] and that of Braid [16] meet these requirements; see also the survey [4])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A survey of geometric modeling, CMU Institute of Physical Planning"
            },
            "venue": {
                "fragments": [],
                "text": "Research Rept. No"
            },
            "year": 1977
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 20,
                                "start": 16
                            }
                        ],
                        "text": "The PADL system [45] allows the user to supply tolerances for object models, as described above."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 20,
                                "start": 16
                            }
                        ],
                        "text": "The PADL system [45] seems to be the only other geometric modelling system which allows detailed geometric models with quantifiable variations."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 25,
                                "start": 21
                            }
                        ],
                        "text": "both the PADL system [45] and that of Braid [16] meet these requirements; see also the survey [4])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "characteristics, status, and rationale, Production Automation Project, Tech"
            },
            "venue": {
                "fragments": [],
                "text": "Merao TM-22, University of Rochester, Rochester"
            },
            "year": 1974
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 16,
                                "start": 12
                            }
                        ],
                        "text": "A procedure [29] has been demonstrated which determines certain model parameters (slot values rather than quantifiers) numerically by an iterative technique once good matches have been established."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Solving for the parameters of object models from image descriptions"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings ARPA Image Understanding Workshop,"
            },
            "year": 1980
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 14,
                                "start": 10
                            }
                        ],
                        "text": "Soroka 's [44] simulator is based on these representations."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 137,
                                "start": 133
                            }
                        ],
                        "text": "MODITOR (a model editor) implemented originally by Harald Westphal and Amy Plikerd, and revised and significantly expanded by Soroka [44] provides a GEOMED----like [8] interactive interface, via keyboard and graphics display."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 11,
                                "start": 7
                            }
                        ],
                        "text": "Soroka [44] has built SIMULATOR on top of ACRONYM."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Debugging manipulator programs with a simulator, to be present at CAD/CAM"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 21,
                                "start": 18
                            }
                        ],
                        "text": "Generalized cones [9] provide a compact, viewpoint-independent representation of volume elements."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 160,
                                "start": 157
                            }
                        ],
                        "text": "By that we mean that for a given generalized cone the spine (the x-axis of its coordinate system)l ies along an axis of generalized translational invariance [9], and that if the cross section has an axis of generalized symmetry, then that corresponds to one of the other coordinate axes of the cone's coordinate system."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Visual perception by computer, invited paper at IEEE Systems"
            },
            "venue": {
                "fragments": [],
                "text": "Science and Cybernetics Conference,"
            },
            "year": 1971
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 32,
            "methodology": 20,
            "result": 2
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 54,
        "totalPages": 6
    },
    "page_url": "https://www.semanticscholar.org/paper/Symbolic-Reasoning-Among-3-D-Models-and-2-D-Images-Brooks/b8831f3095686131a98731d6806abdc75c6baebd?sort=total-citations"
}