{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1737754"
                        ],
                        "name": "J. Siskind",
                        "slug": "J.-Siskind",
                        "structuredName": {
                            "firstName": "Jeffrey",
                            "lastName": "Siskind",
                            "middleNames": [
                                "Mark"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Siskind"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Thus, in more recent work ( Siskind, 1993a, b), I have adopted a sequential approach that is more aligned with the semantic bootstrapping hypothesis."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 9652401,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "5e6b9e0ac7b587404b860e8d22c8bfb964c4c883",
            "isKey": false,
            "numCitedBy": 11,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper we present a computational study of lexical acquisition. We attempt to characterize the lexical acquisition task faced by children by defining a simplified formal approximation of this task which we term the mapping problem. We then present a novel strategy for solving large instances of this mapping problem. This strategy is capable of learning the word-to-meaning mappings for as many as 10,000 words given corpora of 20,000 utterances. Such lexical acquisition is accomplished in a language independent fashion without any reference to the syntax of the language being learned. Comments University of Pennsylvania Institute for Research in Cognitive Science Technical Report No. IRCS-93-41. This technical report is available at ScholarlyCommons: https://repository.upenn.edu/ircs_reports/190"
            },
            "slug": "Lexical-Acquisition-as-Constraint-Satisfaction-Siskind",
            "title": {
                "fragments": [],
                "text": "Lexical Acquisition as Constraint Satisfaction"
            },
            "tldr": {
                "abstractSimilarityScore": 38,
                "text": "A novel strategy is presented that is capable of learning the word-to-meaning mappings for as many as 10,000 words given corpora of 20,000 utterances and is accomplished in a language independent fashion without any reference to the syntax of the language being learned."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1737754"
                        ],
                        "name": "J. Siskind",
                        "slug": "J.-Siskind",
                        "structuredName": {
                            "firstName": "Jeffrey",
                            "lastName": "Siskind",
                            "middleNames": [
                                "Mark"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Siskind"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1119146,
            "fieldsOfStudy": [
                "Linguistics",
                "Computer Science"
            ],
            "id": "81695b24756f833465f8029be408e7ffead4586e",
            "isKey": false,
            "numCitedBy": 29,
            "numCiting": 50,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes an operational system which can acquire the core meanings of words without any prior knowledge of either the category or meaning of any words it encounters. The system is given as input, a description of sequences of scenes along with sentences which describe the [EVENTS] taking place as those scenes unfold, and produces as output, a lexicon consisting of the category and meaning of each word in the input, that allows the sentences to describe the [EVENTS]. It is argued, that each of the three main components of the system, the parser, the linker and the inference component, make only linguistically and cognitively plausible assumptions about the innate knowledge needed to support tractable learning. The paper discusses the theory underlying the system, the representations and algorithms used in the implementation, the semantic constraints which support the heuristics necessary to achieve tractable learning, the limitations of the current theory and the implications of this work for language acquisition research."
            },
            "slug": "Acquiring-Core-Meanings-of-Words,-Represented-as-of-Siskind",
            "title": {
                "fragments": [],
                "text": "Acquiring Core Meanings of Words, Represented as Jackendoff-Style Conceptual Structures, from Correlated Streams of Linguistic and Non-Linguistic Input"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The theory underlying the system, the representations and algorithms used in the implementation, the semantic constraints which support the heuristics necessary to achieve tractable learning, the limitations of the current theory and the implications of this work for language acquisition research are discussed."
            },
            "venue": {
                "fragments": [],
                "text": "ACL"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2067160148"
                        ],
                        "name": "T. Regier",
                        "slug": "T.-Regier",
                        "structuredName": {
                            "firstName": "Terry",
                            "lastName": "Regier",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Regier"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 53881542,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "da10722657dfa1bbaba853ec1d61a463f342a1ea",
            "isKey": false,
            "numCitedBy": 85,
            "numCiting": 172,
            "paperAbstract": {
                "fragments": [],
                "text": "This thesis describes a connectionist model which learns to perceive spatial events and relations in simple movies of 2-dimensional objects, so as to name the events and relations as a speaker of a particular natural language would. Thus, the model learns perceptually grounded semantics for natural language spatial terms. \nNatural languages differ--sometimes dramatically--in the ways in which they structure space. The aim here has been to have the model be able to perform this learning task for terms from any natural language, and to have learning take place in the absence of explicit negative evidence, in order to rule out ad hoc solutions and to approximate the conditions under which children learn. \nThe central focus of this thesis is a connectionist system which has succeeded in learning spatial terms from a number of different languages. The design and construction of this system have resulted in several technical contributions. The first is a very simple but effective means of learning without explicit negative evidence, taking positive instances of other concepts as implicit negative instances of the concept being learned, and deliberately weakening the evidence from these implicit negatives so as to reduce the effect of false implicit negatives in cases where concepts overlap. This method is shown to be effective even in situations involving a high degree of overlap among concepts. In addition, this thesis presents the notion of partially-structured connectionism, a marriage of structured and unstructured network design techniques capturing the flexibility afforded by unstructured networks, and the tractability in learning and improved generalization ability that result from highly structured network design. Finally, the idea of learning within highly specialized structural devices is introduced, with the purpose of restricting the search during learning to a set of options known in advance to be of possible relevance. \nScientifically, the primary result of the work described here is a computational model of the acquisition of visually grounded semantics. This model is shown to successfully learn terms for spatial events and relations from a range of languages with widely differing spatial systems, including English, Mixtec (a Mexican Indian language), German, Bengali, and Russian. The model exhibits prototype effects which roughly match human intuitions, and extensions to the core system model the linguistic phenomena of polysemy and deixis. While no claims are made regarding structure-to-structure correspondences between architectural elements of the model and structures in the brain, the model is informed by a number of neuroscientific results. And perhaps most importantly, the model does more than just recapitulate the data; it also generates a number of falsifiable linguistic predictions regarding the sorts of semantic features, and combinations of features, one might expect to find in lexemes for spatial events and relations in the world's natural languages."
            },
            "slug": "The-acquisition-of-lexical-semantics-for-spatial-a-Regier",
            "title": {
                "fragments": [],
                "text": "The acquisition of lexical semantics for spatial terms: a connectionist model of perceptual categorization"
            },
            "tldr": {
                "abstractSimilarityScore": 96,
                "text": "This thesis describes a connectionist model which learns to perceive spatial events and relations in simple movies of 2-dimensional objects, so as to name the events and Relations as a speaker of a particular natural language would, and learns perceptually grounded semantics for natural language spatial terms."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1737754"
                        ],
                        "name": "J. Siskind",
                        "slug": "J.-Siskind",
                        "structuredName": {
                            "firstName": "Jeffrey",
                            "lastName": "Siskind",
                            "middleNames": [
                                "Mark"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Siskind"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18117681,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "e20dc3e8ce9ba1906409bb90c423f2c69475ef48",
            "isKey": false,
            "numCitedBy": 92,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "How do children learn the language-specific components of their native language? How is language grounded in perception? Knowledge of the meanings of utterances containing unknown words presumably aids children in the process of determining their meanings. A complete account of such a process must ultimately explain how children extract utterance meanings from their non-linguistic context. Algorithms are presented which utilize a cross-situational learning strategy whereby the learner finds a language model which is consistent across several utterances paired with their non-linguistic context. This allows the learner to acquire partial knowledge from ambiguous situations and combine it across situations to infer a unique language model. M scAIMRA learns word-to-meaning and word-to-category mappings from a corpus pairing utterances with sets of expressions representing the potential meanings of those utterances hypothesized by the learner from the non-linguistic context. M scAIMRA's syntactic theory is embodied in a fixed context-free grammar. D scAVRA extends M scAIMRA by replacing the context-free grammar with a parameterized variant of X theory. K scENUNIA incorporates a more comprehensive model of universal grammar supporting movement, adjunction, and empty categories, as well as more extensive parameterization of its X theory component. \nI advance three claims about event perception and the process of grounding language in visual perception. Notions of support, contact, and attachment play a central role in defining the meanings of simple spatial motion verbs in a way that delineates prototypical occurrences of events described by those verbs from non-occurrences. Support, contact, and attachment relations between objects are recovered from images by a process of counterfactual simulation. This imagination capacity, while superficially similar in intent to traditional kinematic simulation, is actually based on a drastically different foundation which takes naive physical constraints such as substantiality, continuity, and attachment relations between objects to be primary. This theory of event perception has been implemented in a program called A scBIGAIL which watches a computer-generated animated movie and produces a description of the objects and events which occur in that movie. A scBIGAIL's event perception processes rely on counter-factual simulation to recover changing support, contact, and attachment relations between objects. (Copies available exclusively from MIT Libraries, Rm. 14-0551, Cambridge, MA 02139-4307. Ph. 617-253-5668; Fax 617-253-1690.) (Abstract shortened with permission of school.)"
            },
            "slug": "Naive-physics,-event-perception,-lexical-semantics,-Siskind",
            "title": {
                "fragments": [],
                "text": "Naive physics, event perception, lexical semantics, and language acquisition"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "Algorithms are presented which utilize a cross-situational learning strategy whereby the learner finds a language model which is consistent across several utterances paired with their non-linguistic context, and three claims about event perception and the process of grounding language in visual perception are advanced."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145512773"
                        ],
                        "name": "C. Fisher",
                        "slug": "C.-Fisher",
                        "structuredName": {
                            "firstName": "Cynthia",
                            "lastName": "Fisher",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Fisher"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8260375"
                        ],
                        "name": "D. Hall",
                        "slug": "D.-Hall",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Hall",
                            "middleNames": [
                                "Geoffrey"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hall"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69531587"
                        ],
                        "name": "Susan Rakowitz",
                        "slug": "Susan-Rakowitz",
                        "structuredName": {
                            "firstName": "Susan",
                            "lastName": "Rakowitz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Susan Rakowitz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3371224"
                        ],
                        "name": "L. Gleitman",
                        "slug": "L.-Gleitman",
                        "structuredName": {
                            "firstName": "Lila",
                            "lastName": "Gleitman",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Gleitman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16278630,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "6e8b2264637d574768526d4eeff8194934288bd9",
            "isKey": false,
            "numCitedBy": 328,
            "numCiting": 96,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "When-it-is-better-to-receive-than-to-give:-and-on-Fisher-Hall",
            "title": {
                "fragments": [],
                "text": "When it is better to receive than to give: Syntactic and conceptual constraints on vocabulary growth"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32205816"
                        ],
                        "name": "M. H. Kelly",
                        "slug": "M.-H.-Kelly",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Kelly",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. H. Kelly"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6084725,
            "fieldsOfStudy": [
                "Linguistics",
                "Psychology"
            ],
            "id": "63470730dea262829c56722739bc53bbee99c6b8",
            "isKey": false,
            "numCitedBy": 316,
            "numCiting": 111,
            "paperAbstract": {
                "fragments": [],
                "text": "One ubiquitous problem in language processing involves the assignment of words to the correct grammatical category, such as noun or verb. In general, semantic and syntactic cues have been cited as the principal information for grammatical category assignment, to the neglect of possible phonological cues. This neglect is unwarranted, and the following claims are made: (a) Numerous correlations between phonology and grammatical class exist, (b) some of these correlations are large and can pervade the entire lexicon of a language and hence can involve thousands of words, (c) experiments have repeatedly found that adults and children have learned these correlations, and (d) explanations for how these correlations arose can be proposed and evaluated. Implications of these phenomena for language representation and processing are discussed."
            },
            "slug": "Using-sound-to-solve-syntactic-problems:-the-role-Kelly",
            "title": {
                "fragments": [],
                "text": "Using sound to solve syntactic problems: the role of phonology in grammatical category assignments."
            },
            "venue": {
                "fragments": [],
                "text": "Psychological review"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144366429"
                        ],
                        "name": "S. Carey",
                        "slug": "S.-Carey",
                        "structuredName": {
                            "firstName": "Susan",
                            "lastName": "Carey",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Carey"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17710641,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "d589c647abb29623d1d6f2ff344a1ed589b1ec62",
            "isKey": false,
            "numCitedBy": 759,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "concepts of reference point and polarity, which presuppose concepts of dimension of comparison and zero point. These concepts can be probed nonlinguistically. For example, animals can be taught to choose the smaller, or larger, of two stimuli. It is likely that the standard sizes of objects are represented conceptually for the purpose of object recognition. Presented with a box the size of my desk, I am not likely to entertain the hypothesis that it is a box of Kleenex. Underlying the feature system characterizing the dimensions are many aspects of man's representation of space; concepts like vertical and horizontal, cross-section, and spatial extent itself are reflected in many nonlinguistic sensorimotor routines (see Miller and JohnsonLaird 1976; H. H. Clark 1973). As the child learns a new spatial adjective, what aspects of its conceptual underpinnings are mapped onto it early and what aspects, if any, take years to work out? Two positions within the framework of the missing-feature theory have been held. The first position is that the child's initial mapping is between the word and the features specifying the relevant dimension of comparison. The missing feature is polarity, the direction from zero. On this view, both narrow and wide would have the incomplete lexical entry: [Adj] [comparative] [spatial extent] [-primary] [ vertical], making the two words synonyms (Donaldson and Wales 1970; H. H. Clark 1 970; E. V. Clark 1973; Klatzky et al. 1973). The two words need not have identical incomplete lexical entries simultaneously. For example, [+pole] might be added to the representation of wide before [ pole] is to narrow. In this case narrow means what wide did before"
            },
            "slug": "The-child-as-word-learner-Carey",
            "title": {
                "fragments": [],
                "text": "The child as word learner"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144861692"
                        ],
                        "name": "A. Christophe",
                        "slug": "A.-Christophe",
                        "structuredName": {
                            "firstName": "Anne",
                            "lastName": "Christophe",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Christophe"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2202008"
                        ],
                        "name": "Emmanuel Dupoux",
                        "slug": "Emmanuel-Dupoux",
                        "structuredName": {
                            "firstName": "Emmanuel",
                            "lastName": "Dupoux",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Emmanuel Dupoux"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5613246"
                        ],
                        "name": "J. Bertoncini",
                        "slug": "J.-Bertoncini",
                        "structuredName": {
                            "firstName": "Josiane",
                            "lastName": "Bertoncini",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Bertoncini"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2466559"
                        ],
                        "name": "J. Mehler",
                        "slug": "J.-Mehler",
                        "structuredName": {
                            "firstName": "Jacques",
                            "lastName": "Mehler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mehler"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 12092331,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "fd1c0928dd7ca0b4f52563c2334cea46de151016",
            "isKey": false,
            "numCitedBy": 228,
            "numCiting": 47,
            "paperAbstract": {
                "fragments": [],
                "text": "Babies, like adults, hear mostly continuous speech. Unlike adults, however, they are not acquainted with the words that constitute the utterances; yet in order to construct representations for words, they have to retrieve them from the speech wave. Given the apparent lack of obvious cues to word boundaries (such as pauses between words), this is not a trivial problem. Among the several mechanisms that could be explored to solve this bootstrapping problem for lexical acquisition, a tentative but reasonable one posits the existence of some cues (other than silence) that signal word boundaries. In order to test this hypothesis, infants were used as informants in our experiments. It was hypothesized that if word boundary cues exist, and if infants are to use them in the course of language acquisition, then they should at least perceive these cues. As a consequence, infants should be able to discriminate sequences that contain a word boundary from those that do not. A number of bisyllabic stimuli were extracted either from within French words (e.g., mati in mathématicien), or from between words (e.g., mati in panorama typique). Three-day-old infants were tested with a non-nutritive sucking paradigm, and the results of two experiments suggest that infants can discriminate between items that contain a word boundary and items that do not. It is therefore conceivable that newborns are already sensitive to cues that correlate with word boundaries. This result lends plausibility to the hypothesis that infants might use word boundary cues during lexical acquisition."
            },
            "slug": "Do-infants-perceive-word-boundaries-An-empirical-of-Christophe-Dupoux",
            "title": {
                "fragments": [],
                "text": "Do infants perceive word boundaries? An empirical study of the bootstrapping of lexical acquisition."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "Three-day-old infants were tested with a non-nutritive sucking paradigm, and the results of two experiments suggest that infants can discriminate between items that contain a word boundary and items that do not, lending plausibility to the hypothesis that infants might use word boundary cues during lexical acquisition."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of the Acoustical Society of America"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3086368"
                        ],
                        "name": "R. Berwick",
                        "slug": "R.-Berwick",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Berwick",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Berwick"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16337517,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "5e6fdf2dfcefe043394298c9e437f962aad0f81e",
            "isKey": false,
            "numCitedBy": 45,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes work in progress on a computer program that uses syntactic constraints to derive the meanings of verbs from an analysis of simple English example stories. The central idea is an extension of Winston's (Winston 1975) program that learned the structural descriptions of blocks world scenes. In the new research, English verbs take the place of blocks world objects like ARCH and TOWER, with frame-based descriptions of causal relationships serving as the structural descriptions. Syntactic constraints derived from the parsing of story plots are used to drive an analogical matching procedure. Analogical matching gives a way to compare descriptions of known words to unknown words. The \"meaning\" of a new verb is learned by matching pan of the causal network description of a story precis containing the unknown word to a set of such descriptions derived from similar stories that contain only known words. The best match forges an assignment between objects and relations such that the unknown verb is matched to a known verb, with the assignment being guided by syntactic constraints. The causal network surrounding the unknown item is then used as a scaffolding to construct a network representing the use of the novel word in a particular context. Words (and their associated stories) that are \"best matches\" are grouped together into a similarity network, according to the match score."
            },
            "slug": "Learning-Word-Meanings-From-Examples-Berwick",
            "title": {
                "fragments": [],
                "text": "Learning Word Meanings From Examples"
            },
            "tldr": {
                "abstractSimilarityScore": 79,
                "text": "A computer program that uses syntactic constraints to derive the meanings of verbs from an analysis of simple English example stories is described, an extension of Winston's (Winston 1975) program that learned the structural descriptions of blocks world scenes."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1770316"
                        ],
                        "name": "P. Jacobs",
                        "slug": "P.-Jacobs",
                        "structuredName": {
                            "firstName": "Paul",
                            "lastName": "Jacobs",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Jacobs"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2797754"
                        ],
                        "name": "U. Zernik",
                        "slug": "U.-Zernik",
                        "structuredName": {
                            "firstName": "Uri",
                            "lastName": "Zernik",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "U. Zernik"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1084686,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "0c3264d6f5c501922c28aa122c49e90982267acd",
            "isKey": false,
            "numCitedBy": 42,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "Language acquisition addresses two important text processing issues. The immediate problem is understanding a text in spite of the existence of lexical gaps. The long term issue is that the understander must incorporate new words into its lexicon for future use. This paper describes an approach to constructing new lexical entries in a gradual process by analyzing a sequence of example texts. This approach permits the graceful tolerance of new words while enabling the automated extension of the lexicon. Each new acquired lexeme starts as a set of assumptions derived from the analysis of each word in a textual context. A variety of knowledge sources, including morphological, syntactic, semantic, and contextual knowledge, determine the assumptions. These assumptions, along with justifications and dependencies, are interpreted and refined by a learning program that ultimately updates the system's lexicon. This approach uses existing linguistic knowledge, and generalization of multiple occurrences, to create new operational lexical entries."
            },
            "slug": "Acquiring-Lexical-Knowledge-from-Text:-A-Case-Study-Jacobs-Zernik",
            "title": {
                "fragments": [],
                "text": "Acquiring Lexical Knowledge from Text: A Case Study"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This paper describes an approach to constructing new lexical entries in a gradual process by analyzing a sequence of example texts to permit the graceful tolerance of new words while enabling the automated extension of the lexicon."
            },
            "venue": {
                "fragments": [],
                "text": "AAAI"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1731375"
                        ],
                        "name": "M. Brent",
                        "slug": "M.-Brent",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Brent",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Brent"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "20872411"
                        ],
                        "name": "T. A. Cartwright",
                        "slug": "T.-A.-Cartwright",
                        "structuredName": {
                            "firstName": "Timothy",
                            "lastName": "Cartwright",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. A. Cartwright"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 16185790,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "389713f6b0d7906b42eefeca0f7987d06728e86b",
            "isKey": false,
            "numCitedBy": 489,
            "numCiting": 42,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Distributional-regularity-and-phonotactic-are-for-Brent-Cartwright",
            "title": {
                "fragments": [],
                "text": "Distributional regularity and phonotactic constraints are useful for segmentation"
            },
            "venue": {
                "fragments": [],
                "text": "Cognition"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144676410"
                        ],
                        "name": "M. Halle",
                        "slug": "M.-Halle",
                        "structuredName": {
                            "firstName": "Morris",
                            "lastName": "Halle",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Halle"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2708017"
                        ],
                        "name": "J. Bresnan",
                        "slug": "J.-Bresnan",
                        "structuredName": {
                            "firstName": "Joan",
                            "lastName": "Bresnan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Bresnan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144096985"
                        ],
                        "name": "G. Miller",
                        "slug": "G.-Miller",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Miller",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Miller"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 151335519,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "6212e3e2bee0f342d1311d382a6c59e5efdf2295",
            "isKey": false,
            "numCitedBy": 628,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "\"Any adequate psychology of man must provide some way to understand the human capacity for language,\" the editors of this volume write. \"It was a belief shared by quite a few among us that developments in linguistics and psychology were leading to similar conclusions by separate routes and that this was an appropriate time to explore the implications of these apparently parallel developments for future, perhaps joint, work. This volume represents a few initial steps in the direction of that goal.\" The nine chapters of this book were written by linguists and psychologists, after extended collaboration and exchange of ideas. In the first chapter, \"A Realistic Transformational Grammar,\" Joan Bresnan (MIT) explores some of the consequences of her proposal that the role of many transformations in generative grammar should be subsumed by the lexical component. The character of lexical entries is the central topic of \"Semantic Relations Among Words,\" by George A. Miller (Rockefeller University); he reports views and suggestions that he has developed since the publication of his and Johnson-Laird's monumental Language and Perception (1976). The chapter by Eric Wanner (Rockefeller University) and Michael Maratsos (University of Minnesota), \"An ATN Approach to Comprehension,\" presents a nontransformational model of language processing that uses concepts developed in automatic parsing systems. The relations between their psychological model and Bresnan's lexical-transformational model is outlined in Chapter 1. \"Anaphora as an Approach to Pragmatics\" by Keith Stenning (University of Liverpool) explores the central problem of pragmatics: a sentence can express different meanings in different contexts. He proposes that a successful account of antecedent-anaphor relations must recognize the relation between a linguistic entity and its context, linguistic or nonlinguistic. Ray Jackendoff (Brandeis), in \"Grammar as Evidence for Conceptual Structure,\" attempts to use the information about semantic structure that is provided by the interpretation of various syntactic configurations in order to gain insights into basic attributes of human cognition. The remaining chapters deal with ways knowledge of a language is acquired and lost. In \"Language and the Brain,\" Edgar B. Zurif (Boston University Medical School) and Sheila E. Blumstein (Brown University and Boston University Medical School) survey some recent work on aphasia in the light of different theoretical models of language. Michael Maratsos, in \"New Models in Linguistics and Language Acquisition,\" inquires into the implications that a language model with restricted transformational component has for understanding of the way children acquire syntax. In \"The Child as Word Learner\" Susan Carey (MIT) examines the rapidity with which children learn words; she proposes that the process involves two stages: an almost instantaneous assignment of a new world to a field of related words, followed by a slow working out of its place in that field. Finally, Morris Halle (MIT), in \"Knowledge Unlearned and Untaught: What speakers know about the sounds of their language,\" cites facts that normal speakers of English demonstrably know but could never have been explicitly taught, nor in some cases even learned. Halle suggests this is a manifestation of innate knowledge that is genetically programmed into organisms."
            },
            "slug": "Linguistic-theory-and-psychological-reality-Halle-Bresnan",
            "title": {
                "fragments": [],
                "text": "Linguistic theory and psychological reality"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145260350"
                        ],
                        "name": "W. Quine",
                        "slug": "W.-Quine",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Quine",
                            "middleNames": [
                                "V."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Quine"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60507168,
            "fieldsOfStudy": [
                "Philosophy"
            ],
            "id": "52b99d29c931d9aaf1b3d6f48b31577affef0208",
            "isKey": false,
            "numCitedBy": 6672,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Willard Van Orman Quine begins this influential work by declaring, \"Language is a social art. In acquiring it we have to depend entirely on intersubjectively available cues as to what to say and when.\" As Patricia Smith Churchland notes in her foreword to this new edition, with Word and Object Quine challenged the tradition of conceptual analysis as a way of advancing knowledge. The book signaled twentieth-century philosophy's turn away from metaphysics and what Churchland calls the \"phony precision\" of conceptual analysis. In the course of his discussion of meaning and the linguistic mechanisms of objective reference, Quine considers the indeterminacy of translation, brings to light the anomalies and conflicts implicit in our language's referential apparatus, clarifies semantic problems connected with the imputation of existence, and marshals reasons for admitting or repudiating each of various categories of supposed objects. In addition to Churchland's foreword, this edition offers a new preface by Quine's student and colleague Dagfinn Follesdal that describes the never-realized plans for a second edition of Word and Object, in which Quine would offer a more unified treatment of the public nature of meaning, modalities, and propositional attitudes."
            },
            "slug": "Word-and-Object-Quine",
            "title": {
                "fragments": [],
                "text": "Word and Object"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This edition offers a new preface by Quine's student and colleague Dagfinn Follesdal that describes the never-realized plans for a second edition of Word and Object, in which Quine would offer a more unified treatment of the public nature of meaning, modalities, and propositional attitudes."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1960
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1777660"
                        ],
                        "name": "Naftali Tishby",
                        "slug": "Naftali-Tishby",
                        "structuredName": {
                            "firstName": "Naftali",
                            "lastName": "Tishby",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Naftali Tishby"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1799096"
                        ],
                        "name": "A. Gorin",
                        "slug": "A.-Gorin",
                        "structuredName": {
                            "firstName": "Allen",
                            "lastName": "Gorin",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Gorin"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 35792676,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "335a8d819484831cd3f5b2d22efdf4229a941b8e",
            "isKey": false,
            "numCitedBy": 16,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract Statistical association measures play an important role in many areas of natural language research. An impediment to reliable estimation of such associations is the problem of small-sample statistics, since in any natural corpus there will be many infrequently occurring words. This paper proposes an alternative method for estimating such associations, which circumvents the small-sample issues. The idea is to view sentence/meaning pairs as algebraic equations, rather than as observations of a pattern in some class. Associations are estimated via solving these equations rather than via relative frequency estimates of mutual information. We develop a theoretical foundation for the dual algebraic/statistical nature of associations, proving two uniqueness theorems. We then exploit this theory to provide an algorithmic solution to the estimation problem. This algorithm is experimentally evaluated on 1494 natural languages messages from a rudimentary Data Retrieval experiment. One striking result is that the algebraic algorithm can often provide reliable estimates even for words which occur only once in a corpus."
            },
            "slug": "Algebraic-learning-of-statistical-associations-for-Tishby-Gorin",
            "title": {
                "fragments": [],
                "text": "Algebraic learning of statistical associations for language acquisition"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "A theoretical foundation for the dual algebraic/statistical nature of associations is developed, proving two uniqueness theorems, and an algorithmic solution to the estimation problem is provided."
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Speech Lang."
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102781442"
                        ],
                        "name": "C. L. Baker",
                        "slug": "C.-L.-Baker",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Baker",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. L. Baker"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144051755"
                        ],
                        "name": "J. McCarthy",
                        "slug": "J.-McCarthy",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "McCarthy",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. McCarthy"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60523661,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "21c78c34b07cee3c26b5a0e2c54dfedaf5de96b6",
            "isKey": false,
            "numCitedBy": 420,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This collection of articles and associated discussion papers focuses on a problem that has attracted increasing attention from linguists and psychologists throughout the world during the past several years. Reduced to essentials, the problem is that of discovering the character of the mental capacities that make it possible for human beings to attain knowledge of their language on the basis of fragmentary and haphazard early linguistic experience. A fundamental assumption running through all of these contributions is that people possess strong innate predispositions that are critical for success in this task."
            },
            "slug": "The-Logical-problem-of-language-acquisition-Baker-McCarthy",
            "title": {
                "fragments": [],
                "text": "The Logical problem of language acquisition"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2797754"
                        ],
                        "name": "U. Zernik",
                        "slug": "U.-Zernik",
                        "structuredName": {
                            "firstName": "Uri",
                            "lastName": "Zernik",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "U. Zernik"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 58067384,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "6a7d1669748c30ef108d7874edaf4c8cac73a01c",
            "isKey": false,
            "numCitedBy": 288,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "Contents: U. Zernik, Introduction. Part I:Lexical Senses. P. Jacobs, Making Sense of Lexical Acquisition. R. Krovetz, Lexical Acquisition and Information Retrieval. B. Slator, Using Context for Sense Preference. U. Zernik, Tagging Word Sense In Corpus. Part II:Lexical Statistics. K. Church, W. Gale, P. Hanks, D. Hindle, Using Statistics in Lexical Analysis. F. Smadja, Macrocoding the Lexicon with Co-Occurrence Knowledge. N. Calzolari, Lexical Databases and Textual Corpora: Perspectives of Integration for a Lexical Knowledge-Base. Part III:Lexical Representation. R. Beckwith, C. Fellbaum, D. Gross, G. Miller, WordNet: A Lexical Database Organized on Psycholinguistic Principles. B. Atkins, B. Levin, Admitting Impediments. B. Dorr, Conceptual Basis of the Lexicon in Machine Translation. M. Dyer, Lexical Acquisition Through Symbol Recirculation. Part IV:Lexical Semantics. P. Velardi, Acquiring a Semantic Lexicon for Natural Language Processing. L. Braden-Harder, W. Zadrozny, Lexicons for Broad Coverage Semantics. J. Martin, Representing and Acquiring Metaphor-Based Polysemy."
            },
            "slug": "Lexical-Acquisition:-Exploiting-On-Line-Resources-a-Zernik",
            "title": {
                "fragments": [],
                "text": "Lexical Acquisition: Exploiting On-Line Resources to Build a Lexicon"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This book discusses Lexical Acquisition Through Symbol Recirculation, Lexical Representation, and Lexicons for Broad Coverage Semantics, which are concerned with the acquisition of semantic meaning in the Lexical Knowledge-Base."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143789092"
                        ],
                        "name": "A. Cutler",
                        "slug": "A.-Cutler",
                        "structuredName": {
                            "firstName": "Anne",
                            "lastName": "Cutler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Cutler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2466559"
                        ],
                        "name": "J. Mehler",
                        "slug": "J.-Mehler",
                        "structuredName": {
                            "firstName": "Jacques",
                            "lastName": "Mehler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mehler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144730709"
                        ],
                        "name": "D. Norris",
                        "slug": "D.-Norris",
                        "structuredName": {
                            "firstName": "Dennis",
                            "lastName": "Norris",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Norris"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144901679"
                        ],
                        "name": "J. Segui",
                        "slug": "J.-Segui",
                        "structuredName": {
                            "firstName": "Juan",
                            "lastName": "Segui",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Segui"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 4347368,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "b335b6687cfba4708cd9af8375d19294d7b292d4",
            "isKey": false,
            "numCitedBy": 161,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "Infants acquire whatever language is spoken in the environment into which they are born. The mental capability of the newborn child is not biased in any way towards the acquisition of one human language rather than another. Because psychologists who attempt to model the process of language comprehension are interested in the structure of the human mind, rather than in the properties of individual languages, strategies which they incorporate in their models are presumed to be universal, not language-specific. In other words, strategies of comprehension are presumed to be characteristic of the human language processing system, rather than, say, the French, English, or Igbo language processing systems. We report here, however, on a comprehension strategy which appears to be used by native speakers of French but not by native speakers of English."
            },
            "slug": "A-language-specific-comprehension-strategy-Cutler-Mehler",
            "title": {
                "fragments": [],
                "text": "A language-specific comprehension strategy"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This work reports here, however, on a comprehension strategy which appears to be used by native speakers of French but not bynative speakers of English."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143789092"
                        ],
                        "name": "A. Cutler",
                        "slug": "A.-Cutler",
                        "structuredName": {
                            "firstName": "Anne",
                            "lastName": "Cutler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Cutler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35408831"
                        ],
                        "name": "D. Carter",
                        "slug": "D.-Carter",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Carter",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Carter"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 20293367,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "6dddc4ce1aedea992f4ee0e814805056e1c5adfe",
            "isKey": false,
            "numCitedBy": 767,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-predominance-of-strong-initial-syllables-in-the-Cutler-Carter",
            "title": {
                "fragments": [],
                "text": "The predominance of strong initial syllables in the English vocabulary"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144445645"
                        ],
                        "name": "J. Morgan",
                        "slug": "J.-Morgan",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Morgan",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Morgan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2062841556"
                        ],
                        "name": "K. Demuth",
                        "slug": "K.-Demuth",
                        "structuredName": {
                            "firstName": "Katherine",
                            "lastName": "Demuth",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Demuth"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 54096745,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "39647af18c87ba5443122bd03e8dd8f0b32d74be",
            "isKey": false,
            "numCitedBy": 351,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "Contents: Preface. J.L. Morgan, K. Demuth, Signal to Syntax: An Overview. Part I: The Nature, Perception, and Representation of Input Speech. P.D. Eimas, The Perception and Representation of Speech by Infants. B.E. Dresher, Introduction to Metrical and Prosodic Phonology. P. Lieberman, Some Biological Constraints on the Analysis of Prosody. P. Price, M. Ostendorf, Combining Linguistic With Statistical Methods in Modeling Prosody. Part II: Speech and the Acquisition of Words. A. Cutler, Prosody and the Word Boundary Problem. J. Mehler, E. Dupoux, T. Nazzi, G. Dahaene-Lambertz, Coping With Linguistic Diversity: The Infant's Viewpoint. R.N. Aslin, J.Z. Woodward, N.P. LaMendola, T.G. Bever, Models of Word Segmentation in Fluent Maternal Speech to Infants. N.B. Ratner, From \"Signal to Syntax\": But What Is the Nature of the Signal? C.H. Echols, A Role for Stress in Early Speech Segmentation. K. Demuth, The Prosodic Structure of Early Words. Part III: Speech and the Acquisition of Grammatical Morphology & Form Classes. E. Selkirk, The Prosodic Structure of Function Words. A.M. Peters, S. Stromqvist, The Role of Prosody in the Acquisition of Grammatical Morphemes. L.B. Leonard, J.A. Eyer, Deficits of Grammatical Morphology in Children with Specific Language Impairment and Their Implications for Notions of Bootstrapping. M. Kelly, The Role of Phonology in Grammatical Category Assignments. J.L. Morgan, R. Shi, P. Allopena, Perceptual Bases of Rudimentary Grammatical Categories: Toward a Broader Conceptualization of Bootstrapping. Part IV: Speech and the Acquisition of Phrase Structure. J.J. Venditti, S-A. Jun, M.E. Beckman, Prosodic Cues to Syntactic and Other Linguistic Structures in Japanese, Korean, and English. R. Mazuka, Can a Grammatical Parameter Be Set Before the First Word? Prosodic Contributions to Early Setting of a Grammatical Parameter. M. Steedman, Phrasal Intonation and the Acquisition of Syntax. C. Fisher, H. Tokura, Prosody in Speech to Infants: Direct and Indirect Acoustic Cues to Syntactic Structure. A. Fernald, G. McRoberts, Prosodic Bootstrapping: A Critical Analysis of the Argument and the Evidence. P. Jusczyk, D.G.K. Nelson, Syntactic Units, Prosody, and Psychological Reality During Infancy. Part V: Speech and the Acquisition of Language. L. Gerken, Phonological and Distributional Information in Sytnax Acquisition. J.F. Werker, V.L. Lloyd, J.E. Pegg, L. Polka, Putting the Baby in the Bootstraps: Toward a More Complete Understanding of the Role of the Input in Infant Speech Processing. K. Hirsh-Pasek, M. Tucker, R.M. Golinkoff, Dynamical Systems Theory: Reinterpreting \"Prosodic Bootstrapping\" and Its Role in Language Acquisition."
            },
            "slug": "Signal-to-syntax-:-bootstrapping-from-speech-to-in-Morgan-Demuth",
            "title": {
                "fragments": [],
                "text": "Signal to syntax : bootstrapping from speech to grammar in early acquisition"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This book discusses Prosodic Bootstrapping, Prosodic Cues to Syntactic and Other Linguistic Structures in Japanese, Korean, and English, and the role of Prosody in Speech to Infants."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2024985"
                        ],
                        "name": "P. Suppes",
                        "slug": "P.-Suppes",
                        "structuredName": {
                            "firstName": "Patrick",
                            "lastName": "Suppes",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Suppes"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 12412486,
            "fieldsOfStudy": [
                "Linguistics",
                "Psychology"
            ],
            "id": "d127687f35a93605b961d81efdd84e7156084183",
            "isKey": false,
            "numCitedBy": 263,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "Interest in language, especially that of children, has become a central concern of contemporary psychology- This interest is somewhat surprising, because everyone recognizes the enormous complexity of language use and language development >in the child. . In spite of a widespread recognition that there is little hope of having a complete theory of these matters at any time in the near future, a general air of activity and in some cases of optimism prevails about the progress being made. For example, it is now possible to cite a fairly large number of references in the literature on almost any aspect of language development in the child, ranging from phonology to semantic comprehension, with probably the largest number of studies being on the syntactical or grammatical development of children’s language. It is surely in this area that the most progress has been made over the past decade or decade and a half."
            },
            "slug": "The-Semantics-of-Children's-Language-Suppes",
            "title": {
                "fragments": [],
                "text": "The Semantics of Children's Language"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2414870"
                        ],
                        "name": "N. Okada",
                        "slug": "N.-Okada",
                        "structuredName": {
                            "firstName": "Naoyuki",
                            "lastName": "Okada",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Okada"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 39905290,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8c2b07df15e4b9a280575f36918766bfc5c310c6",
            "isKey": false,
            "numCitedBy": 28,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents a system for understanding moving picture patterns based on linguistic knowledge. In order to deal with the difference of knowledge level between picture pattern and natural language, a hierarchical structure is adopted for the representation of knowledge. At a certain level knowledge data is organized as frame centred around the concept of verb. The concepts of approximately five thousand Japanese verbs were systematically classified to construct such a knowledge system. \n \nThe program reads a picture pattern sequence. Pairing a picture pattern with the successive one in the sequence, it recognizes primitive pictures in the pair. Then, checking dynamic relations among primitive pictures, it organizes the relations into verb-centred events . It makes inferences about similarity between two concepts of verbs . Finally it describes each event in Japanese and English."
            },
            "slug": "SUPP:-Understanding-Moving-Picture-Patterns-Based-Okada",
            "title": {
                "fragments": [],
                "text": "SUPP: Understanding Moving Picture Patterns Based on Linguistic Knowledge"
            },
            "tldr": {
                "abstractSimilarityScore": 69,
                "text": "This paper presents a system for understanding moving picture patterns based on linguistic knowledge that organizes the relations into verb-centred events and describes each event in Japanese and English."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32456604"
                        ],
                        "name": "Ellen Hays",
                        "slug": "Ellen-Hays",
                        "structuredName": {
                            "firstName": "Ellen",
                            "lastName": "Hays",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Ellen Hays"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 20358817,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "80a52eaa8d9cd09643ea8b557d6081ce28215d88",
            "isKey": false,
            "numCitedBy": 16,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "In a computational system for describing and understanding descriptions of spatial relations and motion events in natural language (city scenes or soccer games, for example), there is a need for a referential semantics of motion verbs and spatial prepositions that is both structurally coherent and (ideally) general enough to be used for both interpretation and generation of such descriptions. I propose an approach to defining those spatial terms that takes the form of a multidimensional hierarchy of definitions, incorporating some of the elements of Herskovits’ approach to interpreting (static) locative expressions as well as ideas from the relatively new study of cognitive linguistics."
            },
            "slug": "On-Defining-Motion-Verbs-and-Spatial-Prepositions-Hays",
            "title": {
                "fragments": [],
                "text": "On Defining Motion Verbs and Spatial Prepositions"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This work proposes an approach to defining those spatial terms that takes the form of a multidimensional hierarchy of definitions, incorporating some of the elements of Herskovits’ approach to interpreting (static) locative expressions as well as ideas from the relatively new study of cognitive linguistics."
            },
            "venue": {
                "fragments": [],
                "text": "Repräsentation und Verarbeitung räumlichen Wissens"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1810353"
                        ],
                        "name": "E. Markman",
                        "slug": "E.-Markman",
                        "structuredName": {
                            "firstName": "Ellen",
                            "lastName": "Markman",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Markman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60731136,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "a7d95a72a0c4f99a5d1a3eb99731a26e42c9e842",
            "isKey": false,
            "numCitedBy": 939,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "In this landmark work on early conceptual and lexical development, Ellen Markman explores the fascinating problem of how young children succeed at the task of inducing concepts. Backed by extensive experimental results, she challenges the fundamental assumptions of traditional theories of language acquisition and proposes that a set of constraints or principles of induction allows children to efficiently integrate knowledge and to induce information about new examples of familiar categories."
            },
            "slug": "Categorization-and-Naming-in-Children:-Problems-of-Markman",
            "title": {
                "fragments": [],
                "text": "Categorization and Naming in Children: Problems of Induction"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "Ellen Markman challenges the fundamental assumptions of traditional theories of language acquisition and proposes that a set of constraints or principles of induction allows children to efficiently integrate knowledge and to induce information about new examples of familiar categories."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3353410"
                        ],
                        "name": "P. Jusczyk",
                        "slug": "P.-Jusczyk",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Jusczyk",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Jusczyk"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143789092"
                        ],
                        "name": "A. Cutler",
                        "slug": "A.-Cutler",
                        "structuredName": {
                            "firstName": "Anne",
                            "lastName": "Cutler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Cutler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3573920"
                        ],
                        "name": "N. J. Redanz",
                        "slug": "N.-J.-Redanz",
                        "structuredName": {
                            "firstName": "Nancy",
                            "lastName": "Redanz",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. J. Redanz"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 9004708,
            "fieldsOfStudy": [
                "Psychology",
                "Linguistics"
            ],
            "id": "4e49f7012c54bbcd447e04e18d86c0db7c9a6ee1",
            "isKey": false,
            "numCitedBy": 874,
            "numCiting": 67,
            "paperAbstract": {
                "fragments": [],
                "text": "One critical aspect of language acquisition is the development of a lexicon that associates sounds and meanings; but developing a lexicon first requires that the infant segment utterances into individual words. How might the infant begin this process? The present study was designed to examine the potential role that sensitivity to predominant stress patterns of words might play in lexical development. In English, by far the majority of words have stressed (strong) initial syllables. Experiment 1 of our study demonstrated that by 9 months of age American infants listen significantly longer to words with strong/weak stress patterns than to words with weak/strong stress patterns. However, Experiment 2 showed that no significant preferences for the predominant stress pattern appear with 6-month-old infants, which suggests that the preference develops as a result of increasing familiarity with the prosodic features of the native language. In a third experiment, 9-month-olds showed a preference for strong/weak patterns even when the speech input was low-pass filtered, which suggests that their preference is specifically for the prosodic structure of the words. Together the results suggest that attention to predominant stress patterns in the native language may form an important part of the infant's process of developing a lexicon."
            },
            "slug": "Infants'-preference-for-the-predominant-stress-of-Jusczyk-Cutler",
            "title": {
                "fragments": [],
                "text": "Infants' preference for the predominant stress patterns of English words."
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The results suggest that attention to predominant stress patterns in the native language may form an important part of the infant's process of developing a lexicon."
            },
            "venue": {
                "fragments": [],
                "text": "Child development"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3371224"
                        ],
                        "name": "L. Gleitman",
                        "slug": "L.-Gleitman",
                        "structuredName": {
                            "firstName": "Lila",
                            "lastName": "Gleitman",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Gleitman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 144713838,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "fd307bd17e680c2d458af54b60f0d0ae00ceea88",
            "isKey": false,
            "numCitedBy": 1402,
            "numCiting": 57,
            "paperAbstract": {
                "fragments": [],
                "text": "This chapter presents the theory of syntactic bootstrapping. It shows fundamental problems with a theory of verb learning based solely on observations of the external world. It then shows how these problems can be overcome if those experiences are paired with information about the syntactic structure of the clause that the verb occurs in."
            },
            "slug": "The-Structural-Sources-of-Verb-Meanings-Gleitman",
            "title": {
                "fragments": [],
                "text": "The Structural Sources of Verb Meanings"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144297714"
                        ],
                        "name": "R. Granger",
                        "slug": "R.-Granger",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Granger",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Granger"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 9255668,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5213e864b82c4dde46ce9f6b82c403729426d3a2",
            "isKey": false,
            "numCitedBy": 131,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "The inferencing task of figuring out words from context is implemented in the presence of a large database of world knowledge. The program does not require interaction with the user, but rather uses internal parser expectations and knowledge embodied in scripts to figure out likely definitions for unknown words, and to create context-specific definitions for such words."
            },
            "slug": "FOUL-UP:-A-Program-that-Figures-Out-Meanings-of-Granger",
            "title": {
                "fragments": [],
                "text": "FOUL-UP: A Program that Figures Out Meanings of Words from Context"
            },
            "tldr": {
                "abstractSimilarityScore": 73,
                "text": "The inferencing task of figuring out words from context is implemented in the presence of a large database of world knowledge to figure out likely definitions for unknown words, and to create context-specific definitions for such words."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2060408607"
                        ],
                        "name": "M. S. Horton",
                        "slug": "M.-S.-Horton",
                        "structuredName": {
                            "firstName": "Marjorie",
                            "lastName": "Horton",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. S. Horton"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1810353"
                        ],
                        "name": "E. Markman",
                        "slug": "E.-Markman",
                        "structuredName": {
                            "firstName": "Ellen",
                            "lastName": "Markman",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Markman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 143513773,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "225f58ca8f25c097dff5b4388f350f18ac336994",
            "isKey": false,
            "numCitedBy": 137,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "HORTON, MARJORIE S., and MARKMAN, ELLEN M. Developmental Differences in the Acquisition of Basic and Superordinate Categories. CHILD DEVELOPMENT, 1980, 51, 708-719. This study examined the relative utility of exemplar and linguistic information for acquiring basic and superordinate categories. The perceptual similarity among members of basic categories suggests that a child could learn these categories simply from exposure to exemplars. The dissimilarity among members of superordinate categories suggests a child would also need to be informed of the relevant criteria for categorization. Developmental differences were predicted in the ability to benefit from the linguistically specified criterial information. These hypotheses were tested by having preschool, kindergarten, and first-grade children learn artificial animal categories. Each child was trained on 1 category through exemplar information alone and 1 through exemplar information supplemented with linguistic descriptions of criterial properties. The results supported the hypotheses: Linguistic information facilitated acquisition of only superordinate, not basic level, categories, and only for the older children. These findings indicate that the internal structure of categories and the processing abilities of the learner are important determinants of acquisition."
            },
            "slug": "Developmental-differences-in-the-acquisition-of-and-Horton-Markman",
            "title": {
                "fragments": [],
                "text": "Developmental differences in the acquisition of basic and superordinate categories."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2403310"
                        ],
                        "name": "R. Schank",
                        "slug": "R.-Schank",
                        "structuredName": {
                            "firstName": "Roger",
                            "lastName": "Schank",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Schank"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61126867,
            "fieldsOfStudy": [
                "Philosophy"
            ],
            "id": "0fae95253749e05975fc34036ae71f36ae2efc70",
            "isKey": false,
            "numCitedBy": 67,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "In order to represent the conceptual information underlying a natural language sentence, a conceptual structure has been established that uses the basic actor-action-object framework. It was the intent that these structures have only one representation for one meaning, regardless of the semantic form of the sentence being represented. Actions were reduced to their basic parts so as to effect this. It was found that only fourteen basic actions were needed as building blocks by which all verbs can be represented. Each of these actions has a set of actions or states which can be inferred when they are present."
            },
            "slug": "The-fourteen-primitive-actions-and-their-Schank",
            "title": {
                "fragments": [],
                "text": "The fourteen primitive actions and their inferences."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "It was found that only fourteen basic actions were needed as building blocks by which all verbs can be represented, and each of these actions has a set of actions or states which can be inferred when they are present."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2024985"
                        ],
                        "name": "P. Suppes",
                        "slug": "P.-Suppes",
                        "structuredName": {
                            "firstName": "Patrick",
                            "lastName": "Suppes",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Suppes"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2155275265"
                        ],
                        "name": "L. Liang",
                        "slug": "L.-Liang",
                        "structuredName": {
                            "firstName": "Lin",
                            "lastName": "Liang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Liang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30067824"
                        ],
                        "name": "M. Böttner",
                        "slug": "M.-Böttner",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Böttner",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Böttner"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17132879,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0fc61b5fdb0eca9af2f573b06495b39d5e41d323",
            "isKey": false,
            "numCitedBy": 23,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "In Sections 1, 2 and 3, the theoretical framework we have been developing for a probabilistic theory of machine learning of natural language is outlined. In Section 4, some simple examples showing how mean learning curves can be constructed from the theory are given. But we also show that the explicit computation of the mean learning curve for an arbitrary number of sentences is unfeasible. This result holds even when the learning itself is quite rapid. In Section 5 we briefly describe the kinds of comprehension grammars generated by our theory from a given finite sample of sentences."
            },
            "slug": "Complexity-Issues-in-Robotic-Machine-Learning-of-Suppes-Liang",
            "title": {
                "fragments": [],
                "text": "Complexity Issues in Robotic Machine Learning of Natural Language"
            },
            "tldr": {
                "abstractSimilarityScore": 66,
                "text": "The theoretical framework for a probabilistic theory of machine learning of natural language is outlined and it is shown that the explicit computation of the mean learning curve for an arbitrary number of sentences is unfeasible."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "104552353"
                        ],
                        "name": "J. Locke",
                        "slug": "J.-Locke",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Locke",
                            "middleNames": [
                                "Courtenay"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Locke"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 4121929,
            "fieldsOfStudy": [
                "Philosophy"
            ],
            "id": "35fa04e14704eee0f089c506caab3a5cca6207ba",
            "isKey": false,
            "numCitedBy": 4087,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "IT is possible to appreciate the reason for this abridged edition of Locke's great Essay and at the same time to regret its appearance. If it had to be done, no living philosopher is so qualified to do it well as Prof. Pringle-Pattison. It is issued for academic reasons and appeals to academic purposes. Every teacher of philosophy knows that it is useless and undesirable to expect the student to read the whole work intensively as he must read, say, Spinoza's “Ethics” or Kant's “Critique of Pure Reason” if he would understand those philosophers. Locke is prolix and also a large part of the Essay has lost the interest and influence it had. On the other hand, nothing is easier than to direct the student as to what is important and what comparatively negligible. Abridgments are unwise. However well-informed, it is certain, for it is human nature, that the reader will suspect that something of importance has escaped or been suppressed.An Essay concerning Human Understanding.JohnLockeBy. Abridged and edited by A. S. Pringle-Pattison. Pp. xlviii + 380. (Oxford: At the Clarendon Press; London: Oxford University Press, 1924.) 8s. 6d. net."
            },
            "slug": "An-Essay-concerning-Human-Understanding-Locke",
            "title": {
                "fragments": [],
                "text": "An Essay concerning Human Understanding"
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1924
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145282631"
                        ],
                        "name": "J. A. Robinson",
                        "slug": "J.-A.-Robinson",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Robinson",
                            "middleNames": [
                                "Alan"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. A. Robinson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14389185,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "d2109eba4f160755f0b9a7497b6b691c2fa2d5d8",
            "isKey": false,
            "numCitedBy": 4367,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": ":tb.~tract. Theorem-proving on the computer, using procedures based on the fund~mental theorem of Herbrand concerning the first-order predicate etdeulus, is examined with ~ view towards improving the efticieney and widening the range of practical applicability of these procedures. A elose analysis of the process of substitution (of terms for variables), and the process of t ruth-funct ional analysis of the results of such substitutions, reveals that both processes can be combined into a single new process (called resolution), i terating which is vastty more ef[ieient than the older cyclic procedures consisting of substitution stages alternating with truth-functional analysis stages. The theory of the resolution process is presented in the form of a system of first<~rder logic with .just one inference principle (the resolution principle). The completeness of the system is proved; the simplest proof-procedure based oil the system is then the direct implementation of the proof of completeness. Howew~r, this procedure is quite inefficient, ~nd the paper concludes with a discussion of several principles (called search principles) which are applicable to the design of efficient proof-procedures employing resolution as the basle logical process."
            },
            "slug": "A-Machine-Oriented-Logic-Based-on-the-Resolution-Robinson",
            "title": {
                "fragments": [],
                "text": "A Machine-Oriented Logic Based on the Resolution Principle"
            },
            "tldr": {
                "abstractSimilarityScore": 38,
                "text": "The paper concludes with a discussion of several principles which are applicable to the design of efficient proof-procedures employing resolution as the basle logical process."
            },
            "venue": {
                "fragments": [],
                "text": "JACM"
            },
            "year": 1965
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2414040"
                        ],
                        "name": "B. MacWhinney",
                        "slug": "B.-MacWhinney",
                        "structuredName": {
                            "firstName": "Brian",
                            "lastName": "MacWhinney",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. MacWhinney"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2091050071"
                        ],
                        "name": "C. Snow",
                        "slug": "C.-Snow",
                        "structuredName": {
                            "firstName": "Catherine",
                            "lastName": "Snow",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Snow"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 30938114,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "88e1ae84ae88d32951edde4dac4aa8c3fdc96cd7",
            "isKey": false,
            "numCitedBy": 906,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "The study of language acquisition underwent a major revolution in the late 1950s as a result of the dissemination of technology permitting high-quality tape-recording of children in the family setting. This new technology led to major breakthroughs in the quality of both data and theory. The field is now at the threshold of a possible second major breakthrough stimulated by the dissemination of personal computing. Researchers are now able to transcribe tape-recorded data into computer files. With this new medium it is easy to conduct global searches for word combinations across collections of files. It is also possible to enter new codings of the basic text line. Because of the speed and accuracy with which computer files can be copied, it is now much easier to share data between researchers. To foster this sharing of computerized data, a group of child language researchers has established the Child Language Data Exchange System (CHILDES). This article details the formation of the CHILDES, the governance of the system, the nature of the database, the shape of the coding conventions, and the types of computer programs being developed."
            },
            "slug": "Child-language-data-exchange-system-MacWhinney-Snow",
            "title": {
                "fragments": [],
                "text": "The child language data exchange system."
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The formation of the CHILDES, the governance of the system, the nature of the database, the shape of the coding conventions, and the types of computer programs being developed are detailed."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of child language"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48911597"
                        ],
                        "name": "J. Lawler",
                        "slug": "J.-Lawler",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Lawler",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Lawler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143716922"
                        ],
                        "name": "G. Lakoff",
                        "slug": "G.-Lakoff",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Lakoff",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Lakoff"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34262157"
                        ],
                        "name": "Mark Johnson",
                        "slug": "Mark-Johnson",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Johnson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Mark Johnson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1898149,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "1456fba651c261326d8cbec451aca4925092141f",
            "isKey": false,
            "numCitedBy": 11078,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "People use metaphors every time they speak. Some of those metaphors are literary - devices for making thoughts more vivid or entertaining. But most are much more basic than that - they're \"metaphors we live by\", metaphors we use without even realizing we're using them. In this book, George Lakoff and Mark Johnson suggest that these basic metaphors not only affect the way we communicate ideas, but actually structure our perceptions and understandings from the beginning. Bringing together the perspectives of linguistics and philosophy, Lakoff and Johnson offer an intriguing and surprising guide to some of the most common metaphors and what they can tell us about the human mind. And for this new edition, they supply an afterword both extending their arguments and offering a fascinating overview of the current state of thinking on the subject of the metaphor."
            },
            "slug": "Metaphors-We-Live-by-Lawler-Lakoff",
            "title": {
                "fragments": [],
                "text": "Metaphors We Live by"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2693903"
                        ],
                        "name": "S. Pinker",
                        "slug": "S.-Pinker",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Pinker",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Pinker"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62166684,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "fb0641ea5b2c74b0e1fc5163f87d14a886c50e9e",
            "isKey": false,
            "numCitedBy": 2298,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Language learnability and language devlopment revisited the acquisition theory - assumptions and postulates phrase structure rules phrase stucture rules - developmental considerations inflection complementation and control auxiliaries lexical entries and lexical rules."
            },
            "slug": "Language-learnability-and-language-development-Pinker",
            "title": {
                "fragments": [],
                "text": "Language learnability and language development"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Language learnability and language devlopment revisited the acquisition theory - assumptions and postulates phrase structure rules phrase stucture rules - developmental considerations inflection complementation and control auxiliaries lexical entries and lexical rules."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4216119"
                        ],
                        "name": "E. Moerk",
                        "slug": "E.-Moerk",
                        "structuredName": {
                            "firstName": "Ernst",
                            "lastName": "Moerk",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Moerk"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 142248014,
            "fieldsOfStudy": [
                "Psychology",
                "Linguistics"
            ],
            "id": "6987ff7af88145ed57a518185d98c3f6d51f43d5",
            "isKey": false,
            "numCitedBy": 118,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The goals of this volume are twofold: on a general level the volume explores whether evidence for teaching and learning can be found in mother-child interactions during the course of first language acquisition and whether these processes can be objectively described; on a sublevel, the volume investigates whether the denials of frequency and reinforcement effects found in the literature withstand closer scrutiny. The findings support a teaching/learning approach to first language acquisition and demonstrate some of the major principles involved in this process."
            },
            "slug": "The-Mother-Of-Eve:-As-A-First-Language-Teacher-Moerk",
            "title": {
                "fragments": [],
                "text": "The Mother Of Eve: As A First Language Teacher"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2595268"
                        ],
                        "name": "E. Clark",
                        "slug": "E.-Clark",
                        "structuredName": {
                            "firstName": "Eve",
                            "lastName": "Clark",
                            "middleNames": [
                                "V."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Clark"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 58333401,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "83858434767505d834e44e031f283a3a3844b0a8",
            "isKey": false,
            "numCitedBy": 697,
            "numCiting": 109,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-principle-of-contrast:-A-constraint-on-language-Clark",
            "title": {
                "fragments": [],
                "text": "The principle of contrast: A constraint on language acquisition."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145175901"
                        ],
                        "name": "M. Nivat",
                        "slug": "M.-Nivat",
                        "structuredName": {
                            "firstName": "Maurice",
                            "lastName": "Nivat",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Nivat"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 123134220,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f1553e2e546a430e401afdfc1a2e5fc7a5a009f9",
            "isKey": false,
            "numCitedBy": 1287,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Fiftieth-volume-of-theoretical-computer-science-Nivat",
            "title": {
                "fragments": [],
                "text": "Fiftieth volume of theoretical computer science"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46787472"
                        ],
                        "name": "F. Schachter",
                        "slug": "F.-Schachter",
                        "structuredName": {
                            "firstName": "Frances",
                            "lastName": "Schachter",
                            "middleNames": [
                                "Fuchs"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Schachter"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5144825"
                        ],
                        "name": "D. Fosha",
                        "slug": "D.-Fosha",
                        "structuredName": {
                            "firstName": "Diana",
                            "lastName": "Fosha",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Fosha"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "114998761"
                        ],
                        "name": "S. Stemp",
                        "slug": "S.-Stemp",
                        "structuredName": {
                            "firstName": "Sarah",
                            "lastName": "Stemp",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Stemp"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "114508573"
                        ],
                        "name": "Nancy Brotman",
                        "slug": "Nancy-Brotman",
                        "structuredName": {
                            "firstName": "Nancy",
                            "lastName": "Brotman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Nancy Brotman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69479277"
                        ],
                        "name": "Sonia Ganger",
                        "slug": "Sonia-Ganger",
                        "structuredName": {
                            "firstName": "Sonia",
                            "lastName": "Ganger",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Sonia Ganger"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 143997664,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "cb78503d739542a4a88264aeb7fbab055e7c29f7",
            "isKey": false,
            "numCitedBy": 13,
            "numCiting": 50,
            "paperAbstract": {
                "fragments": [],
                "text": "ABSTRACT Interpersonal functions of everyday caretaker speech usage are examined when addressed to toddlers, threes, and fours. Twelve teachers, 4 at each age level, were each observed for 24 3-minute intervals during free play, and their speech classified into 45 responsive and spontaneous functional categories based on our previously developed classification scheme for spontaneous child speech (Schachter et al. 1974). The results support hypotheses derived from Piagetian theory concerning early developments in ego-differentiation. Speech patterns with increments in speech to toddlers include explicating desires, providing substitutes for prohibitions, reporting on the child, and word teaching, called alter-ego speech. Patterns with increments for threes and/or fours include enhancing the child's ego, assisting him to fulfil desires himself, and encouraging persistence, called ego-supportive speech, as well as modulations (explanations, justifications, etc.) and admonitions with appeals to norms, called ego-socializing speech. Implications for language acquisition are discussed."
            },
            "slug": "Everyday-caretaker-talk-to-toddlers-vs.-threes-and-Schachter-Fosha",
            "title": {
                "fragments": [],
                "text": "Everyday Caretaker Talk to Toddlers vs. Threes and Fours."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145717943"
                        ],
                        "name": "G. Wells",
                        "slug": "G.-Wells",
                        "structuredName": {
                            "firstName": "Gordon",
                            "lastName": "Wells",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Wells"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 56818873,
            "fieldsOfStudy": [
                "Education",
                "Psychology"
            ],
            "id": "93f5f0d55d8dd3f3002b0aff2776bd5910b349cc",
            "isKey": false,
            "numCitedBy": 958,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The children and their families learning to talk - the pattern of development learning to talk - the construction of language talking to learn from home to school helping children to make knowledge their own differences between children in language and learning the centrality of literacy the children's achievements at the age of 10 the sense of story relating practice to theory."
            },
            "slug": "The-Meaning-Makers:-Children-Learning-Language-and-Wells",
            "title": {
                "fragments": [],
                "text": "The Meaning Makers: Children Learning Language and Using Language to Learn. First Edition."
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "The children and their families learning to talk - the pattern of development learning toTalk - the construction of language talking to learn from home to school helping children to make knowledge their own differences between children in language."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2225767"
                        ],
                        "name": "G. Borchardt",
                        "slug": "G.-Borchardt",
                        "structuredName": {
                            "firstName": "Gary",
                            "lastName": "Borchardt",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Borchardt"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2776228,
            "fieldsOfStudy": [
                "Computer Science",
                "Mathematics"
            ],
            "id": "021b9238dbecbff15a07b5ca97bbe9e2cc3946d6",
            "isKey": false,
            "numCitedBy": 71,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents Event Calculus, a model for representing the identifying characteristics of physical events in terms of changes in a scene and time-related combinations of other physical events. The model is used to construct a knowledge-based system for event recognition which forms a high-level description of changes in a scene, given a low-level description as input. \n \nTime-varying information is represented in the form of \"GRAPHs\", data structures which plot the elements of various domains against time. Several varieties of operations are presented which map GRAPHs into GRAPHs, and representations of physical events are formed as symbolic expressions involving these operations. The paper concludes with an overview of the event recognition system, as implemented in INTERLISP on a VAX 11/780, and an example of a session with this system."
            },
            "slug": "Event-Calculus-Borchardt",
            "title": {
                "fragments": [],
                "text": "Event Calculus"
            },
            "tldr": {
                "abstractSimilarityScore": 95,
                "text": "This paper presents Event Calculus, a model for representing the identifying characteristics of physical events in terms of changes in a scene and time-related combinations of other physical events, used to construct a knowledge-based system for event recognition."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102460807"
                        ],
                        "name": "K. Kaye",
                        "slug": "K.-Kaye",
                        "structuredName": {
                            "firstName": "Kelley",
                            "lastName": "Kaye",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Kaye"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 42889590,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "051307b0d6c0ce2c10540fdff8a9d4575c01482b",
            "isKey": false,
            "numCitedBy": 67,
            "numCiting": 41,
            "paperAbstract": {
                "fragments": [],
                "text": "ABSTRACT The speech of 36 mothers to their infants in a face-to-face situation at ages 6, 13 and 26 weeks was compared with unfamiliar adults' speech to the same infants, the mothers' speech to an interviewer, and their conversations with the same children 2 years later. Speech to the infants was quite different from so-called ‘baby talk’, but contrary to other authors the speech to infants was even shorter, more repetitive, and more limited in content than the speech to language-learning children. Differences appear due to the infant's changing status in the relationship, from a potential to an actual conversant."
            },
            "slug": "Why-we-don't-talk-‘baby-talk’-to-babies-Kaye",
            "title": {
                "fragments": [],
                "text": "Why we don't talk 'baby talk' to babies."
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "Speech to the infants was quite different from so-called ‘baby talk’, but contrary to other authors the speech was even shorter, more repetitive, and more limited in content than the speech to language-learning children."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of child language"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2091050071"
                        ],
                        "name": "C. Snow",
                        "slug": "C.-Snow",
                        "structuredName": {
                            "firstName": "Catherine",
                            "lastName": "Snow",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Snow"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 144384083,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "0aefa20092012124200d68bae8d22f44ca1bf97a",
            "isKey": false,
            "numCitedBy": 683,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": "ABSTRACT The speech of two mothers to their infants at several points between three and eighteen months of age was analysed. Simplicity of the speech, as measured by MLU, was about the same at all ages, and none of the other features of the mothers' speech style showed any abrupt change at the time the children started to talk. The changes that did occur started much earlier, at about seven months. These findings are incompatible with the explanation that mothers speak simply and redundantly in response to cues of attention and comprehension from the child listener. It is suggested that the mothers interacted with their infants using a conversational model, and that the changes in the mothers' speech reflect their children's growing ability to function as conversational partners."
            },
            "slug": "The-development-of-conversation-between-mothers-and-Snow",
            "title": {
                "fragments": [],
                "text": "The development of conversation between mothers and babies"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145895495"
                        ],
                        "name": "P. Lincoln",
                        "slug": "P.-Lincoln",
                        "structuredName": {
                            "firstName": "Patrick",
                            "lastName": "Lincoln",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Lincoln"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 3035174,
            "fieldsOfStudy": [
                "Computer Science",
                "Philosophy"
            ],
            "id": "5e49bd8b8394995e7c16ce25f62087d43d6a7b61",
            "isKey": false,
            "numCitedBy": 3070,
            "numCiting": 46,
            "paperAbstract": {
                "fragments": [],
                "text": "Linear logic was introduced by Girard in 1987 [11] . Since then many results have supported Girard' s statement, \"Linear logic is a resource conscious logic,\" and related slogans . Increasingly, computer scientists have come to recognize linear logic as an expressive and powerful logic with connection s to a variety of topics in computer science . This column presents a.n intuitive overview of linear logic, some recent theoretical results, an d summarizes several applications of linear logic to computer science . Other introductions to linear logic may be found in [12, 361 ."
            },
            "slug": "Linear-logic-Lincoln",
            "title": {
                "fragments": [],
                "text": "Linear logic"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This column presents an intuitive overview of linear logic, some recent theoretical results, and summarizes several applications oflinear logic to computer science."
            },
            "venue": {
                "fragments": [],
                "text": "SIGA"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143739156"
                        ],
                        "name": "S. Shapiro",
                        "slug": "S.-Shapiro",
                        "structuredName": {
                            "firstName": "Stuart",
                            "lastName": "Shapiro",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Shapiro"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61127813,
            "fieldsOfStudy": [
                "Art",
                "Computer Science"
            ],
            "id": "44c3c87c90d795ae9b3bc7c02024cc4390aa64f9",
            "isKey": false,
            "numCitedBy": 788,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "From the Publisher: \nEncompasses the variable approaches to Artificial Intelligence in 267 articles written by 205 experts. It is a comprehensive, up-to-date reference work that defines the discipline and brings together the core of knowledge from all the AI fields. Clarifies and corrects misinterpretations and provides a proper understanding of Artificial Intelligence."
            },
            "slug": "Encyclopedia-of-Artificial-Intelligence-Shapiro",
            "title": {
                "fragments": [],
                "text": "Encyclopedia of Artificial Intelligence"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "This reference work compasses the variable approaches to Artificial Intelligence in 267 articles written by 205 experts and clarifies and corrects misinterpretations and provides a proper understanding of Artificial Intelligence."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1751239"
                        ],
                        "name": "R. Dechter",
                        "slug": "R.-Dechter",
                        "structuredName": {
                            "firstName": "Rina",
                            "lastName": "Dechter",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Dechter"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1277010,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "ab3724bb2078b90c3307745bc32a9bd402ec20aa",
            "isKey": false,
            "numCitedBy": 284,
            "numCiting": 34,
            "paperAbstract": {
                "fragments": [],
                "text": "A constraint satisfaction problem (csp) de ned over a constraint network consists of a nite set of variables, each associated with a domain of values, and a set of constraints. A solution is an assignment of a value to each variable from its domain such that all the constraints are satis ed. Typical constraint satisfaction problems are to determine whether a solution exists, to nd one or all solutions and to nd an optimal solution relative to a given cost function. An example of a constraint satisfaction problem is the well known k-colorability. The problem is to color, if possible, a given graph with k colors only, such that any two adjacent nodes have di erent colors. A constraint satisfaction formulation of this problem associates the nodes of the graph with variables, the possible colors are their domains and the inequality constraints between adjacent nodes are the constraints of the problem. Each constraint of a csp may be expressed as a relation, de ned on some subset of variables, denoting their legal combinations of values. As well, constraints"
            },
            "slug": "Constraint-Satisfaction-Dechter",
            "title": {
                "fragments": [],
                "text": "Constraint Satisfaction"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143716922"
                        ],
                        "name": "G. Lakoff",
                        "slug": "G.-Lakoff",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Lakoff",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Lakoff"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 142299281,
            "fieldsOfStudy": [
                "Computer Science",
                "Psychology"
            ],
            "id": "d03e21ac514278f6860908dacd133a2485c13cbc",
            "isKey": false,
            "numCitedBy": 5038,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Women,-Fire,-and-Dangerous-Things-Lakoff",
            "title": {
                "fragments": [],
                "text": "Women, Fire, and Dangerous Things"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 1297,
                                "start": 13
                            }
                        ],
                        "text": "Furthermore, Aslin et al. (1995) report that even when parents were given explicit instructions to teach words to their children, in the data gathered for 13 out of 19 parent-child pairs, fewer than 30% of the parental utterances consisted of isolated words. Even if these cursory estimates are atypically low, there are still whole classes of words, such as obligatorily-transitive verbs, prepositions, quantifiers, and determiners, that would rarely, if ever, appear in isolated-word utterances. The following question then arises: Given multi-word input, how do children figure out which words map to which parts of the utterance meaning ? Presumably, children could consider all possible mappings, examine multiple situations, and accept only those mappings consistent with all, or at least many, of the different situations encountered. This basic strategy has been suggested by numerous authors, including Pinker (1989), who called it \"event category labeling,\" and Fisher et al. (1994), who called it \"cross-situational learning.\" This paper attempts to formalize and extend this notion, and to explore its efficacy by way of computational simulations. The algorithm described in this paper also performs an additional form of inference, similar to that proposed by Tishby and Gorin (1994), allowing known meanings of some words in an utterance to constrain the hypotheses about the meanings of other words in that utterance."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 926,
                                "start": 13
                            }
                        ],
                        "text": "Furthermore, Aslin et al. (1995) report that even when parents were given explicit instructions to teach words to their children, in the data gathered for 13 out of 19 parent-child pairs, fewer than 30% of the parental utterances consisted of isolated words. Even if these cursory estimates are atypically low, there are still whole classes of words, such as obligatorily-transitive verbs, prepositions, quantifiers, and determiners, that would rarely, if ever, appear in isolated-word utterances. The following question then arises: Given multi-word input, how do children figure out which words map to which parts of the utterance meaning ? Presumably, children could consider all possible mappings, examine multiple situations, and accept only those mappings consistent with all, or at least many, of the different situations encountered. This basic strategy has been suggested by numerous authors, including Pinker (1989), who called it \"event category labeling,\" and Fisher et al."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 33,
                                "start": 13
                            }
                        ],
                        "text": "Furthermore, Aslin et al. (1995) report that even when parents were given explicit instructions to teach words to their children, in the data gathered for 13 out of 19 parent-child pairs, fewer than 30% of the parental utterances consisted of isolated words."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 993,
                                "start": 13
                            }
                        ],
                        "text": "Furthermore, Aslin et al. (1995) report that even when parents were given explicit instructions to teach words to their children, in the data gathered for 13 out of 19 parent-child pairs, fewer than 30% of the parental utterances consisted of isolated words. Even if these cursory estimates are atypically low, there are still whole classes of words, such as obligatorily-transitive verbs, prepositions, quantifiers, and determiners, that would rarely, if ever, appear in isolated-word utterances. The following question then arises: Given multi-word input, how do children figure out which words map to which parts of the utterance meaning ? Presumably, children could consider all possible mappings, examine multiple situations, and accept only those mappings consistent with all, or at least many, of the different situations encountered. This basic strategy has been suggested by numerous authors, including Pinker (1989), who called it \"event category labeling,\" and Fisher et al. (1994), who called it \"cross-situational learning."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Models of word segmentation"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1995
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 1380,
                                "start": 8
                            }
                        ],
                        "text": "(1993), Christophe et al. (1994), and Brent and Cartwright (this issue), among others, discuss some different segmentation strategies that children appear to use, depending on their native language. The perceptual/ conceptual faculty produces hypothesized meaning representations to associate with each utterance heard. For example, the perceptual/conceptual faculty might produce the conceptual symbol apple when seeing an apple, or the conceptual expression CAUSE(mother, GO(ball, UP)) when seeing Mother lift a ball. Badler (1975), Okada (1979), Borchardt (1985), Hays (1989), and Siskind (1992, 1995), among others, describe computational approaches to visual event perception, while Regier (1992) describes a method for learning such perceptual/conceptual processes. In order to accommodate the acquisition of meanings of words that refer to non-visual stimuli, as well as lexical acquisition by blind children, one can take the perceptual/conceptual faculty to be the combination of all perceptual modalities, not just vision. One can similarly generalize the notion of speechperception faculty to include visual and haptic input in order to accommodate lexical acquisition of signed languages as well. Snow (1977) reports that as many as 49% of the utterances heard by children do not refer to the here-and-now. Similarly, Fisher et al. (1994) cites Beckwith et al. (1989) claiming that close to a third of verb uses to young children do not refer to the here-and-now."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 534,
                                "start": 8
                            }
                        ],
                        "text": "(1993), Christophe et al. (1994), and Brent and Cartwright (this issue), among others, discuss some different segmentation strategies that children appear to use, depending on their native language. The perceptual/ conceptual faculty produces hypothesized meaning representations to associate with each utterance heard. For example, the perceptual/conceptual faculty might produce the conceptual symbol apple when seeing an apple, or the conceptual expression CAUSE(mother, GO(ball, UP)) when seeing Mother lift a ball. Badler (1975), Okada (1979), Borchardt (1985), Hays (1989), and Siskind (1992, 1995), among others, describe computational approaches to visual event perception, while Regier (1992) describes a method for learning such perceptual/conceptual processes."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 33,
                                "start": 8
                            }
                        ],
                        "text": "(1993), Christophe et al. (1994), and Brent and Cartwright (this issue), among others, discuss some different segmentation strategies that children appear to use, depending on their native language."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 2484,
                                "start": 8
                            }
                        ],
                        "text": "(1993), Christophe et al. (1994), and Brent and Cartwright (this issue), among others, discuss some different segmentation strategies that children appear to use, depending on their native language. The perceptual/ conceptual faculty produces hypothesized meaning representations to associate with each utterance heard. For example, the perceptual/conceptual faculty might produce the conceptual symbol apple when seeing an apple, or the conceptual expression CAUSE(mother, GO(ball, UP)) when seeing Mother lift a ball. Badler (1975), Okada (1979), Borchardt (1985), Hays (1989), and Siskind (1992, 1995), among others, describe computational approaches to visual event perception, while Regier (1992) describes a method for learning such perceptual/conceptual processes. In order to accommodate the acquisition of meanings of words that refer to non-visual stimuli, as well as lexical acquisition by blind children, one can take the perceptual/conceptual faculty to be the combination of all perceptual modalities, not just vision. One can similarly generalize the notion of speechperception faculty to include visual and haptic input in order to accommodate lexical acquisition of signed languages as well. Snow (1977) reports that as many as 49% of the utterances heard by children do not refer to the here-and-now. Similarly, Fisher et al. (1994) cites Beckwith et al. (1989) claiming that close to a third of verb uses to young children do not refer to the here-and-now. To partly deal with this problem, I assume that while the perceptual/conceptual faculty primarily produces descriptions of observed objects, states, and events, more generally it can hypothesize what a speaker is likely to have said in a given situation, even though such utterances might have referred to something not directly observable. The perceptual/conceptual faculty need not be telepathic to make such hypotheses. Instead, it can incorporate naive psychological knowledge and use this knowledge to make inferences about the beliefs, goals, desires, and intentions of other agents. For example, the perceptual/conceptual faculty might produce WANT(mother, bali) when the child observes Mother reach for a ball, or NOT-BE(father, AT(home)) when the child looks around crying and Mother says that Father isn't home. The model presented here does not require the perceptual/conceptual faculty to produce representations of all true statements about the world, whether positive or negative. Quine (1960) points out that there are an infinite number of true facts about the world that a learner might need to entertain as potential meanings of each utterance."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 1221,
                                "start": 8
                            }
                        ],
                        "text": "(1993), Christophe et al. (1994), and Brent and Cartwright (this issue), among others, discuss some different segmentation strategies that children appear to use, depending on their native language. The perceptual/ conceptual faculty produces hypothesized meaning representations to associate with each utterance heard. For example, the perceptual/conceptual faculty might produce the conceptual symbol apple when seeing an apple, or the conceptual expression CAUSE(mother, GO(ball, UP)) when seeing Mother lift a ball. Badler (1975), Okada (1979), Borchardt (1985), Hays (1989), and Siskind (1992, 1995), among others, describe computational approaches to visual event perception, while Regier (1992) describes a method for learning such perceptual/conceptual processes. In order to accommodate the acquisition of meanings of words that refer to non-visual stimuli, as well as lexical acquisition by blind children, one can take the perceptual/conceptual faculty to be the combination of all perceptual modalities, not just vision. One can similarly generalize the notion of speechperception faculty to include visual and haptic input in order to accommodate lexical acquisition of signed languages as well. Snow (1977) reports that as many as 49% of the utterances heard by children do not refer to the here-and-now."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Do infants perceive word boundaries"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143720221"
                        ],
                        "name": "M. Shibatani",
                        "slug": "M.-Shibatani",
                        "structuredName": {
                            "firstName": "Masayoshi",
                            "lastName": "Shibatani",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Shibatani"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 215874555,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e2ff6a86e56794854961888074a4ba2a3c9f6a20",
            "isKey": false,
            "numCitedBy": 201,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Three-Reasons-for-Not-Deriving-‘Kill’-from-‘Cause-Shibatani",
            "title": {
                "fragments": [],
                "text": "Three Reasons for Not Deriving ‘Kill’ from ‘Cause to Die’ in Japanese"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144730709"
                        ],
                        "name": "D. Norris",
                        "slug": "D.-Norris",
                        "structuredName": {
                            "firstName": "Dennis",
                            "lastName": "Norris",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Norris"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143789092"
                        ],
                        "name": "A. Cutler",
                        "slug": "A.-Cutler",
                        "structuredName": {
                            "firstName": "Anne",
                            "lastName": "Cutler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Cutler"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 201699850,
            "fieldsOfStudy": [],
            "id": "2d362809cf4b9a88679e363fe56bf87e5042a3d9",
            "isKey": false,
            "numCitedBy": 15,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Juncture-detection-Norris-Cutler",
            "title": {
                "fragments": [],
                "text": "Juncture detection"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145895567"
                        ],
                        "name": "L. Lam",
                        "slug": "L.-Lam",
                        "structuredName": {
                            "firstName": "Lui",
                            "lastName": "Lam",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Lam"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69324542"
                        ],
                        "name": "V. Naroditsky",
                        "slug": "V.-Naroditsky",
                        "structuredName": {
                            "firstName": "Vladimir",
                            "lastName": "Naroditsky",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Naroditsky"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 184303380,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0e3a3a0799ae4cfc77ec0cc2f4e2a264cd0816cd",
            "isKey": false,
            "numCitedBy": 51,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Modeling-Complex-Phenomena-Lam-Naroditsky",
            "title": {
                "fragments": [],
                "text": "Modeling Complex Phenomena"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2590693"
                        ],
                        "name": "A. W. Melton",
                        "slug": "A.-W.-Melton",
                        "structuredName": {
                            "firstName": "Arthur",
                            "lastName": "Melton",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. W. Melton"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144559474"
                        ],
                        "name": "E. Martin",
                        "slug": "E.-Martin",
                        "structuredName": {
                            "firstName": "Edwin",
                            "lastName": "Martin",
                            "middleNames": [
                                "Thomas"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Martin"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 145280037,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "089a96db127d062e1d80234977a0b53b19e88011",
            "isKey": false,
            "numCitedBy": 780,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Coding-Processes-in-Human-Memory.-Melton-Martin",
            "title": {
                "fragments": [],
                "text": "Coding Processes in Human Memory."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69422244"
                        ],
                        "name": "M. R. Manzini",
                        "slug": "M.-R.-Manzini",
                        "structuredName": {
                            "firstName": "Maria",
                            "lastName": "Manzini",
                            "middleNames": [
                                "Rita"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. R. Manzini"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 144740316,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "dfd08585d799c7d3cc61f59f19a1fbeffc9c770c",
            "isKey": false,
            "numCitedBy": 481,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Learnability-and-Cognition-Manzini",
            "title": {
                "fragments": [],
                "text": "Learnability and Cognition"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143998726"
                        ],
                        "name": "G. Leech",
                        "slug": "G.-Leech",
                        "structuredName": {
                            "firstName": "Geoffrey",
                            "lastName": "Leech",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Leech"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 119439348,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "9453fe437314d35687eb1ccc0a3c98ce056d8935",
            "isKey": false,
            "numCitedBy": 263,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Towards-a-semantic-description-of-English-Leech",
            "title": {
                "fragments": [],
                "text": "Towards a semantic description of English"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1969
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4632093"
                        ],
                        "name": "G. Zipf",
                        "slug": "G.-Zipf",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Zipf",
                            "middleNames": [
                                "Kingsley"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Zipf"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 141120597,
            "fieldsOfStudy": [
                "Computer Science",
                "Psychology"
            ],
            "id": "2bcf3e6c2b45c052a0bd0183cc29c03acc4b49ac",
            "isKey": false,
            "numCitedBy": 7038,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Human-behavior-and-the-principle-of-least-effort-Zipf",
            "title": {
                "fragments": [],
                "text": "Human behavior and the principle of least effort"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1949
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145166238"
                        ],
                        "name": "A. Bundy",
                        "slug": "A.-Bundy",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Bundy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Bundy"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 58486915,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5dad1161bb2a06ce014da96fbb6beb14ad080f95",
            "isKey": false,
            "numCitedBy": 72,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Proceedings-of-the-Eighth-International-Joint-on-Bundy",
            "title": {
                "fragments": [],
                "text": "Proceedings of the Eighth International Joint Conference on Artificial Intelligence"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1699200"
                        ],
                        "name": "N. Badler",
                        "slug": "N.-Badler",
                        "structuredName": {
                            "firstName": "Norman",
                            "lastName": "Badler",
                            "middleNames": [
                                "I."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Badler"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60491960,
            "fieldsOfStudy": [
                "Philosophy"
            ],
            "id": "08f2c223af5a5aa61dd1859e44c5356d4f9d995e",
            "isKey": false,
            "numCitedBy": 154,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Temporal-scene-analysis:-conceptual-descriptions-of-Badler",
            "title": {
                "fragments": [],
                "text": "Temporal scene analysis: conceptual descriptions of object movements."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2072618742"
                        ],
                        "name": "Christian Freksa",
                        "slug": "Christian-Freksa",
                        "structuredName": {
                            "firstName": "Christian",
                            "lastName": "Freksa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Christian Freksa"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144379237"
                        ],
                        "name": "C. Habel",
                        "slug": "C.-Habel",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Habel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Habel"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 23531234,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8ff630b514a80066d127ab6e730f8e76effd4139",
            "isKey": false,
            "numCitedBy": 37,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Repräsentation-und-Verarbeitung-räumlichen-Wissens-Freksa-Habel",
            "title": {
                "fragments": [],
                "text": "Repräsentation und Verarbeitung räumlichen Wissens"
            },
            "venue": {
                "fragments": [],
                "text": "Repräsentation und Verarbeitung räumlichen Wissens"
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "English verbs of motion: A case study in semantics and lexical memory"
            },
            "venue": {
                "fragments": [],
                "text": "A.W."
            },
            "year": 1972
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "English verbs of motion: A case study in semantics and lexical memory Coding processes in human memory"
            },
            "venue": {
                "fragments": [],
                "text": "English verbs of motion: A case study in semantics and lexical memory Coding processes in human memory"
            },
            "year": 1972
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Dispelling myths about language bootstrapping"
            },
            "venue": {
                "fragments": [],
                "text": "AAAI Spring Symposium Workshop on Machine Learning of Natural Language and Ontology. Paulo Alto, CA"
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Lexical acquisition as constraint satisfaction (Tech. Rep. IRCS-93-41)"
            },
            "venue": {
                "fragments": [],
                "text": "Lexical acquisition as constraint satisfaction (Tech. Rep. IRCS-93-41)"
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Human behavior and the principle qf least effort"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1949
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Human behavior and the principle qf least effort"
            },
            "venue": {
                "fragments": [],
                "text": "Human behavior and the principle qf least effort"
            },
            "year": 1949
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The acquisition of non-basic sentences"
            },
            "venue": {
                "fragments": [],
                "text": "Paper presented at the Boston University Conference on Language Development"
            },
            "year": 1989
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Natural communication with mobih, robots. Master's thesis"
            },
            "venue": {
                "fragments": [],
                "text": "Natural communication with mobih, robots. Master's thesis"
            },
            "year": 1994
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Complement selection and the lexicon"
            },
            "venue": {
                "fragments": [],
                "text": "Linguistic Inquiry, 10, 279-326. Grimshaw, J. (1981). Form, function, and the language acquisition device. In C.L. Baker & J.J."
            },
            "year": 1979
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Semantic structures"
            },
            "venue": {
                "fragments": [],
                "text": "Semantic structures"
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The child as word learner Linguistic theory and psychological reality"
            },
            "venue": {
                "fragments": [],
                "text": "The child as word learner Linguistic theory and psychological reality"
            },
            "year": 1978
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Solving a lexical acquisition task via an encoding as a propositional satisfiability problem"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the 6th Annual CUNY Sentence Processing Conference"
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Child's talk"
            },
            "venue": {
                "fragments": [],
                "text": "Child's talk"
            },
            "year": 1983
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 126,
                                "start": 104
                            }
                        ],
                        "text": "This realization has motivated my own research (Siskind, 1992, 1995), as well as that of others such as Feldman et al. (1990), Suppes et al."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 148,
                                "start": 104
                            }
                        ],
                        "text": "This realization has motivated my own research (Siskind, 1992, 1995), as well as that of others such as Feldman et al. (1990), Suppes et al. (1991), and Torrance (1994), to study language acquisition computationaUy in the context of perception and action, and to focus on the requisite conceptual representations involved."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Miniature language acquisition: A"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Lexical acquisition as constraint satisfaction (Tech"
            },
            "venue": {
                "fragments": [],
                "text": "Rep. IRCS-93-41). University of Pennsylvania Institute for Research in Cognitive Science."
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Complement selection and the lexicon"
            },
            "venue": {
                "fragments": [],
                "text": "Linguistic Inquiry"
            },
            "year": 1979
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 4,
            "methodology": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 74,
        "totalPages": 8
    },
    "page_url": "https://www.semanticscholar.org/paper/A-computational-study-of-cross-situational-for-Siskind/2854f6721708f1f3d5fe746e11efe0c866f83c19?sort=total-citations"
}