{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144873562"
                        ],
                        "name": "R. Bellman",
                        "slug": "R.-Bellman",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Bellman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Bellman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122573583,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "910d3158af44ba3fc8a92ec5afd13c9ae930eff9",
            "isKey": false,
            "numCitedBy": 195,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : THE PROBLEM OF DETERMINING AN OPTIMAL TESTING POLICY WHERE ONE SIMULTANEOUSLY GAINS AND LEARNS FOR THE CASE WHERE THE OUTCOME OF ONE CHOICE IS KNOWN AND THE OTHER IS SUBJECT TO A KNOWN A PRIORI DISTRIBUTION IS CONSIDERED. Results of Johnson and Karlin, P-328, are obtained in a different way and extended. The methods used are applicable to more general processes."
            },
            "slug": "A-PROBLEM-IN-THE-SEQUENTIAL-DESIGN-OF-EXPERIMENTS-Bellman",
            "title": {
                "fragments": [],
                "text": "A PROBLEM IN THE SEQUENTIAL DESIGN OF EXPERIMENTS"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1954
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2060063828"
                        ],
                        "name": "R. N. Bradt",
                        "slug": "R.-N.-Bradt",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Bradt",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. N. Bradt"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107260789"
                        ],
                        "name": "S. Johnson",
                        "slug": "S.-Johnson",
                        "structuredName": {
                            "firstName": "S.",
                            "lastName": "Johnson",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Johnson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145737605"
                        ],
                        "name": "S. Karlin",
                        "slug": "S.-Karlin",
                        "structuredName": {
                            "firstName": "Samuel",
                            "lastName": "Karlin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Karlin"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 121796253,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "d9c6fbd715061998af2feb9ed447393d74b0cccb",
            "isKey": false,
            "numCitedBy": 207,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "On-Sequential-Designs-for-Maximizing-the-Sum-of-$n$-Bradt-Johnson",
            "title": {
                "fragments": [],
                "text": "On Sequential Designs for Maximizing the Sum of $n$ Observations"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1956
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144873562"
                        ],
                        "name": "R. Bellman",
                        "slug": "R.-Bellman",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Bellman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Bellman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2065631"
                        ],
                        "name": "R. Kalaba",
                        "slug": "R.-Kalaba",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Kalaba",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Kalaba"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 117513158,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ebc35e18ca9ccba103acb2482a5cf64fe5064313",
            "isKey": false,
            "numCitedBy": 22,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : The fundamental problem of determining the utility of a communication channel in conveying information is viewed as a problem within the framework of multistage decision processes of stochastic type, and as such is treated by the theory of dynamic programming. The relations between utility and capacity, in Shannon's sense, are indicated. Treatment of communication problems involving the use of a channel whose properties are not completely known, and those involving processes of random duration, are shown. Treatments of general processes in a uniform fashion by the functional equation technique of dynamic programming are discussed."
            },
            "slug": "On-communication-processes-involving-learning-and-Bellman-Kalaba",
            "title": {
                "fragments": [],
                "text": "On communication processes involving learning and random duration."
            },
            "tldr": {
                "abstractSimilarityScore": 96,
                "text": "The fundamental problem of determining the utility of a communication channel in conveying information is viewed as a problem within the framework of multistage decision processes of stochastic type, and as such is treated by the theory of dynamic programming."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1958
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145289234"
                        ],
                        "name": "J. Bertram",
                        "slug": "J.-Bertram",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Bertram",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Bertram"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 51664288,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "93c5271fdae2b7d04d21a5ca0ed638d84da32514",
            "isKey": false,
            "numCitedBy": 5,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper is concerned with the problem of designing an “adaptive controller” for the control of a certain class of dynamic processes. In general, these processes consist of a dynamic element governed by a nonstationary, linear differential equation. It is assumed that the designer knows only the form of the differential equation and bounds on the parameter variations but not the exact equations. A further complication of the problem is that all measurements of the state variables of the process are obscured by additive noise."
            },
            "slug": "Control-by-stochastic-adjustment-Bertram",
            "title": {
                "fragments": [],
                "text": "Control by stochastic adjustment"
            },
            "venue": {
                "fragments": [],
                "text": "Transactions of the American Institute of Electrical Engineers, Part II: Applications and Industry"
            },
            "year": 1960
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145969445"
                        ],
                        "name": "J. K. Hawkins",
                        "slug": "J.-K.-Hawkins",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Hawkins",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. K. Hawkins"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 51640615,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3172e6c45788cfc0fcf6d35d29473d55e1b017e4",
            "isKey": false,
            "numCitedBy": 49,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "The class of self-organizing systems represented by networks which learn to recognize patterns is reviewed from an historical standpoint, and some of the behavioral similarities between such nets and biological nervous systems are discussed. Examples and results of several experimental models for alphanumeric character recognition are presented. The network synthesis problem is then recast in terms of redundant information removal, multivariable curve-fitting and expansion in orthonormal functions. Recognition network structures and the learning process are described from these points of view. The potential component and behavioral advantages to be gained from sequential feedback networks are discussed briefly."
            },
            "slug": "Self-Organizing-Systems-A-Review-and-Commentary-Hawkins",
            "title": {
                "fragments": [],
                "text": "Self-Organizing Systems-A Review and Commentary"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "The class of self-organizing systems represented by networks which learn to recognize patterns is reviewed from an historical standpoint, and some of the behavioral similarities between such nets and biological nervous systems are discussed."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the IRE"
            },
            "year": 1961
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47267396"
                        ],
                        "name": "A. Dvoretzky",
                        "slug": "A.-Dvoretzky",
                        "structuredName": {
                            "firstName": "Aryeh",
                            "lastName": "Dvoretzky",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Dvoretzky"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 51142582,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "675a80d84e79bd6197f63dc1fc96170af90a4e77",
            "isKey": false,
            "numCitedBy": 258,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "Stochastic approximation is concerned with schemes converging to some sought value when, due to the stochastic nature of the problem, the observations involve errors. The interesting schemes are those which are self-correcting, that is, in which a mistake always tends to be wiped out in the limit, and in which the convergence to the desired value is of some specified nature, for example, it is mean-square convergence. The typical example of such a scheme is the original one of Robbins-Monro [7] for approximating, under suitable conditions, the point where a regression function assumes a given value. Robbins and Monro have proved mean-square convergence to the root; Wolfowitz [8] showed that under weaker assumptions there is still convergence in probability to the root; and Blum [11 demonstrated that, under still weaker assumptions, there is not only convergence in probability but even convergence with probability 1. Kiefer and Wolfowitz [6] have devised a method for approximating the point where the maximum of a regression function occurs. They proved that under suitable conditions there is convergence in probability and Blum [1] has weakened somewhat the conditions and strengthened the conclusion to convergence with probability 1. The two schemes mentioned above are rather specific. We shall deal with a vastly more general situation. The underlying idea is to think of the random element as noise superimposed on a convergent deterministic scheme. The Robbins-Monro and KieferWolfowitz procedures, under conditions weaker than any previously considered, are included as very special cases and, despite this generality, the conclusion is stronger since our results assert that the convergence is both in mean-square and with probability 1. The main results are stated in section 2 and their proof follows in sections 3 and 4. Various generalizations are given in section 5, while section 6 furnishes an instructive counterexample. The Robbins-Monro and Kiefer-Wolfowitz procedures are treated in section 7. Because of the generality of our results the proofs in sections 3 and 4 have to overcome a number of technical difficulties and are somewhat involved. A special case of considerable scope where the technical difficulties disappear is discussed in section 8. This section is essentially self-contained and includes an extremely simple complete proof of the mean-square convergence result in the special case, which illustrates the underlying idea of our method. In section 8 we also find the best (unique minimax in a nonasymptotic sense) way of choosing the an in a special case of the Robbins-Monro scheme [they are of the form c/(n + c')]. The concluding section 9 contains some remarks on extensions to nonreal random variables and other topics. Since the primary object of this paper is to give the general approach, no attempt has been made to study any specific procedures except the well-known Robbins-Monro and Kiefer-Wolfowitz schemes which serve as imustrations."
            },
            "slug": "On-Stochastic-Approximation-Dvoretzky",
            "title": {
                "fragments": [],
                "text": "On Stochastic Approximation"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1956
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 6,
        "totalPages": 1
    },
    "page_url": "https://www.semanticscholar.org/paper/V.-Adaptive-Control-Processes-Bellman/4a0cd8a28b7668fcd38b98b8e1598c33e1852077?sort=total-citations"
}